{
  "id": "241",
  "year": "2016",
  "url": "https://developer.apple.com/videos/play/wwdc2016/241/",
  "title": "Public Transit in Apple Maps",
  "speakers": [],
  "duration": "",
  "topics": [
    "Maps & Location"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello. My name is Ellis Verosub, and I'm responsible for public transit in Apple Maps. Our goal here at Apple is always to create the best possible customer experience. We believe that design is not just about how something looks but how it works. Great experiences are intuitive and seamless. In this talk, I'd like to explore how these ideas apply to transit in Apple Maps. But first, I'd like to start by giving you an overview of our product. Transit launched in September 2015 as part of iOS 9 and Mac OS X, El Capitan. As of today, it is available in 21 cities around the world as well as over 300 cities in China. We use transit schedule data from over 250 transit agencies. Here's a bit of a fun fact. To date, we've mapped more than 16,000 station entrances. Next, I'd like to give you an overview of the four key features of our product. The first is a beautiful transit map. Roads and other driving-related elements have been dimmed out while transit lines and key terminus and transfer stations are emphasized.\n\nThe second feature is a departure board for each station showing each line that services the station.\n\nThe third is detailed point to point directions along with a guided navigation experience.\n\nFinally, we show realtime advisories and even modify our recommended directions in response to planned service changes or unplanned incidents.\n\nOur goal is to provide a great experience in each city we support. So how do we do that? We start with agency schedule data, but we don't stop there. We collect additional data through original research and field surveys. Then we add in a layer of curation to surprise and delight our customers. Our goal is that at every moment customers should be able to match the instruction we're giving them to what they see in the real world around them. Gathering these details takes a long time. But as Steve Jobs once said, \"Details matter. It's worth waiting to get it right\".\n\nHere are some examples of additional data that we collect ourselves.\n\nStation entrances and exits.\n\nStation footprints or the outlines of stations.\n\nAgency signage. And the real world path of transit lines by which I mean the path that trains and buses and ferries actually take in the real world. This example shows a station entrance in London. We've individually surveys every entrance not just for location but also type. Stairs, escalator, elevator, and so forth.\n\nHere is that same entrance represented on our transit map. You can also see the station outline here. This is really helpful in terms of finding your way into and out of train stations.\n\nStations have different names for exits and entrances. From the outside, the entrance might not even have a name. But from the inside, there's often a number or code.\n\nWe show that number or code on our map so that you can be confident you are going in the correct direction.\n\nWe try to match agency signage as closely as possible not just in terms of the signage itself, but also what gets displayed where and in what order. Again, you see that reflected on our map.\n\nFinally, something that is very important to us is that the transit lines shown on the map follow their actual paths. Many iconic transit maps such as the London underground map are schematic, not representative of the actual path the lines take. However, with a digital map on a mobile device, it's important that your location position as reflected on the map matches up with the line you're actually traveling on. This builds confidence in the directions the customer has been given.\n\nAfter we've gathered all of this additional data, we go even deeper into the experience. Our belief is that every city has a unique transit culture, and we try to understand and respect this culture reflecting it back at our customers. In the next few slides, I'm going to dive into a few examples.\n\nBoarding instructions vary from system to system. For example, in London you board lines. Whereas in New York you board trains. You don't take the Victoria train in London or the A Line in New York. That's not a local convention. Sometimes the line name matters, but sometimes only the system name matters. Here in the Bay Area, for example, you just take BART. Sometimes the local convention includes the type of vehicle, sometimes it's assumed. In Mexico City, we specify that it's the Metro. We capture these subtleties because that allows our customers to match what we're telling them to the real world around them.\n\nHere is a different example. In New York, the MTA doesn't list their lines in alphabetical order. Instead, they list them by color. A and C are blue, B and D are orange.\n\nYou see the same ordering reflected in our product.\n\nTrams and street cars are really the same type of vehicle, but different cities specifically refer to one or the other. For example, in Toronto, you could tell a customer to board the 510 Spadina Tram, but that's not really correct. Everyone calls it the 510 Spadina streetcar, so that's what we call it as well. In Berlin, on the other hand, you ride trams.\n\nAnd that is reflected in our experience. Here's another example. In San Francisco, you ride inbound and outbound. Whereas in London or Toronto, you go northbound, southbound, eastbound, and westbound. But in New York, you go uptown and downtown. Again, you see this reflected in our app.\n\nOne final example. In Rio, the bus rapid transit systems are very important. In many ways, they are the equals of the Metro and commuter rail systems. We raise the prominence of these bus rapid transit lines on our map to reflect their importance. That's the blue and orange lines that you see in this screen shot.\n\nHere is how we build up our feature. We start with agency data for schedules, but then we survey to add additional curated data. For example, station entrances and line geometry as we've previously seen. Then we customize the experience to respect the unique culture of each city. Finally, this is all wrapped in our user interface to bring delight to our customers.\n\nNow, I'd like to give you a short demo.\n\nLet's say you just flew into San Francisco International Airport, and you'd like directions to Moscone West for WWDC. First, you can see our multiagency transit map. As I mentioned, transit lines are highlighted while roads are dimmed. Now, we're going to look at the departures for Powell Street Station. Powell Street is serviced by both BART and Muni, and you can see the upcoming BART departures as well as the upcoming Muni departures.\n\nNow, at the top I noticed there was an advisory. When I tap on details, I see that Muni has some service changed in effect, and we are communicating those service changes to our customers.\n\nYou can zoom out to see the entire transit network of the Bay Area.\n\nOr you can zoom in to get more details.\n\nThe information density and the lines that we show changes at each zoom. Now, some people may want to have different choices. So, for example, they may want to see if a bus route is available. In our product, you can select the exact vehicles that you'd like to use for your journey. Here is a competing bus route. Now, we didn't recommend this because it takes longer. But it's an option that's available to you. So let's go back to our BART route and examine that in greater detail.\n\nThe route planner tells you when to leave, how long it will take, and gives a summary of the route. Tapping on this, I get what we call the list view. A detailed list of instructions to follow. I can expand the list of stops if I'd like.\n\nNow, when I select start, I enter guided navigation with detailed instructions. Since I'm already at the airport, it just tells me to board the train. Tells me to exit at Powell, and shows me the previous station. Here you can see we're recommending a very specific exit with an exit code, E3, that's best for Moscone West.\n\nFinally, I arrive at my destination.\n\nThat concludes the presentation. For more information, please visit this website or e mail maps-transit@apple.com. Thanks for listening.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/241fgk9sdmxcb6c6wz2/241/241_hd_public_transit_in_apple_maps.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/241fgk9sdmxcb6c6wz2/241/241_sd_public_transit_in_apple_maps.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T10:38:46.959Z"
}