{
  "id": "820",
  "year": "2017",
  "url": "https://developer.apple.com/videos/play/wwdc2017/820/",
  "title": "Express Yourself!",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Today I am going to talk about iMessage apps. The iMessage App Store is only a year old, and there are already so many great apps, and so many new experiences. There are also many more yet to be discovered. An essential part of the iMessage App experience is Stickers. Stickers have done so much to brighten our conversations. There are so many different types of Stickers, even animated ones. Look at all the Stickers here. And these are only the Apple ones. Let's take a look at what makes them so great. Going to jump into a conversation, and my friend sent me this image of a show that we went to. I'm going to react with a Sticker.\n\nGoing to pick this thumbs-up one here, tap and hold to peel, and put it where I want it, scale, rotate, and drop it there. I'm going to add another Sticker, just to be extra fun with it. Pick this one. And I think I'm going to send this one with a full screen effect.\n\nThis new echo one that Mac worked on is great.\n\nWhat makes the Sticker experience so effective is that it's flexible. With the expandable App drawer, I can use the half screen and full screen view to find exactly the Sticker that I want. It is fast. It is easy, and light.\n\nIn other words, it's convenient.\n\nPrior to Stickers, you could not respond to an older bubble in the conversation, and you definitely couldn't overlay images on top of bubbles. That is a game changer. I could pick my Sticker, and put it exactly where I want it, transforming the conversation for both of us to enjoy.\n\nUsing Stickers is playful, and personal.\n\nThere are so many different types of ways to send Stickers, expressing yourself in unique and colorful ways is fun.\n\nThat animation is so cool. We've seen how being convenient, personal and fun are part of what makes Stickers such a great experience. But what works for Stickers can also work for other apps.\n\nLike expressive apps, sharing apps, and collaborative apps.\n\nLet's focus on expressive apps.\n\nHere is one that I love. Tumblr. Tumblr's iOS app is a social media destination optimized for sharing photos and gifts, but that doesn't necessarily translate into person to person communication. So they made something different. They made a GIF generator. Going to jump into another app here, and pick a video that I made.\n\nCool. I can set the playback behavior, and speed it up a little bit.\n\nMy friend is having a bad day, so I'm going to send him a fun little message. Bounce back, Homey! I could pick the color.\n\nAnd change the font.\n\nScale and rotate. Get that frog in there, nice.\n\nAnd send it.\n\nCool.\n\nTumblr made a robust GIF editor allowing you to trim your video, control the play speed, and set playback behavior. It is so powerful, and lives right within messages. The whole process is lightweight and convenient.\n\nYou can also customize text, setting the font style, color, scale and rotation to personalize your GIF. All these decisions make your GIF special for both you and the person you're sending it to.\n\nAnd it's fun to see the GIF that you just created looping in your conversation. I know this is going to get a good reaction. We've seen how Tumblr has made a robust, expressive app that is so different from Stickers, yet it maintains the core qualities of a successful iMessage app. Let's see how it works for a sharing app. Here is an awesome app. Dunkin Donuts.\n\nTheir iOS app is filled with all kinds of stuff. You can see your rewards, find locations, see the menu, order drinks. But all these features don't necessarily translate into a conversational experience. But one part definitely does. Gift cards. Going to go in here. My friend just helped me move, so I'm going to send him a gift card. And he was kind of lazy, so I'm only going to send him five bucks. Going to pick the right gift card. How about \"You're one in a million\"? That is kind of silly, right? And use the Apple Pay sheet, and boom, just like that. I just sent a gift card.\n\nApple Pay allows you to perform financial transactions without leaving messages. It is super convenient.\n\nThese cards look really nice. Maybe it's your nephew's graduation or a friend's birthday, or you want to let someone know that you're thinking about them. Sending a gift card is a great way to do it. Everyone loves donuts.\n\nAnd giving is fun. Being kind is fun. The person receiving this is probably going to be really surprised.\n\nSo the Dunkin Donuts app is so different than Stickers and Tumblr, it still works well because it embodies the same three qualities.\n\nThere are also collaborative apps, like games and polling. Games and polling rely on both parties to participate, to make the most of the app experience. I'm going to share with you one of my favorite apps.\n\nTinder. Tinder is a popular dating app, but you're probably asking yourself how does a dating app find its way into messages? One of the core features of Tinder is Stacks. A data can upload a set of images, or create a stack, to attract potential connections. I am going to go here and create a stack. I'm having a little personal crisis today, so maybe my friend could help me. I really need to know what shoes I should wear today. Going to pick my images, name my stack, and vote on my own stack. I really love all of these, so hopefully I can get some help.\n\nThen I just sent a poll.\n\nImagine if you had to create a poll without using this app. You would have to send these images individually. And how would people vote for them? They would have to say leather boots, or yellow sneakers. But here, they could just cast their vote. Making polls with Tinder is so easy. I have the Tinder app just so I could use this feature . Taking a poll is personal. You're sharing a personal set of images, selfies, sneakers, food, or whatever, you're asking a trusted person for their opinion because you care.\n\nAnd it's fun. It's fun to pick people's brains. It's fun to agree and disagree. The poll evolves as people vote, and becomes an enjoyable event for everyone.\n\nSo whether you're making a sticker pack, a GIF generator, a gifting experience, or an image poll, making them convenient, personal and fun can make a huge difference in the success of your app.\n\nHere are some tips to get started.\n\nTumblr, Dunkin Donuts and Tinder do not set out to put their entire apps into messages, and thankfully they didn't. They integrated only features that were focused on communication.\n\nHandcrafted messages are fun to send and receive. Find ways to let your users create and customize the experience. You may find that there are ways to use your app that you never even imagined. You may discover new user bases, like my experience with Tinder.\n\nThere are so many platform tools, peel and place stickers, Apple Pay sheet, access to the microphone, camera and photos. Think about what is best for your app, and improve on an existing experience, or create a new one.\n\nBecause in the end, you want to create a wonderful experience for your family and friends.\n\nThank you. [ Applause ]",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/820i9qakfac65nsp/820/820_hd_express_yourself.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/820i9qakfac65nsp/820/820_sd_express_yourself.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:18:31.133Z"
}