{
  "id": "819",
  "year": "2017",
  "url": "https://developer.apple.com/videos/play/wwdc2017/819/",
  "title": "Designing for a Global Audience",
  "speakers": [],
  "duration": "",
  "topics": [
    "Accessibility & Inclusion",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "You have a global audience, the world is increasingly interconnected, people travel and when they do they use apps to orient themselves in new places and figure out what to do, where to eat and how to get around.\n\nAnd people move for all sorts of reasons, so in any given place you're likely to find people from different countries, cultures and language groups.\n\nAnd here at WWDC, we are part of a group representing 75 different countries.\n\nSo why design for this global audience? First and most importantly, for a better user experience. Language and symbols are grounded in cultural context so not all of us interpret things in the same way. It's important of course, to make sure that your words and artwork aren't offensive to your users, but don't stop there. Carefully considering your global audience can help make your app as useful and appealing to as many people as possible.\n\nAnd thinking this way sets you up to grow. The App Store is available around the world so people from any country that you've enabled in iTunes Connect can view and download your app. Whether your app is only in one language right now or you're already in multiple markets the principles we'll discuss are relevant to you no matter what.\n\nSo, let's get started. First, make a plan. Think about your strategic goals, which countries and languages are next on your roadmap, if you have one already, and don't forget to take a look at your app analytics in iTunes Connect that's some useful information, you might find something there that's surprising.\n\nNext, identify your user groups and think about how best to communicate with them. Can you get by with some minor changes to your app. Is it time to think seriously about a major localization effort. Use this information to prioritize your important localization work and think about ways to streamline. Make sure that you have translations for your key terms before you need them and if you're going to have a second set of artwork for example for a different market get it all done at the same time. So, let's discuss some key considerations related to language.\n\nWhen terms can be used more or less interchangeably in your app's primary language is there one choice that's very similar to other languages. For example, picture and photo are more or less the same in English, but look at the difference in these other languages. Photo is the clear winner for multilingual clarity. If you have the resources to fully translate your app go for it, but if not prioritize.\n\nHelp your users orient themselves with headings and titles.\n\nMake sure that the important information from your instructions is conveyed and that commonly used terms are clear.\n\nFinally, make sure that users can read error messages just in case something goes wrong.\n\nThink about informal language too.\n\nYou may choose to include slang, very informal words or phrases or figures of speech, words or phrases that are not intended to be taken literally. Let's look at a couple of examples. I am a native Californian and I might say oh sick, you crush it or sweet, that rocked.\n\nBut here I'm not talking about illnesses or desserts just saying that someone did something particularly well. I may also say it's raining cats and dogs.\n\nI love the last one. Or I'm hungry enough to eat a horse. This kind of language adds character to an app, so I'm certainly not saying never to use it. But if you do, do a quick check to make sure that it's not offensive and be sure to offer contextual clues so that even if a user isn't totally sure what you mean they can still figure it out. Let's talk now about symbology and do a quick exercise. Put your hand up and count one, two, three.\n\nOkay now hold that and take a look around. How many people have their thumb, index finger and third finger extended? How about index, third and ring or maybe something else entirely? This is a great example of the wide variation in gestures for something as simple as counting to three.\n\nIf you choose to include gestures in your app make sure that it means what you intend and plan ahead to localize when appropriate. Now let's talk about localized and globalized iconography with an example from our Maps app. We're about to look at the set of icons that we use to represent an important feature in different countries. So, who knows what this represents? Okay a couple hands. How about this? Getting warmer all right, many more hands.\n\nAnd about this? All right, just about everybody.\n\nSo, this is the logo of Japan Post which we use to represent post offices, but only in Japan.\n\nThis is the postal horn which we use in Sweden, Turkey, Luxembourg and 28 other countries. And finally, in every other country we use this simple recognizable letter outline to symbolize the post office. I like this example because I think it represents a nice spectrum of local to global iconography. And there's really no right answer here, but it's an important question for you to consider, exactly how specific do you want to be with your symbols. When depicting people keep in mind that more detailed icons may exclude some of your users, but that simpler glyphs like this silhouette are much more general and maybe a better choice. And as a bonus, we include this glyph in UIKit so that artwork is already available to you. Let's talk about our final consideration now, associations.\n\nWhat does this owl make you think of? If you grew up in an English-speaking context you may associate owls with wisdom, but in much of the Arabic speaking world owls can be associated with bad luck or even death. So, make sure that your associations are what you expect. I hope I have helped you to think further or start thinking about designing for your global audience. Now let's look at some resources.\n\nFirst, if you can travel to the places where your customers live I hope you will, but not everyone can travel. Never fear there are other resources much closer to home.\n\nCould you conduct focus groups either formal focus groups with participants selected based on their primary language, cultural background or other characteristics or possibly more informal focus groups where you offer snacks to friends or family in exchange for their feedback on your designs? You may be able to draw on personal or professional contacts for this kind of feedback as well.\n\nAnd now moving to the web, language learning, translation and travel funds offer a wealth of knowledge about language and symbol use and expectations around the world. And web and image searches can give you a lot of this information too.\n\nBooks and articles can be helpful as well, look for keywords like global design, user experience, intercultural or cross-cultural communication, visual design and tips for travelers, businesspeople and interpreters.\n\nFinally, don't forget about libraries where you can find some of these publications, as well as map and document collections with rich information.\n\nSo, to wrap it all up, this is not an all or nothing design problem, smart changes can go a long way toward making your app more useful for more people.\n\nUse the resources that are available to you to create a great user experience and lay the groundwork for expansion.\n\nYou can do this. Thank you.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/819bp5li4iugvy222/819/819_hd_designing_for_a_global_audience.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/819bp5li4iugvy222/819/819_sd_designing_for_a_global_audience.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:09:53.094Z"
}