{
  "id": "816",
  "year": "2017",
  "url": "https://developer.apple.com/videos/play/wwdc2017/816/",
  "title": "Love at First Launch",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Imagine you're searching for an apartment. You've been on the hunt and this one looks pretty good. The price is right. The photos show tons of natural light. It's close to work. So you schedule some time to stop by and check the place out.\n\nYou bike over. Someone buzzes you in. You find the apartment door. You give it a knock and the landlord greets you. And before he'll even let you pass the front door, he has some requirements. He wants to see a passport, a birth certificate, and your last four paystubs. Now this would be a little ridiculous, right? You just want to check the place out. You're not ready to commit to anything yet plus who knows if you're private info's safe with this guy? First impressions matter.\n\nThey matter because they could also be your last. People have access to millions of apps in the App Store. You've already passed the first hurdle when someone installs your app. Great. So prevent them from backing out and deleting your app in the same way you'd probably be off to the next apartment on your list. And then instead, start things off with a great first impression.\n\nNow suppose you're planning a trip and a friend suggested this travel app here.\n\nLooks pretty good. So the installation completes. You tap open for the first time and you're met with this.\n\nNow does this look familiar? Someone wants you to register here but there's not much info about what this app actually does. And sure you have some idea after your friend's recommendation but when you open the app for the first time and this is how you're greeted, it still feels a little something like this guy.\n\nThere's a chance you might back out, delete it, and go find something else.\n\nNow consider this military base with its fortified exterior. The message to anyone on the outside is clear. Stay out. Right? Compare that to Apple Union Square in San Francisco. The entire front of the store opens up to the sidewalk invited passersby to wonder in. And wondering is exactly what they do because people use -- as people explore the store, they're able to pick up and use iPhones. They might not take a new Mac for a test drive or try on an Apple Watch. All without obstacles or friction. Your first launch experience should feel just as frictionless. If people are greeted with an open, interactive experience, the very first time they tap your icon, you're going to make a great first impression and keep them coming back. So let's talk about some ways to make that happen.\n\nWe'll be discussing some tips for leading with content first.\n\nHow to teach new users about your app through interaction.\n\nAnd when you need to ask for some more information upfront, some tips on timing that will add to a great user experience. So let's start with some strategies with a content first approach.\n\nLet's compare our travel app to another travel app. Now this is Jetsetter. And the very first time you open Jetsetter you're immediately greeted with this great content. Big beautiful images. Useful information. You can browse this feed, of course, or you can jump right into search if you have something specific in mind.\n\nIf a destination catches your attention, you can drill in for more photos and more details.\n\nAnd it's been seconds since you first launched this app and you're already using it like a pro. You're intrigued by all this great content and you've already started daydreaming about laying on this beach.\n\nIt's only when you're ready to book the trip that you're prompted to register.\n\nBy now, you've got a good idea of what the app has to offer. You've seen the potential benefits of registering. So this feels like a more appropriate time to share more details.\n\nIf you're not convinced yet, just compare Jetsetter with our other travel app.\n\nNow we've all been through some version of that top row. Which one of these feels more welcoming to you? Always lead with great content. Show off what makes your app great right off the bat and let people dig in.\n\nNow there are some situations where a little bit of upfront instruction might be helpful. And I say might because before you start incorporating some of the tips we're about to look at, I want you to very carefully consider whether any upfront instruction is needed at all. Let's take a quick look at the phone app.\n\nNow just imagine if we designed this with a series of first run tool tips.\n\nIt'll be a little ridiculous, right? This interface is obvious. We know how it works.\n\nYou should strive to design your interfaces to be as intuitive and as easy to understand as possible. Ideally no upfront instruction is needed at all. All right.\n\nLet's take a look at Lara Croft GO.\n\nThis is your starting point here. No onboarding. No instructions. Nothing to pull your attention from this immersive experience. You're right in the game but you still need to learn how to play this game. So these first two levels are designed to introduce you to the basics.\n\nWell, you only have a straight line here and Lara looks like she's ready to go. Since there are no visible controls, you try swiping on the screen. And sure enough, she starts moving in the direction you've gestured.\n\nYou quickly discover you can move up and down walls too. And congratulations, you've learned the game's navigation controls.\n\nAll right. Now you've got this glowing tile up ahead catching your attention. Options look pretty limited so let's go check it out. Yes, you've just completed a level. Now that one was pretty simple, of course, but it's teaching you the basics and you're already playing the game.\n\nAll right. Level 2 starts here. It looks like your path is cut short. So let's try that switch.\n\nAh ha, the missing path fills in and you've figured out another important part about how this game works. You know, of course, things get a lot more complex from here. But you can start to see how instruction can be layered into an experience. And again, no onboarding. No tool tips or floating hands here. There are no barriers when you first play Lara Croft GO. This approach works in all kinds of apps not just games. This is Streaks. It's a simple app designed to help you pick up new habits. In my case as you might be able to guess I'm studying French and I'm trying to make a habit of practicing every day. Maybe Streaks can help.\n\nThe completion of a task is represented by the filling in of a ring.\n\nSo the first launch experience conveys this in a clever way by inviting you to fill in rings as you proceed through this introduction.\n\nAnd you're led right into creating your first habit. So if your app requires a bit of upfront education, it's going to be a lot more compelling if it's interactive and gives people that sense of jumping right in.\n\nTeach through interactive experiences. Now another place you don't want people to get stuck is with permission requests. And you know what it's like to open an app for the first time and get hit with permission request after permission request. Sort of like that demanding landlord we met earlier. So let's look at some tips for getting this right.\n\nThis is Strava.\n\nStrava lets you use your iPhone to track outdoor runs and bike rides. And it eventually asks for access to your location, your camera, your context, even HealthKit data but it doesn't ask for all of these right away. Instead, Strava makes requests on an as needed basis.\n\nFor example, it's not until you're ready to take Strava out for a ride for the first time that you're prompted to share your location. So you hit record down on the bottom. We'll get you on a ride here.\n\nWho's ready to roll? All right. So you get on ride and eventually a little while later, you're ready to wrap things up. We'll make it a short ride.\n\nSo you stop the ride and you tap save.\n\nNow when you're saving a ride, you have the option to add more details including a photo.\n\nAnd it's only when you tap add a photo that you're prompted for access to your photo library. And this is another great example of a permission request that's right in context. So you immediately see the benefit and no additional explanation is necessary.\n\nAnd it's the same situation when looking for friends on Strava in your contacts.\n\nThe app requests permissions on a need to know basis. So you retain a sense of control over both the experience and your private data.\n\nNow there are a few apps out there that can't offer any value without some sort of permissions. This is Transit. It lists departures of nearby buses and trains ordered based on proximity to your current location. I live in San Francisco and I use this one all the time to get around.\n\nOf course it wouldn't be able to provide this data without your location. So the first time you launch the app, you are prompted to share your location. And as soon as you tap allow, the map zooms in and you're presented with a list of nearby routes and departure times. So you immediately see the value Transit will provide in exchange for this information.\n\nSo remember, ensure people understand the value of sharing their private data with you ideally before you ask for it.\n\nOnce that permission has been granted, reinforce the decision by showing off the benefits you'll provide with that data. Only ask for what's needed when it's needed.\n\nFollow these tips and I promise you'll make a great first impression. Thank you.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/816mg1phgy05k3v222/816/816_hd_love_at_first_launch.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/816mg1phgy05k3v222/816/816_sd_love_at_first_launch.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:38:47.507Z"
}