{
  "id": "802",
  "year": "2017",
  "url": "https://developer.apple.com/videos/play/wwdc2017/802/",
  "title": "Essential Design Principles",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello everybody.  My name is Mike Stern. I manage the Design Evangelism Team at Apple, and it is my honor to be with you today to talk about design.\n\nNow, at Apple, we often use the term human interface to describe what might otherwise be called user interface. Human interface is an uncommon, not widely used term, but it has a really long history at Apple. Our design documentation, this is the newly redesigned macOS HIG, it is called the Human Interface Guidelines.\n\nThis document goes all the way back to 1978, a full 15 years before I was even born. I'm just kidding. I'm old .\n\nThe word user can have a clinical or anonymizing effect.\n\nIt narrowly defines people in relation to the interface.\n\nHuman evokes a much more nuance picture of who it is that we are designing for. If I say I'm only human, it is to acknowledge that I have imperfections, and I have shortcomings. I might fall short of your expectations of me. Hopefully not right now.\n\nBut the word human is also how we express our highest and most noble qualities. When you acknowledge someone's humanity, you're recognizing their kindness, their compassion, their generosity and goodness. Designing an interface is fundamentally about serving other human beings.\n\nThe goal isn't to make a beautiful app, or a well-organized app, or a simple app or a focused app.\n\nThose things are all really important, but they're not the real goal.\n\nThe real goal is about serving the human beings or positively affecting the lives of the people who use the apps that you make.\n\nThe only thing that really matters is how well your app satisfies the emotional and practical needs of the people you are designing for.\n\nWe have the need for safety and predictability.\n\nWe have a need for knowledge, for meaning, and understanding.\n\nWe have a need to accomplish tasks, to achieve our personal and professional goals.\n\nAnd we have the need to experience beauty and joy.\n\nWell-designed apps should provide these things.\n\nWell-designed apps make it easy for people to predict the consequences that their actions will have.\n\nThey feel stable, solid, trustworthy.\n\nThey help people to make informed choices by providing information that is clear and helpful.\n\nThey have streamlined and simplified workflows, so that people can effectively and efficiently accomplish their tasks. And they should have an aesthetically pleasing, enjoyable, and even delightful experience.\n\nUsing apps that provides these qualities is so gratifying, so satisfying, you can tell that the people who made the app fully considered your needs.\n\nYou sense all the time and all the effort that went into figuring out how to help you get things done quickly and successfully.\n\nEverything is there for a purpose. Everything is understandable.\n\nIt just feels so human. When an app makes us feel this way, we sense the humanity of the people who designed it.\n\nSo how does the design of your app accomplish this? Now, when we talk about design, we often focus on technique and process. And while these are important considerations, they don't lead to great designs. At least not on their own.\n\nGreat designs are guided by a deeper understanding about what design is, at a more fundamental, more human level.\n\nThis is what design principles offer us. They express core truths about how we perceive the world around us. How we process information, how we make decisions, and how we communicate.\n\nThese truths are universal and timeless.\n\nThey apply to all kinds of graphic design. Graphic design architecture, interior design, retail design, landscape design, landscape design, automotive design, I think I said landscape twice, and every other type of design.\n\nDesign principles don't tell us how to do specific things in our design, they tell us why we should do those things.\n\nThey serve as the foundation upon which great designs are built.\n\nThis session is about sharing those principles with you.\n\nNow, some of the things I'll share today might seem kind of basic or obvious.\n\nBut the most profound things are often the simplest.\n\nI've been designing for over 20 years. I've been fortunate enough to have worked with many brilliant designers, both at Apple and in the developer community. I've had in-depth discussions about a wide range of interaction design challenges across a full spectrum of apps and games with people from across the globe.\n\nAnd in all of those experiences, I'm constantly reminded, I constantly return to just how clarifying it is to evaluate a design against the core principles that we are about to explore.\n\nOkay. So, because design principles are universal, I thought it would be fun for us to explore how these design principles shape our experiences in the real world.\n\nNow, there really is no better way to explore the real world than to travel. So, with that in mind, I thought we would all go on a little trip together.\n\nNow, it took quite a bit of persuading, but we managed to allocate a portion of the evangelism team's travel budget to buy each one of you here today a ticket to Hawaii.\n\nWhat? Right? That's pretty awesome.\n\nSandy beaches, rainforests, tropical drinks. Sounds pretty great, right? Okay who is down? Who wants to go on this trip? Yeah? All right. Let's go. Now, our journey to lovely Hawaii is going to begin somewhere slightly less lovely, at the airport.\n\nAs we approach the airport, we are going to see all sorts of signs.\n\nAt first, we see signs about how to get to our terminal.\n\nThen we see signs that provide more specific information about what's at each terminal, and after we find our terminal and park, we head into the terminal, and then we get directions to our gate. And once we get to our gate, we are going to know we're in the right place, because there is a big old sign telling us so.\n\nAnd if we are in the wrong place, or if our flight was moved, we get directions to nearby gates.\n\nAnd in case there is an emergency or we just want to leave, nearby exits are clearly marked.\n\nThe system of signs that we followed is what is called a wayfinding system.\n\nWayfinding systems help people to navigate complex environments quickly and successfully. They are critical for helping people feel oriented and safe.\n\nPeople at airports are tired, they're jet-lagged, they're in a rush, they're stressed out. So airports need to think really deeply about wayfinding. Good wayfinding systems offer a comprehensive and understandable list of general locations that people can visit.\n\nThey provide needed detail about what's in those locations.\n\nThey are highly contextual. They become increasingly specific as we navigate deeper and deeper into the system.\n\nThey help people to orient themselves by clearly highlighting their current location relative to other locations. And they provide a clear exit path.\n\nIt's so comforting to know that you can return to a place that is more familiar and start over.\n\nWayfinding helps us to feel safe by answering really basic questions like: where am I? Where can I go? What will I find when I get there? What's nearby? And how do I get out? Without answers to questions like these, we'd be lost.\n\nNow, your app's interface is really just one big old wayfinding system. The navigation bar, the content area, the tab bar, they're all just tools for providing wayfinding in your app. The navigation bar title and selected tab bar item lets people know where they are.\n\nTab bar in content areas lets people know where they can go and what's nearby.\n\nSimply rendered and recognizable tab bar glyphs and understandable labels suggest to people what they will find when they get there.\n\nAnd back buttons offer an exit route, and can help people to identify what area of the app that they're in.\n\nNow every screen in your app should answer all of these questions, or else people will feel lost. So go through your app. Go one screen at a time, and ask yourself, how well is each screen answering these questions? Does every screen help people to know where they are? Does every screen help provide options to people to tell them where else they can go? If some screens aren't answering those questions clearly, then there is some work to be done. All right. So we have a flight to catch. Paradise awaits.\n\nWow. That was a quick flight. If only they were all so quick.\n\nSo we have arrived in paradise, and it's time to pick up our car and head to the hotel.\n\nWhat a sweet car it is. It has got a sweet candy red paint job. Check out those rims. Looks like it will do zero to 60 in like 10 or maybe 11 seconds. It is a pretty small car. If I were you, I would yell out shotgun right now.\n\nShotgun! All right, all joking aside, cars are actually quite dangerous. The fact that we let people drive around two-ton metal objects at high velocities is kind of ludicrous. Especially when those people could be tired and navigating unfamiliar roads.\n\nNow, because of the inherent danger of driving a vehicle, car manufacturers have to think carefully about the design of interiors. Safety is a primary consideration. And so they're a great way for us to learn about the design principle of feedback.\n\nFeedback helps us to operate cars confidently and safely. Feedback helps us to anticipate problems that might cause the car to stop functioning properly or to stop moving all together.\n\nOur vacation definitely won't be very fun if that happens.\n\nNow, cars provide various forms of feedback. There is status feedback to let us know how the car is doing. There is completion feedback to let us know whether actions we've performed are completed successfully or failed. Warning feedback, to tell us about potential problems. And there is feedback to let us know when something we've tried to do has caused an error. Now, for our safety, for the safety of other drivers and pedestrians, the feedback that cars provide must be clear, immediate, and understandable.\n\nSo let's check out how cars communicate with us, starting with how they tell us about their status.\n\nNow, we have all loaded into the car, and we are ready to go. So looking at the gear shifter, I can see that the car is in park. Knowing what gear the car is in is super important information. It is so important that it's displayed twice, on the gearshift, and in the instrument cluster.\n\nIt would be really bad if I thought the car was in park when it was actually in drive, or if I thought the car was in drive, when it was actually in reverse.\n\nOther status feedback lets me see the fuel level, so I can anticipate and predict how far we can go before we need to refuel.\n\nAnd seeing our current speed helps me to avoid getting costly speeding tickets.\n\nThese are two really critical pieces of information. I don't want to run out of gas before we get to the hotel, and the lovely folks in finance have told me repeatedly that I cannot expend speeding tickets.\n\nNow, status information in apps should be just as clear. So, for example, in the mail app, unread status indicators help people to prioritize which emails to read first.\n\nIn Calendar, status indicators help people to see when someone can't make a meeting and it helps them determine if they need to reschedule.\n\nIn the Camera app, there are three elements to let people know that a video is being recorded. The red dot, the incrementing time code, the state of the record button. They all let people know that a precious but fleeing moment is being recorded.\n\nShowing status clearly and directly is crucial for saving people time and helping them to avoid making mistakes.\n\nNext up is completion feedback. We are ready to go, so I start the car .\n\nWe can hear the engine turn over. We can feel the vibration of the motor running. We see that instrument cluster come to life.\n\nThere is no doubt that we are ready to go.\n\nAnd as I shift, from Park into Drive, I get tactile feedback to let me know that I'm moving through those gears.\n\nAnd as we pull out of the parking spot, we hear the doors lock.\n\nThis happens automatically, so it is even more important that we get this feedback.\n\nAll of this feedback is reassuring. It's our car's way of saying it is all good, I'm doing exactly what it is that you wanted me to do, and this frees me up to focus on other cognitive tasks, like making sure it's safe to pull out of the parking spot.\n\nCompletion feedback in apps serves the very same purpose.\n\nThe sound of a locked iPhone . The animation of an email being marked as unread, or the animation of an email being deleted.\n\nThese cues are discreet, and they're non-invasive, but they're hard to ignore, and they provide that necessary reassurance that our devices are performing as expected.\n\nOf course, confirmation feedback can be even more obvious. The animation and sound of a successful Apple Pay transaction . It's very hard to miss. Every action taken in your app should provide some form of confirmation feedback, because it is absolutely necessary for letting people know that actions they've performed were successful.\n\nWarnings help people to understand in advance about potential errors. Low fuel level. Low break pads. Low oil level.\n\nWarnings can be communicated using status indicators, messages, and the instrument cluster, built-in display, sounds, or all of the above.\n\nThese warnings are important. They keep us safe, and they protect our car from damage.\n\nAnd lastly, error feedback in cars, as with apps, is crucial.\n\nIf you try to start a car without gas, you will get an error message about that.\n\nNow errors are always disappointing and frustrating. It's best to help people avoid making errors in the first place. Warnings and confirmation feedback can help.\n\nFor instance, in-line form validation is a fantastic technique for letting people know what values will be accepted, and what values will not.\n\nGetting this feedback in real time helps people to course correct so that they don't run into errors later. You can also try to infer what a person was wishing to do, or what they intended to do when they made a mistake, and then do something reasonable.\n\nSo, for example, in the new version of Things 3, if you type in the date June 31st, which by the way is a date that does not exist, but it's a common mistake for people to make, the app doesn't throw up an error or show a warning. No. Instead, it automatically corrects the date to July 1st.\n\nIt's such a subtle thing. It's kind of brilliant, and it's a very human thing to do.\n\nNow, as you can see, clear, timely, and understandable and informative feedback is essential. Feedback answers super important questions. What can I do? What just happened? What is currently happening? And what will happen in the future? Many apps do not do a very good job of providing feedback.\n\nThe reason for this, I think, is that when you're designing, it is so easy to start to think about static screens, and you can lose sight of the fact that interactive experiences happen over time, with lots of back and forth.\n\nGood feedback is like having a conversation with the person who designed it.\n\nAs a designer, feedback is your way of letting -- answering people's unspoken questions.\n\nIt is your way of letting people know how they're doing, and providing helpful guidance to them. So when designing your app, imagine that you're having a conversation with the person who is using it.\n\nWhat would you say if you were in the room with them? How would you say it? I have a very simple, but highly effective technique to share with you. Ask someone who has never used your app before to use it. Have them tell you what they are thinking, what they think is unclear, what they find to be confusing.\n\nThen simply explain to them how your app actually works. Guide them along, explain to them what's happening, and what they should be paying attention to.\n\nThen step back.\n\nConsider how what you've said might differ from what the app is communicating. In my experience, when someone needs to explain their design to me, it is usually so much more clear than the design itself. What people tell me fills in the gaps that are left by their design.\n\nWe tend to be much better communicators when we're sitting with someone in person to try to capture that experience.\n\nOkay, so that is feedback. Now, the next design principle is closely related to feedback, and that is the principle of visibility.\n\nGood feedback does not matter very much if people can't see it.\n\nVisibility captures something very obvious. The usability of a design is greatly improved when controls and information are clearly visible.\n\nSee? It's kind of obvious.\n\nConsider how important visibility is in your car.\n\nThe instrument cluster presents status information and warning indicators directly in front of you. Instrument clusters are visually cluttered. There's all sorts of text, and numbers and moving gauges and blinking lights and status indicators.\n\nThey're not called clusters without reason.\n\nBut all of this is necessary for operating a vehicle, and needs to be plainly visible, without you having to move your head or your body.\n\nHiding some of this information or putting it elsewhere in the car would hurt usability. Critical feedback would just get ignored, and the same is true for apps.\n\nIn the Mail app, badges provide helpful status information about email messages. Removing that information might reduce clutter. It could look a little bit cleaner, but it would greatly reduce usability. People would have to navigate into each email message to get that information. It would be very inefficient, and it would be very tedious. So it is important to surface key status information at higher levels whenever possible.\n\nOr, consider the navigation in the Clock app.\n\nWhat if that was hidden into a hamburger menu.\n\nPeople would have a much harder time seeing what other functions the Clock app offers to them beyond what is currently visible.\n\nObviously there is a tradeoff here. Densely packed interfaces can be overwhelming and they can slow decision-making, especially for people who are new to your app.\n\nSo visibility has to be weighed against other considerations.\n\nNow, with so many of us in the car, I'm starting to feel a little bit cramped, and I cannot wait to get to the hotel, but there is one more insanely important design principle to point out while we're here, and that is about consistency. The principle of consistency is about representing similar design features in similar ways. If you've driven a car before, there are symbols and terms that you are no doubt familiar with. You will recognize the symbols for door lock, for window, for gas, headlights, battery, oil, and so forth. You will be familiar with the definitions of words like Park, Drive, and Reverse, as they apply to the operation of a vehicle.\n\nConsistency also applies to the location and the configuration of controls. We all expect the brake to be on the left, and the accelerator to be on the right.\n\nConsistency greatly improves the usability of a vehicle, or maybe it is more clear to just flip this around and say that inconsistency undermines usability. Whoops. All cars share a common design vocabulary for these symbols and terms. All cars position controls in a relatively consistent way, and because of this consistency, we don't have to re-learn how to drive a car every time we get behind the wheel of a new one. Now, maybe this is obvious, but consistency is actually hard to achieve. You have to make a conscious effort to be consistent, and you have to be consistent with the right things. You have to fully consider what expectations people have when they come to your app. Those expectations are mostly informed by their experiences with the other apps that they use.\n\nThe other apps that they use, how do you figure that out? Of course, it is impossible for you to know. But you can make some informed guesses. Perhaps they've used other apps that are similar to the things that your app does. Maybe not.\n\nBut it's very likely that they have used other apps on the platform. So you should pay attention to platform conventions. Things like iconography and terminology, navigation schemes, and even common work flows for typical tasks.\n\nNow, let me give you just one example to make this, I think, a lot more concrete.\n\nOn iOS, the glyph that we use to represent the concept of an action is an arrow that points up and away from a box.\n\nBecause the most common action associated with this glyph is share, we affectionately call this a \"sharrow.\" I love that name. Now, some apps use a different icon to represent a similar concept. This icon is commonplace. It is used on websites and other platforms. Now, this is a great glyph. Do not get me wrong. There is nothing wrong with this glyph at all. But it's not the symbol that iOS users are most familiar with.\n\nThis glyph shows up in iOS apps because of the desire to be consistent, to consistently represent this concept in a consistent way across platforms or with your website.\n\nThis is a perfectly rational and reasonable thing to do, but it is not the right call. From the perspective of the person who you are designing for, it is best to be consistent with the symbol that they are most familiar with.\n\nBeing consistent will go a long way towards making your app more approachable and usable. Now, look, there is always the impulse to, you know, do things a little bit different. And to be clear, this is a really good thing. You should absolutely be trying out new ideas. That's how innovation happens.\n\nBut inconsistencies about simple things, like icons and labels, can really trip people up. So it's always best to be consistent unless you have a very strong justification to do otherwise.\n\nNow, I'm sure you're all consistently ready to get out of this car and get to the hotel, but there is one last point about consistency that I'd like to make, and it is about internal consistency.\n\nInternal consistency is about designing controls to share a similar look and feel, that match each other. Your app's glyphs should have a consistent visual style. Text in your app should have a limited number of font faces and sizes and colors and so forth.\n\nInternal consistency helps to make an app feel cohesive or whole.\n\nWhen everything matches, when everything fits, people are given a deeper sense of a product's integrity. We intuitively believe that design choices were deliberate and thoroughly considered.\n\nAnd with very good reason. Being consistent takes self-control and restraint.\n\nAll right, now because our car was so darn consistent, we finally managed to arrive safely at the hotel.\n\nThat car ride was really stuffy. So you decide to head up to your room and freshen up a little bit. Perhaps you go throw on that fresh new Aloha shirt you picked up at the airport.\n\nSo, when you get to your room, you head to the bathroom, and you turn the handles on the faucet and let the water run a little bit. And after a couple of seconds you put your finger under the water to check the temperature. It's still a little bit cool, so you increase the hot water a little bit. You wait another couple of seconds, and the water warms up, and you commence face washing.\n\nYou feel refreshed and reinvigorated.\n\nCompared to driving a car, a faucet is really basic.\n\nBut at some point, you had to learn how to use a faucet. You learned by adjusting the controls of various faucets and observing the results.\n\nFor example, how do you know which handle controlled the hot water? You knew because for the most part hot water is controlled by the handle on the left.\n\nAnd why would you keep testing water temperature for a few seconds? You did this, because you expect there to be a delay between when you adjust the temperature and when the water actually gets warmer. Looking at the water, it is really hard to tell if the water is cold or hot, and we have all experienced burning our hand under a faucet.\n\nNow, you don't think about these things every time you use a faucet. You just intuitively expect them.\n\nWithin each of your brains, there is this tiny, little adorable model of a faucet, and that model represents the faucet as a system of parts and functions and behaviors.\n\nThere is a spout for producing water, there's handles for controlling temperature and flow.\n\nThose parts are arranged in specific configuration, and your model has certain behaviors, like the latency between when you adjust the hot water, and when the temperature of the water actually increases.\n\nThis model is referred to as your mental model.\n\nYou have a mental model of every system that you've ever interacted with. Those mental models are over-simplifications. They don't fully capture the inner workings of these systems. Though, the more experience you have with a system, the more sophisticated your model becomes. Mental models are developed through personal experience, and they're based on an incomplete set of facts, so everyone's mental model is unique.\n\nNow, real quick, there is actually two parts of a mental model that are worth understanding separately. A system model is the model about how a system works.\n\nOur system model might involve thinking about two independent sources of water, one hot, and one cold.\n\nAnd the system allows those inputs to be mixed, to create a range of temperatures.\n\nThe system is not immediately responsive. Changes to temperature could take a little bit of time, especially when we first turn on the faucet, right? Our system model includes this understanding of variable latency and temperature.\n\nOkay. The other term is interaction model. Now, does anyone care to guess what that model is? Just go ahead and shout it out.\n\nNo, I'm just kidding. Okay, you guys didn't fall for that. You're a smart crowd. If you guessed that it's a model about how we interact with the system, then you are correct.\n\nOur interaction model is that we adjust the temperature and water flow with the handles that are provided.\n\nOkay, so now that we know a couple of fancy terms, you might be wondering how all of this is relevant to you? Well, when a system such as a faucet matches our mental model, then our expectations of that system are met. When this happens, and we're not really conscious of our own expectations, we perceive the system to be intuitive.\n\nConversely, when a system doesn't match our mental model, it breaks our expectations, and we perceive it to be unintuitive.\n\nNow, let's just sit with this concept for a second. Because it's a really, really important one in design. And to do that, I would like to share with you a little story about a faucet designer named Mortimer.\n\nNow, like all of you, Mortimer has a mental model of faucets. Though obviously Morty's mental model is way more sophisticated, and way more bad ass than yours. I'm just being real with you, he is a faucet designer for a living.\n\nNow, consider that job that he has. His job is all about making amazing, best in class, delightful faucet experiences.\n\nAnd one day, like a bolt of lightning, he's struck with this amazing idea. We have been doing this faucet thing all wrong. He has a new concept about how to make things better.\n\nInstead of using one handle for hot water flow, and another handle for cold water flow, we should just have one lever to control temperature, and the other should control flow. This way people won't accidentally increase or decrease temperature when they are adjusting flow and vice versa.\n\nIt is brilliant.\n\nThis is why they pay Mortimer the big bucks.\n\nNow, at this point, Morty has this new and super awesome mental model about faucets in his mind. Unfortunately, there is just one tiny little problem. Morty's mental model doesn't match the mental model that people have about faucets. When people use the Morty faucet, it doesn't match their expectations at all and they say it is unintuitive.\n\nWhat is worse, the Morty faucet looks nearly identical to a regular faucet, but it behaved totally different.\n\nWhen people turned on the hot water, no water came out.\n\nThis mismatch between expected behavior and experienced reality created a major usability problem.\n\nPerhaps alterations to the faucet's form could suggest that it had a different interaction model.\n\nMaybe adding labels would help, but these are just remedies to a deeper issue. Labels and subtle variations of form are design cues that can easily be overlooked, especially when people have deeply ingrained notions about how a system works, and how they interact with it.\n\nThis is a big issue in app design.\n\nTrust me, I have been there more than once.\n\nTrying to get people to change their mental model of how your app works is risky.\n\nThis becomes even more true the more familiar people are with your app.\n\nChanges to any long-lived existing product will inevitably be hard for people to adjust to. It really doesn't matter how good or how necessary those changes may be. When considering big changes to an existing app, you have to be 100 percent positive that those changes will lead to clear wins for the people who currently use your app. Making changes just for the sake of it is not a good justification. Go carefully. Test your design. Prove to yourself beyond a shadow of a doubt that your innovations are objectively better.\n\nIf you can do that, then it's good to push through. People will come around eventually.\n\nOkay. So it's time to start getting ready for dinner. So you decide to throw on that dope new Aloha shirt, and you exit the bathroom and you turn off the lights by flipping a switch. The sun is setting outside. It is a bit dark, so you turn on a light in the hallway.\n\nThen you walk over to the bedroom and you flip on another couple of light switches to turn the lights on out there.\n\nThis, in a nutshell, is the design principle of proximity.\n\nProximity is about the distance between a control and the object that it affects.\n\nThe closer a control is to that object, the more we assume there to be a connection between the two.\n\nOf course the bathroom light switch is in the bathroom. Of course the hallway light switch is in the hallway. Of course the bedroom light switch is in the bedroom. Greater proximity also makes ergonomic sense. In general, the closer you are to an object or region of interest, the more likely you are to want to interact with it and control it. People think to turn on the bathroom light when they walk into the bathroom. So, by putting the light switch right by the door, it is within arm's reach when they need it most.\n\nProximity is also useful for expressing relationships between controls. So, for example, if you see a set of switches on the wall, and you know that one of them controls lights, then it's reasonable for you to assume that every switch is a light switch.\n\nIf one of them controls the shade, then it would be better to separate it out from the rest.\n\nThis configuration makes it easier for people to remember which switch controls the shade, and which ones control the lights.\n\nOkay, now it's probably worth pointing out right now that we have a very special name for this configuration, this arrangement here on the right. Does anyone care to guess what it is? Just go ahead and shout it out.\n\nOkay, you're smart, you're not going to fall for it. I just tried to get you. Okay, if you guessed in your mind that it is a group, then you win a prize. It is a trip to Hawaii.\n\nGrouping is a very fundamental and significant design principle. Grouping helps people to understand the relationships between elements, and it is key for giving a design structure. Now, while we all understand this, many apps don't effectively use grouping. It can be easy to overlook.\n\nNow, let's take a look at a couple of examples of how proximity and grouping can be used to structure a design, and establish relationships between controls and the objects or views that they affect.\n\nAnd keynote, proximity helps us to associate the view menu with the slide navigator and the canvas area. The objects that it affects.\n\nThe object creation tools are positioned right above the canvas, which is where those objects go. The anime format and document visibility switches are located just above where those panels get displayed.\n\nIn Sketch, you can see how grouping is used to cluster related controls with each other, like the grouping controls. The Transform and Edit tools. The Pathfinding operations. And the Layer Ordering actions.\n\nNow, I just shared two Mac apps, and the need for proximity and grouping is definitely higher the larger your interface is, but the principles are still crucial for smaller screens, like iPads and iPhones, and even the Apple Watch.\n\nOkay, so I think there is time to learn about just one more design principle before we head downstairs to the hotel restaurant and grab some dinner.\n\nLet's go back to that Shade control again.\n\nNow, looking at this control, do you suppose that the Shade is open or closed? How about now? Just show of hands here. How many people think that it is closed? Okay, okay, and how many of you think that it is open? Yeah, you guys are a really smart group of people. All right. Mapping is how you know that it is closed. Mapping is about designing controls to resemble the objects that they affect.\n\nShades go up, and shades go down. So it makes sense to use a control that mirrors that up and down movement.\n\nThere is no ambiguity about how to raise or lower the shade.\n\nMapping also relates to how controls are arranged relative to each other. Their order should resemble the configuration of the objects that they affect.\n\nSo let's say that these light switches control three sets of ceiling lights in the bedroom.\n\nGood mapping involves arranging the switches to mirror the layout of those lights.\n\nBy focusing on mapping, it is so much easier to make choices about where to position controls, how to order them, and even which controls to use. I mean, we've all seen light switches that look like this.\n\nYou will often find labels when mapping is unclear. It is a telltale sign. But it is not a particularly good solution. Reading takes time, and it doesn't help people to memorize the location of controls or how they should interact with them.\n\nNow, in the context of interface, adjusting a horizontal property is much more intuitive with the horizontal slider.\n\nSimilarly, using a dial for adjusting rotation is much better than a slider or a stepper.\n\nOf course, the best mapping is the most direct mapping. Providing the ability for people to directly manipulate an object is more straightforward, it's more intuitive, and precise. Whether that is with a pointer on macOS, or Gestures on iOS.\n\nOkay, so enough about light switches. I don't know about you, but I am starving, and it is time to head downstairs and get some dinner.\n\nNow, we all meet up in the lobby and we make our way over to the restaurant, and as you sit down at the table, you see in front of you an empty dinner plate.\n\nWhat can you do with this dinner plate? Well, of course, you can put food on it, #putfoodonit . But you can do all sorts of other stuff too.\n\nThe plate is smooth, so it looks like it is easy to rotate and slide around.\n\nThere is a nice little gap along the edge, so it looks easy to grab and lift up.\n\nIt looks like a Frisbee, so you consider how far you can make it go. Or maybe not.\n\nOur notions about how we interact with this plate are called affordances.\n\nIn other words, a plate's physical characteristics provide visual and tactile cues about what interactions the plate afford to us.\n\nA plate's physical characteristics make certain actions seem possible, and others less possible. We look at the plate, and we think, I am going to put food onto this object. Or, we might also think, I'm going to use this object to transport my food to a different location. We don't look at this plate and think, I'm going to use it for drinking water.\n\nAffordance is not an attribute of the object itself. It is more about the relationship that individuals have to an object.\n\nAffordance varies based on one's physical abilities. So, therefore, affordance varies from person to person. So, for example, this is kind of an extreme one.\n\nA Frisbee affords me with a possibility of catching and throwing. For my dog, a Frisbee affords the ability of catching, but not throwing. A plate affords me with the ability of eating food off of it. Interestingly, my dog perceives the very same affordance.\n\nNow, because affordance is subjective, one person can perceive an affordance when another does not. People are more likely to perceive an affordance when it is related to an action that they are more likely to take.\n\nSo, for instance, I could use a plate as a saucer, and it would make a really great saucer. I don't think I would get any argument from you guys, but this is an unlikely action to take, so I wouldn't readily perceive a plate's glass-putting affordance, whereas I'm very likely to put food on it. So I readily perceive the plate's food-putting affordance.\n\nYou perceive affordances with every environment and every object that you have ever interacted with. When you walked into the restaurant, you passed through a door that afforded you the ability of passage. The door is human-sized, so you can imagine your body moving through it unobstructed. There was a continuous grounds plane, so you can imagine yourself walking along it, without stumbling, tripping.\n\nThe chair that you sat in affords the ability for sitting.\n\nThe table in front of you affords the ability of putting objects onto it.\n\nThe ground below your feet affords the ability for resting your feet.\n\nManufactured objects include cues to evoke affordances.\n\nThey let people know what actions are possible, and the obviousness and visibility of those cues helps people to know the correct or the intended ways of interacting, and the same should be true for apps.\n\nSliders afford dragging a knob along a track. Dials afford rotating. Buttons afford tapping, and clicking.\n\nIn each of these examples, affordance is communicated with maximum efficiency. In fact, over time, we are all becoming more comfortable with increasing levels of abstraction. The button, after all, is just a highly abstracted version of a physical, real-world button.\n\nAll that's necessary to create a strong connection between the two are the rounding of the corners. A subtle drop shadow around the slider knob separates it from the track that it is positioned over, and this separation suggests that it can be moved independently. And even that visual cue might not be completely necessary. For most people, simply seeing a filled-in circle over a line is all that is needed to express a sliding affordance.\n\nAnd sometimes affordance is communicated using animation. Tapping on the Weather app, we see it slide up a little bit. This suggests the possibility that the content areas can be scrolled.\n\nAnd sure enough, they can. Regardless of the exact technique that you use, your app's interface must make clear what action possibilities it affords.\n\nIf not, people won't know how to properly interact with it. They'll interact in ways that your app doesn't support, and they'll confuse controls for non-interactive objects.\n\nOkay. So, now that we know where our food is supposed to go, it is time to order.\n\nNow, I am thinking about getting a cheeseburger because they're delicious, obviously, and when a waiter comes by to take my order, I say, \"Cheeseburger, please.\" He then asks how I would like it cooked, and \"medium,\" I say.\n\nHe then asks what kind of cheese, cheddar, Swiss, Jack, Gruyere, cottage? \"Cheddar,\" I say.\n\nHe then asks whether I would like bacon, egg, avocado on it? \"None,\" I say. I am trying to keep my figure.\n\nHe then asks whether I'd like salad, fries or onion rings. \"Onion rings,\" I say.\n\nHe then asks if I realize that cheeseburgers and onion rings are very high in calories, to which I reply, \"Fake news\" . This  in a nutshell is the principle of progressive disclosure.\n\nProgressive disclosure is a technique for managing complexity. The term is used almost exclusively in the context of interaction design, and to my knowledge, this is the first time that anyone was dumb enough to try to use it to describe ordering a cheeseburger.\n\nThe basic idea is this.\n\nProgressive disclosure gradually eases people from the simple to the more complex.\n\nAnd progressive disclosure is also about hiding away complexity, so that people can accomplish basic tasks with simple and more approachable interfaces.\n\nOrdering a cheeseburger would be way more complex and daunting if you had to consider all of those options at once. Customizing your cheeseburger is way easier when someone steps you through the process one decision at a time.\n\nAnd some choices that you make early on could make other choices irrelevant later. So, for example, if I'd asked for French fries, the waiter would have then asked whether I wanted regular, truffle or garlic fries, and because I didn't ask for fries, I don't really care what kind of French fries they have, and telling me about those options would just be a waste of my time and my limited mental abilities.\n\nOr would it be? I mean, I like garlic fries a lot, and had I known that garlic fries were on offer, I would have gotten them. So herein lies the rub.\n\nProgressive disclosure is a necessary and helpful technique for managing complexity and simplifying decision making. But the same technique can bury information or functionality. So what do you do? Well, discussions about how to properly use progressive disclosure often come down to the 80/20 rule. If you're not familiar, the 80/20 rule is a design principle that says in essence 80 percent of a system's effects come from 20 percent of its causes.\n\nFor an app, this might mean that 80 percent of its benefit comes from 20 percent of the actions that it presents, or 80 percent of the people who use an app are only going to use 20 percent of its functions.\n\nNow, the exact percentages are, of course, different. But the basic point is valid. Not all information or functionality are created equal. Some is much more important than others.\n\nSo, in order to reduce clutter, and simplify decision-making, it is a really good thing to use progressive disclosure to hide things of lesser importance.\n\nIn other words, if your app is complex, it is okay to make the most useful 20 percent of functions easier to find by hiding the other 80 percent.\n\nA classic example of this is the print dialogue. Most of the time, people only care about the basics, which printer they're printing to, how many copies, what the range of pages are.\n\nThese are way less than 20 percent of the functions available, and it is what people want way more than 80 percent of the time.\n\nWhen more control is needed, a bunch of options are just one click away. Not only does progressive disclosure reduce visual clutter, and make printing less difficult, it also lowers the likelihood of people getting confused and changing a setting that they don't really understand.\n\nMost of us have experienced receiving this call from a parent, or a family member, or a friend, who is kind of freaking out because their computer is not working properly, and they changed something, and they don't really know what they did.\n\nThis is why progressive disclosure is your best friend.\n\nBy keeping things simple for novices, they are less likely to feel intimidated, overwhelmed, or get themselves into trouble, while more experienced users can quickly reveal the options and actions that they require, that they understand, and that they are capable of using.\n\nOkay. Anyhow, in case you were wondering, the cheeseburger and onion rings were delicious, thank you very much for asking.\n\nOkay, so it is time for us to get some sleep. We will be getting up early tomorrow, and we are going to be doing some snorkeling, so guys, rest up.\n\nOkay, did everyone sleep well? Was your room comfortable? Were you able to turn on your lights successfully? How is that Morty faucet? That was pretty weird, right? Okay, enough small talk. It is time for us to go see some fish. Now, after another highly successful car ride, we get to the beach, and you put on your goggles, and you put on your flippers, you adjust your snorkel just so, and you get into the water. Now, there are some tropical fish. There is a blowfish. There is a school of tuna fish.\n\nThere is a giant squid, for some reason, because I had the emoji . It is a magical underwater wonderland.\n\nIt is so utterly beautiful, but why? This brings us to our very last design principle. Symmetry. Symmetry is a concept that we are all deeply familiar with, and when we think about symmetry, we typically think about reflectional or bilateral symmetry. But there is more. There is also radial, and rotational symmetry.\n\nAnd there is also translational symmetry.\n\nThese three types of symmetry are ubiquitous in nature. Symmetrical forms are efficient forms, and we tend to associate them with good health, with stability, balance, and orderliness. And we consider them to be aesthetically pleasing, probably for very good evolutionary reasons.\n\nSymmetrical elements, even if they are not physically connected to each other, are perceived as though they are.\n\nSo when we see these two facing square brackets, our mind unconsciously integrates them into one coherent object.\n\nAnd as you swim around, you'll find all three forms of symmetry.\n\nBilateral symmetry, rotational symmetry, and translational symmetry.\n\nAs a matter of fact, just about every type of plant or animal, both in the sea, in the water, on land, in the air, demonstrates one or more types of symmetry. And most human-made objects do as well.\n\nLight switches are symmetrical across both the horizontal and vertical axes.\n\nFaucets are symmetrical. And cars are symmetrical. Now there is obviously some very practical functional reasons why cars are symmetrical. I mean, there is a very rational reason why you don't want to get into that car. But there are clearly aesthetic benefits as well.\n\nAttractive interfaces tend to demonstrate a mixture of reflectional and translational symmetry. In the Weather app, reflectional symmetry provides a sense of balance. Key elements are centered along a median line, while almost all of the other elements are counter-balanced with each other.\n\nThis is a pattern which is reflected in apps like the Camera app, the Clock app, and the Phone app, and many, many more.\n\nTranslational symmetry gives an interface a sense of structure, and order through the repetition of like elements.\n\nYou can see translational symmetry in the even repetition of cities and times in the Clock app, or the even cadence of locations in the Weather app.\n\nWhen laying out your app's interface, look for opportunities to use symmetry to provide a sense of balance and order.\n\nOkay, so, everyone, I am sorry to be the bearer of bad news, but it's time for us to get out of the water. There are a lot of you, and we can only pay for a half day trip. Also, I don't know if you saw, there was a shark in the water, and I am really starting to freak out. So we return back to sunny San Jose. Now, the snorkeling here is not quite as beautiful as Hawaii, and I strongly urge you not to go into the bay. But our technical and design content is way better, so it's a win-win.\n\nNow, the design principles that we explored today express fundamental truths about human perception and cognition.\n\nThey are simple, but powerful reminders about the true nature and purpose of design.\n\nThey provide a framework for understanding, and a language for articulating a design's strengths and its shortcomings.\n\nMy hope is that in sharing these principles with you today, you will come away with a clear sense of how your app's designs can help to fulfill those basic needs that we all share. The need to feel safe. The need to understand. The need to achieve our goals, and the need to experience beauty and joy.\n\nNow, to be sure, while these principles are, in many ways, quite simple, applying them to your work is not.\n\nEach of these principles could lead you into different directions about what you should do with the design of your app.\n\nDesigning is so often about resolving those differences. This is something that the very best designers struggle with.\n\nIt is also possible to have too much of a good thing. Too much feedback is annoying. Too much visibility is distracting. Too much progressive disclosure can make work flows inefficient. So you have to be measured in your approach, and exercise judgment and discretion.\n\nAnd the relevance of each principle can vary depending on what kind of app you're making.\n\nPlatform. Screen size. Use case. The experience level of the people who you are designing for. These factors and more should influence what principles are most relevant at any given moment.\n\nWorking through this can be challenging. No one said that designing is easy, but I do not want you to be discouraged. Designing is a lot easier when you understand the fundamentals. Let these principles be your North Star. They will guide you toward making apps that better serve the human beings that you are designing for.\n\nAnd that is the thing that matters most.\n\nAnd in turn, the people that you are designing for will recognize, on some level, all of the hard work that you have invested. They will appreciate the thoughtfulness and care, and they will sense the humanity of the people who made it.\n\nOkay, so for more information, check out this URL. And, I want to highlight how many amazing design sessions we have for you this week. We actually have eight design sessions, which is more than we have ever done before. We have three sessions that have five mini sessions in them each. There is a lot of fantastic content. In particular, I want to highlight a couple of sessions. One is called Designing Sound. It is being given by the person who makes basically all the sounds that are on your devices. It is nothing, like nothing we have ever done before. It is really fantastic. It is this afternoon. And you should go check out tomorrow, a presentation called Designing Across Platforms, which helps to solve really tricky issues about how to adapt your app to different platforms. It is really awesome.\n\nOkay, you guys, it has really been an honor and my pleasure to talk with you today. Thank you so much.\n\n[ Applause ]",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/802i3ngpjoeupj/802/802_hd_essential_design_principles.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/802i3ngpjoeupj/802/802_sd_essential_design_principles.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "20022",
      "year": "2020",
      "title": "The winners of the 2020 Apple Design Awards",
      "url": "https://developer.apple.com/videos/play/wwdc2020/20022"
    },
    {
      "id": "803",
      "year": "2017",
      "title": "Designing Sound",
      "url": "https://developer.apple.com/videos/play/wwdc2017/803"
    }
  ],
  "extractedAt": "2025-07-18T09:38:59.990Z"
}