{
  "id": "508",
  "year": "2019",
  "url": "https://developer.apple.com/videos/play/wwdc2019/508/",
  "title": "Modernizing Your Audio App",
  "speakers": [],
  "duration": "",
  "topics": [
    "Audio & Video"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello, and welcome to our session about Modernizing Your Audio App. My name is Peter Vasil, and I'm a software engineer in the Core Audio Team. Let's start with audio units.\n\nSupport for Carbon-Component-Based Audio Units will be removed in a future macOS release. We encourage hosts to use the AudioComponent API for audio unit discovery.\n\nWith the next OS release, AudioHardwarePlugIn-based plugins are disabled by default. We recommend using the AudioServerPlugin API instead. For now, disabled plugins can be re-enabled in the Audio MIDI Setup utility, but support will be removed completely in a future macOS release. With the next OS release, we will introduce some deprecations. AUGraph, Inter-App Audio, and OpenAL will be deprecated. We encourage developers to switch over to AVAudioEngine, as replacement for AUGraph and OpenAL.\n\nFor Inter-App Audio, please use Audio Unit Extensions instead.\n\nThe 3D Mixer parameters have been unified across all platforms. For details, please refer to the AudioUnitParameters header file for a list of new and deprecated parameters. For more information, please visit the developer website.\n\nThank you for your attention.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2019/508kk896m9xoeaz1a/508/508_hd_modernizing_your_audio_app.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2019/508kk896m9xoeaz1a/508/508_sd_modernizing_your_audio_app.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:25:45.127Z"
}