{
  "id": "104",
  "year": "2019",
  "url": "https://developer.apple.com/videos/play/wwdc2019/104/",
  "title": "Apple Design Awards",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Good evening, developers, and welcome to the 2019 Apple Design Awards. Now, here's your host, Senior Director of Evangelism, John Geleynse.  Hello. Well, hello, and welcome to another Apple Design Awards. Thanks for joining us this afternoon, especially after a long, but exciting day. And I just want to particularly thank all of you who have joined us from around the world online on the live stream for the ceremony right now. We've got a huge group.\n\nYou know, it's great for us to join as a community, and gather like this to take a few moments to celebrate and acknowledge excellence in innovation and design.\n\nBecause at Apple, we've been awarding excellent design for more than two decades now.\n\nWhat started originally as the Apple Human Interface Design Excellence Awards, or HIDE Awards for short, was renamed a few years later to what is now known as the Apple Design Awards.\n\nYou know, the world around us is stunningly beautiful, and as humans, we're attracted to beautiful things, and to incredible designs.\n\nWe're drawn to these things, and we respond to them deeply. And at Apple, we believe the true -- the beauty -- that beautiful design is both appearance and function, and something that works well with each component deeply considered, and each aspect carefully crafted -- that that can be profoundly beautiful.\n\nAnd so, simply judging something by how it looks isn't enough.\n\nIt's how it works. It has to work as beautifully as it looks, and great design reflects the broader definition of beauty. And it runs deeper than the interface. It's coherent, and it's cohesive. And it helps us to engage with each other in new, and innovative, and life-enhancing ways, and like compelling beauty, great design draws us in. And the Apple Design Awards have always been about this -- recognizing great design, and then celebrating the developers who positively impact everyone else, and real people with the things that they create, the things that you create.\n\nNow, we select our winners each year by evaluating them in basically three key areas.\n\nThe first area is design.\n\nWe're looking for apps that are -- that have strong visual design, that are efficient and easy to use, that have great game play, that have attention to detail and polish, that are internally coherent. On the technology front, we're evaluating technology usage, and so we're looking for apps that are fast and responsive. We're looking for apps that take full advantage of all of the capabilities of our latest devices, and we're looking for apps that use the latest Apple technologies to do really great new things. And on the innovation front, we're looking for brilliance.\n\nWe're looking for new ideas.\n\nWe're looking for uniqueness, platform differentiation, and things that just weren't possible before. And the developers of our winning apps this evening have done an outstanding job, and outstanding work in these three areas, and more, and we want to honor that work.\n\nWe want to acknowledge the distinct joy and the challenges of the app creation process that we're all so familiar with.\n\nWe want to honor the endless hours, the late nights, and the dedication that goes into the pursuit of excellence.\n\nWe want to recognize the dead-ends, and the frustration, and the exhaustion sometimes that often goes unseen, and we're all familiar with that.\n\nAnd we want to honor the unconventional thinking, the creativity, and the new ideas that lead to breakthroughs and innovative solutions. So let's get started.\n\nWinners tonight are going to win some pretty great -- some pretty amazing prizes, and each prize package includes a 512 gigabyte iPhone XS with a set of AirPods, a 512 gigabyte 12.9-inch iPad Pro with Apple Pencil 2, a 64 gigabyte 4K Apple TV, an Apple Watch Series 4, a top-of-the-line MacBook Pro, and a fully-loaded iMac Pro.\n\nIn addition -- in addition -- and this is what all of you want -- each winner will -- each winning develop -- each winning app will be highlighted on the App Store, similar to what we did last year on the Today tab for the Apple Design Award winners, and what we did throughout the year following the ceremony. So this year's winners will be highlighted in prominent ways on the App Stores.\n\nAnd lastly, each winner will take home one of the coveted Apple Design Award trophies, except that we thought it was time for a refresh. And so, we have a completely new trophy this year, redesigned from the Apple Design Team. It retains the integrity and recognizable qualities of the original award, but reinterprets these with the qualities of our latest products. It's made out of 100% recycled aluminum, and featured a mirror-finished stainless steel Apple logo inlay. It's pretty sweet, if you ask me.\n\nAll right.\n\nSo we have nine -- we have nine winners today, and each winner will be announced and demoed by a colleague -- by colleagues of mine from the Apple -- from the -- from Apple's World Wide Developer Relations Team. Now, a little bit differently than other years -- if we announce your app, if we announce you as a winner, please stay in your seat because we're going to first talk about your app, and explain it to the community. And we're going to demo it, and when we've completed the demo, we're going to call you forward on stage, and ask that you'd come up on stage using these stairs here at this location. So, let's find out who the winners are.\n\nTo present our first winners, I'd like to invite my colleagues, Si Ching and Oscar on stage.\n\nThanks, John.\n\nFor our first award today, we have a gorgeous platform game designed for the mobile screen from the ground up. It's optimized for the portrait orientation with simple drag-and-release controls. Oscar and I had so much fun with this game, and we can't wait to show it to you.\n\nThe first award goes to Ordia by Loju.\n\nOkay, let's get the demo up.\n\nOkay, Oscar, let's take this game for a spin. Ordia tells the story of a first life form emerging from this gooey primordial soup, and then goes on a precarious trip to start its journey as a living being. It needs to jump through caves, gather nutrition, while also avoid being eaten or killed.\n\nOrdia has its amazingly-rich and vibrant design style, a lovely blobbiness and bounciness throughout -- not just with the visuals, but also the sound design.  What we love about this game is that it's intuitive enough so you simply start playing, and it introduces rules and challenges gradually as you go through the levels. It uses colors to communicate the roles of each element. Green and yellow things are friendly, while pink things must be avoided. It also leverages our Taptic Engine just the right amount, so you get this subtle and satisfying feedback while you play.\n\nOrdia has three universes. They are immersive, consistent, yet also distinct from each other, with carefully balanced color palette, different game elements, and soundtracks.\n\nNow, let's have a look at the jungle universe. This is actually a really tough level. I've never been able to go through without dying, so good luck, Oscar.\n\nI love the pacing of this game. The challenges alternate smoothly between speed, timing, and accuracy, while also offers you these little resting pods, where your Ordia can regenerate if it dies, so you can breathe a little. The balance between difficulty and satisfaction is very well managed, so you just feel like you have to play one more level.\n\nOrdia caters for accessibility with great care. Its colorblindness mode has even been tested on monochrome. Now, what if you want to do a challenge on a level where you catch every single nutrition, or race for your fastest completion time? No problem. You can also play on an iPad with a much larger screen.\n\nThe game automatically syncs your progress via iCloud. Loju is the creator of Ordia, a very small and talented game studio based in London. They spent two years building this game, and have just launched it a month ago. Please, go ahead. Download it today and have a play. I'm sure you'll get so much inspiration from it. And now, let's welcome Team Loju to the stage. Congratulations.\n\nThat's a fun game.\n\nAlright. To award our next winner, I'd like to bring up Dave and Mike.\n\nNotebooks are one of the most successful designs humanity has ever produced. They're simple inventions -- just a stack of pages bound together, and protected by a cover.\n\nBut from the earliest notebooks, there's always been a sense of excitement, starting with a blank page.\n\nWhen inspiration strikes, you grab a pen, and let the ideas flow.\n\nOur next winner captures the essence of this experience in digital form.\n\nPlease help me congratulate Flow by Moleskine.  Thanks, Dave.\n\nThis demo was really hard to prepare. Every time I would launch Flow, and try to figure out what I would share with you today, I would start drawing, and completely lose track of what I was supposed to be doing, which is a testament, I think, to how well this app is designed.\n\nNow, to help you to get into and stay in a state of creative flow, they encourage you to set up everything in advance, like picking the color of the paper, or the patterns that you want to use.\n\nThey also encourage you to set up the drawing tools in advance, so you're not messing around with interface later, and they have some really great drawing tools, like this mechanical pencil.\n\nNow, as you can see here, drawing is very realistic, and by supporting Apple Pencil 2 gestures, iOS drawing APIs, and Metal, you can get some really realistic shading effects.\n\nIt looks pretty true-to-life.\n\nThey have a great felt-tip pen that looks basically like you would expect a pen to look, and they have great markers with really nice buildup of ink for realistic marker-like experience.\n\nThey also have an awesome calligraphy pen. Now, playing with these tools -- it kind of -- it takes me back to when I was a kid. My mom -- she was a really great calligrapher, and she had a business called Inklings. And -- yeah, I thought that was a pretty clever name, by the way.\n\nAnd when she would get supplies for her business, she would often take me with her, and I would have so much fun just playing with all of the markers and pens.\n\nDrawing tools here really kind of takes me back to that experience, but the real heart of the interface here is customizing the drawing tools.\n\nEverything in this interface is animated, and they even have these really great optional sound effects. Check out when you change the brush size, how the nibs change in response, or when you change the nibs, they pop on and pop off.\n\nBut the heart of this interface is changing the color. You adjust the value on the side here on the right, swipe side to side to adjust saturation, and color by just spinning the color wheel.\n\nAnd check out how all of these -- all of these colors have unique names. There's 1400 names in all. It's just like a real marker set.\n\nNow, I'm feeling inspired to actually draw something, so to extend the canvas and stay in a state of flow, I just swipe over to the side.\n\nI'll draw something in the theme of calligraphy in front of a couple thousand people, so hopefully I do this all right. I'm going to draw a little feather pen.\n\nSo I'm just going to trace in the outline with a felt-tip marker.\n\nIt's looking pretty good.\n\nIt's a little bit flat, so I think I'm going to add in some shading.\n\nIt's a little bit more realistic. And then zoom in here -- whoops -- add in some color for the feather pen, and then touch things up with the eraser.\n\nAll right. That's looking pretty good, but, you know, no drawing is complete until you sign your name. All right. I think we're done. Dave? Thanks, Mike. Please help me welcome to the stage the team from Moleskine to accept their award for Flow.\n\nYeah, the attention to detail in that app is amazing, and that's one of the things that we look for when we evaluate for design. All right, help me to welcome my -- our next presenters, Lauren Stralo and T.C. Chan.  Thanks, John.\n\nThe next award goes to The Gardens Between.\n\nNow, we absolutely love this game because it captures the magic of time.\n\nHave you ever wanted to travel back in time, or maybe just relive a moment that you reminisce about? Well, technology hasn't quite gotten us there yet, but playing this game gives you a sense of what that might be like.\n\nAnd you play as these two main characters, named Arina and Frendt.\n\nThis game tells a special story about friendship, and we absolutely love it for its cinematic moments and its immersive experience. Let's take a closer look. T.C.?  Let's have a moment to take in this whole island.\n\nNow, beyond the stunning imagery that you see, what really impressed us about this game is that this kind of attention to detail actually extends to its bespoke soundtrack, its natural-feeling haptics, and more than that, the storytelling. Notice how Frendt is taken aback when Arina's able to walk over the clouds, and then he catches up, still a little unsure. And here, I just stopped time, and I do that by just not tapping anything. This means that I'm never feeling rushed or under any kind of time pressure. We think this game play mechanic is really simple, yet effective. Now, because you move both characters at once, and only control the flow of time, an interesting interplay happens between the two characters. Here, you will notice that Arina is no longer able to move any more forward in time, and that's because Frendt has fallen behind. So let's go back in time, and see what we can do differently to help him out. Now, you might notice that with each time I hop over the saw handle, it continues to cut through the plank. So let me go back and forth in time a few times.\n\nNice. I see what you did there, T.C. Yeah. All right. So now, Frendt is able to catch up, and they continue their journey. Just around the island, there are these bells. They're highlighted because they're interactive. So I just need to tap the screen. Frendt hits the bell, and in this case, the light is given back to Irina. The objective is to bring the light to the top of each island.\n\nNow, let's move away from game play for a while, and have a look at this heartwarming scene. As you play this game, you will learn that things are considered and deliberate, and probably a hint. So we're not going to spoil any more of this for you today. So please help us welcome The Gardens Between creators to the stage, The Voxel Agents. Congratulations.\n\nI mean, how cool is that? That is an app that is crafted with care.\n\nAll right, for our next winner, I'd like to invite Adrian and Corinne.  Thanks, John. Great apps combine seamless onboarding, intuitive controls, and stunning visuals to create a truly immersive experience. And when it comes to games, it's these elements that can make even a novice player feel like a pro.\n\nNext up, the award goes to Gameloft for Asphalt 9 Legends.  Asphalt 9 is a hyper-realistic arcade racing game with incredible graphics. Let's take a look.\n\nMy colleague Corinne's going to jump in to see if she has what it takes to become a legend.\n\nThere are over 50 of the world's most amazing high-speed vehicles available to select.\n\nEach is a meticulously-detailed version of the vehicle, with endless customization.\n\nWe're going with one of my personal favorites, the Chevy Camaro, and of course, we had to make it purple.\n\nWith 70 courses spanning the globe, from Cairo to the Himalayas, today, we're going to be racing the streets of Shanghai.\n\nAll right, here we go.\n\nAnd she's off. You'll immediately notice the realistic details due to some post-processing effects, including motion blur, reflection, color grading, even god rays-- Gameloft was able to achieve these console-style graphics with their custom engine and with Metal 2 integration, all with an impressive 60 frames per second of smooth performance.\n\nControls are easy to pick up with Touch Drive. Acceleration and braking are handled for you, so that you can focus on navigating the course, but don't let the simple controls fool you. Players are responsible for timing drifts, nitro boosts, and finding shortcuts in order to beat the competition.\n\nThe team was inspired by skateboarding, and wanted the vehicle maneuvers to reflect that stunting style. So you'll see 360-degree spins, barrel rolls, and tons of fearless jumps.\n\nAdd in a bit of nitro boost, and hold on.  Speaking of style, have a listen to that soundtrack.\n\nAsphalt 9 mixes over two hours of music to keep your heart racing as you cut those close corners.\n\nThree control styles, endless customizations, single and multiplayer mode -- Asphalt 9 truly has something for everyone.\n\nAnd with a combined 4.8-star rating from over 300,000 players, it certainly does. The question is, like Corinne here, do you have what it takes to become a legend? Please welcome to the stage Gameloft. Congratulations.   That's an incredibly innovative game with the new type of driving, and the technology integration's phenomenal with that kind of performance.\n\nAll right, up next, for our next winner, my colleagues Ennis and Eric.\n\nDo you sometimes find that you take a photo, and it doesn't quite capture the feeling of the moment? The secret is, professional photographers adjust their photos after the shoot, and create the desired effect. But that takes time, and for most of us, we don't even know where to start -- what colors need adjusting, or how do you find that perfect composition. But this is exactly where this app truly shines. The award goes to Pixelmator Photo.  Eric will show you now what can be achieved with this incredible app exclusively on the iPad. Thank you, Ennis. I'm really excited to show you all just how easy it is to edit photos on your iPad using Pixelmator Photo. Let's get started. I've got this great image of this boy playing soccer on a beach in India, but I think with a few simple adjustments, we can really make this photo pop. I'm first going to hit the Auto-Enhance button, which is already making this look quite a bit better. But I want it to have a more vintage look to it, and for that, I'm going to have a look at some of the many built-in presets within this app. I love all these different film looks, and the urban looks, but I specifically like these classic films. So I'm going to choose number 2.\n\nI think that looks really good, and there's one more thing I want to do to this image, which is to crop it before I share it with my friends.\n\nAnd what's really unique about the cropping in Pixelmator Photo is, the team trained a custom Core ML model on thousands and thousands of images to gain a deep understanding of the content of the photos. And by doing that, they let me, as their customer, just simply enable this Smart Cropping feature, and I can choose a different aspect ratio, like a square frame. And there, in two taps, I have this perfectly-cropped image ready to share. Let's take a look at one more photo. I'm going to tap on the Files button here on the top, and I'm going to choose this photo of this lovely couple in New York. And this is indicative of a lot of the photos we have in our personal libraries. It's a really sweet moment, but it suffers from a very unfortunate lighting situation. I'm going to use the ML Enhance again to immediately improve the image, but what I want to show you is what's happening behind the scenes.\n\nThe Pixelmator team spent months training a custom Core ML model on over 20 million image pairs, and from that, they learned how to automatically control over 32 different adjustments, from white balance, hue and saturation, lightness, color balance.\n\nUnderstanding all these individual adjustments on your own can be very daunting, but with the ML Enhance feature, it's a perfect place to start. I can do something like simply bump the black point just a little bit more, and I think that looks great.\n\nI can deep-press on this photo to compare it, and I think you'll agree that's a much better version of this image.\n\nSo that's just a very quick tour of the simplicity of Pixelmator Photo. By leveraging Metal and Core ML, the app is fast, and it's intelligent. And with this beautiful, simple UI, and direct integration with files, it really is easy photo editing for everyone. Amazing app. Well, as we seen, Team Pixelmator's native Lithuanian . Congratulations, and please, welcome to the stage.\n\nYou know, we love how Pixelmator Photo uses Apple technologies to do new things, and this isn't the first time that this team has been on stage. And that's not without good reason. The Pixelmator Team is consistently in lockstep with new devices that we release, and new technologies. Phenomenal, phenomenal work. All right, to present our sixth award, I'd like to bring on Lauren and Paolo Verani.  Now, we love the game ELOH for its beautiful animation, illustration, and creative approach to throwing a ball at a block. While you play, you learn basic physics and geometry with rhythm and music.\n\nNow, music and sound effects are key elements to helping you solve this chilled-out puzzle game. You can play, relax, and decompress all while finding your groove. Now, I absolutely love playing this game, and I know you do, too, Paolo. Yeah, I do. Will you help us take a look? I do, actually, Lauren. I actually love playing this game with my son, Luca. It's his favorite game right now, and the reason for that is that the first time you launch ELOH, you realize that there is no onboarding. There are no instructions. Just like many great iOS games, you just learn by playing. Now, the goal of the game is to get the little ball that emits from this speaker down to the target, and you do that by -- you achieve that by tapping on these tribal masks, and moving them around the screen. Great. I think my reputation is saved. Level four is done. Now, the game has 99 levels, and as you would expect, things can get more complicated. Yet, the game still offers a very relaxing experience, and I think the key component here is the sound effects, and the soundtrack, which complements the beautiful graphics and delightful animations. And the other fun aspect is that, while you're playing, you're actually composing your very own soundtrack. Cool. Let's get through level 12. Great. Now, level 12 is special, because we get rewarded with a little totem animation. What is also fun about this game is that there is no score. There is no -- there are no time constraints. Therefore, a little six-year-old kid can play without any time pressure, or fear of making mistakes.\n\nELOH is the result of a great team collaborating from across the world with the creator and developer of the game, which is an Italian guy based in Vienna, a sound designer based in Seattle, an artist in New York, and a Portuguese animator. Whether you're six or 96 years old, ELOH will deliver hours of relaxing fun. Please help me welcome the Broken Rules Team to the stage. Congratulations.  Now, that is a game with personality, which is a great -- characteristic of great design. All right, up next, we have an app that sets a new bar for innovation, and to tell us more about it, I'd like to introduce Alexis from the Health Team and Chris from Developer Relations.\n\nAt Apple, we believe a powerful combination of hardware and software, combined with a delightful user experience, can change the world. Our next winner combines their innovative device with a beautiful iOS app to create an experience that is changing medicine.\n\nThe winner is Butterfly IQ from Butterfly Network.  As a cardiologist, the ability to see inside the body provides me with insights that simply aren't possible through other means, and 2/3 of the world has no imaging at all. This is Butterfly IQ. It's a handheld ultrasound, and it costs $2000.\n\nThe current state of a common ultrasound machine is $60,000+, and is about the size of a refrigerator.\n\nThis device is built on the premise that you can move ultrasound to a microchip, and move the compute to an iOS device.\n\nLet's get started with a quick scan of Chris's heart.\n\nAll right, let's take a look.\n\nYou'll notice the design is made to work well with one hand, no click wheel or keyboard.\n\nWe love the attention Butterfly paid to this one-handed experience.\n\nI can adjust how deep the ultrasound can see with the swipe of a finger, and take a video clip of the image. Okay, don't breathe.\n\nAll right. Congratulations, Chris. Your heart looks good. All right.\n\nBeing able to take this device and plug it into an iPad or an iPhone helps make imaging simple. And now, I want to show you something truly amazing.\n\nOn the screen, you are going to see Butterfly's AI and ML-backed technology helping me take a measurement called an ejection fraction that I use regularly. As I start to get the image, you'll see that slider at the bottom, hinting to me, guiding me, helping me get a diagnostically-useful image.\n\nWe love this thoughtful design cue that is helpful, subtle, and powerful. After I get a useful image, I can have the app calculate ejection fraction.\n\nIsn't that spectacular?  And one of the things I love about this design is that it shows you the data behind the calculations. So you saw on the screen there that outline of the heart. If I saw a point that looked off, I could just correct it.\n\nWhat Butterfly has done with this app and hardware is truly an exceptional display of design, from the design of the chip, to the design of the device, to the design of the app, and all the technologies involved. Congratulations to Butterfly IQ.\n\nNow, that is an inspiring example of innovation, bringing healthcare to -- all over the world, to places where it would not be available otherwise, using this new technology. All right, I'd like to call on my next -- on -- next up, my colleagues Mark and Corinne to talk about our next winner.  Thanks, John.\n\nOur next winner is a music rhythm game, but it's unlike any rhythm game I've ever played. In fact, it's unlike any game I've ever played, period. Our next winner is Thumper.\n\nThumper -- here's my best attempt to describe it. You play as a metallic space beetle matching a dark, industrial beat, which propels you down a narrow track towards psychedelic alien space monsters.\n\nYeah, you've got to see this for yourself.\n\nThumper does a terrific job introducing new game play mechanics one by one.\n\nNow, in this case, we're learning to change lanes, but just to get you up to speed quickly, we've already learned to tap when we pass over a glowing pad, swipe left and right to turn, and swipe up to jump.\n\nNow, audio cues actually guide our swipe timing, but just when you think you have it figured out, the cadence switches.\n\nThe custom soundtrack in Thumper plays a key role in defining the tone of the game, which the developer describes as dread on a cosmic scale.\n\nNow, in this low-level boss battle, if you make a mistake, the level will seamlessly reset and advance toward you. With ceaseless levels and a pulsating beat, Thumper is an intense, continuous experience.  Thumper's visuals are difficult to describe, but easy to appreciate.\n\nInspired by psychedelic rock, pinball machines, and more, these graphics rival those on any other platform. In fact, the developer created a custom engine which is powered by Metal and renders at 60 frames per second -- very impressive.\n\nNow, we hardly have time to talk about all the careful design decisions that the developer made, like supporting real-time portrait and landscape switching.\n\nHaptic feedback to emphasize a crash, tilt controls to change lanes -- they created a custom gestural system to detect swipes for the turns, and then, of course, they have a pause button that fades away until just the moment when you need it. It's incredibly satisfying to beat a level in Thumper, but there's no time to celebrate, as the next level comes screaming toward you.\n\nThumper also supports Game Center leader boards, and iCloud Sync to save games across devices.\n\nAll right, let's turn the volume up so you can really appreciate how well the graphics and soundtrack are orchestrated.\n\nThumper's striking graphics, driving soundtrack, and unified design make it a deserving winner of an Apple design award. Congratulations to Drool. Please welcome them to the stage.   That is pretty great. I think it's super-fun, and super-compelling, with great game play and deep system integration.\n\nAll right, to present our final award tonight, I'd like to introduce Doug Lemoine and Larry Moss.\n\nSo this last app shows that you don't need to be a big team to create an experience that's truly groundbreaking. It solves a new problem using powerful technology that's so seamless, it's almost invisible.\n\nWhen Larry and I first saw this, I think we had the same reaction. This must be fake. This must be fake . The winner of the next Apple Design Award is HomeCourt by NEX Team.  All right, let's take a look.\n\nThe core of the experience is a list of drills and workouts. These drills are super-easy to set up, and require no special equipment, unless you count this headband, which I carry everywhere.\n\nLet's do a dribbling drill.\n\nIn this case, we're going to use a tripod, but it's just as common to use your iPhone popped up against a water bottle. So the drill will get started when I'm in the frame. The iPhone camera, Core ML, and Vision frameworks are doing all the work, not Doug. But to be fair, Doug is really good, but even non-experts can benefit from HomeCourt's ability to make them a better basketball player.\n\nLower and faster dribbling will make you score more points. Faster, Doug, faster.\n\nGood job. So at the end of the drill, I get a nice little summary.\n\nAnd in addition to doing these dribbling workouts, HomeCourt is also great for tracking shooting drills. In fact, you can see up here on the screen, it has tracked your makes and your misses, as well as where you shot the ball from. In fact, it also gives you this nice video where you can see your shots, and where you took them from. You know, Doug, this is really revolutionary. It's true, Larry .\n\nBefore HomeCourt, you would have to do this stuff manually. You'd have to have someone track it for you. Absolutely. And today, you see kids, and even adults, using HomeCourt to improve their skills. So when you finish a drill, you can actually share your results with your friends, your teammates, your coaches, or with people around the world.\n\nBut you know, Doug, basketball is way more fun when you play against someone else. And HomeCourt has competitive drills, too. Do you want to show them? Oh, totally. You're on.   So the objective in this drill is to not hit the red targets.  Your shoe's untied. Yeah, that's what you think.\n\nGet into frame, man.\n\nYou beat me again.  HomeCourt's use of amazing Core ML technology really makes it so that everyone can become a better basketball player.\n\nCome on up.\n\nAll right, well done. Well done. Incredible work. All right, so that's a wrap. Please join me in thanking my colleagues who were here on stage showing you the apps this evening.\n\nAnd more importantly, let's thank our winners one last time. So please stand. If you're in the rest of the house, please stand as well if you're one of the winners.\n\nGive them a big round of applause.  So nine great apps and games that stand on the shoulders of 88 winners before them, and raise the bar even higher.\n\nWe look forward to what you're going to do for next year based on all of the technologies that you learned about today, and that you're going to learn about throughout this week.\n\nThanks for coming again. We hope you have a great WWDC. Good night. [ Applause ]",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2019/104d6zyhb21vki/104/104_hd_apple_design_awards.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2019/104d6zyhb21vki/104/104_sd_apple_design_awards.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "113",
      "year": "2021",
      "title": "WWDC21 Apple Design Awards (ASL)",
      "url": "https://developer.apple.com/videos/play/wwdc2021/113"
    },
    {
      "id": "20022",
      "year": "2020",
      "title": "The winners of the 2020 Apple Design Awards",
      "url": "https://developer.apple.com/videos/play/wwdc2020/20022"
    },
    {
      "id": "802",
      "year": "2019",
      "title": "Designing Award Winning Apps and Games",
      "url": "https://developer.apple.com/videos/play/wwdc2019/802"
    }
  ],
  "extractedAt": "2025-07-18T09:38:03.256Z"
}