{
  "id": "10204",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10204/",
  "title": "Create great enterprise apps: A chat with Box's Aaron Levie",
  "speakers": [],
  "duration": "",
  "topics": [
    "Business & Education"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHi. Today we're gonna talk about creating great enterprise applications with Apple technology, and with me is Aaron Levie, the founder and CEO of Box. Welcome, Aaron. Hey, Mike. Great to be here. Thanks a lot for having me. Right now, it's a very, very interesting time with remote working in COVID and some of the things it's requiring. Aaron, what are you hearing from your customers in terms of this new world that we're entering? Obviously, this has been just a complete transformation in how people work in organizations of all sizes all around the world, obviously, brought on by an incredibly tragic and difficult event with massive health care and economic impact, but what it really did was cause companies to have to accelerate their digital transformation strategies, in some cases, by multiple years or a decade. So, one example is, we have a project going on right now at Box which is to improve the performance of our application. So, we want every single part of our app to be able to work in less than a second, whether you're on the Web or on mobile, wherever you are. And normally, that would be five, ten, 15 people working on that project in different meetings, on whiteboards at the office, and that was what we thought of as productivity. That's what we thought of as creativity and collaboration. Now, when we're in a virtual environment, we have 100 people in a Slack channel that are all contributing ideas of how we can get to sub-second latency across our application. And so we can now include people from all different departments, all different teams, people that normally wouldn't have thought of themselves as performance engineers, can now contribute ideas to this way of actually driving updates and pretty important upgrades to our software. And so, a lot of opportunity, I think, for digital transformation today, and really excited to have that conversation with you. And, obviously, with Apple being so important in this space, it's great to be here. I'm also, frankly, personally, curious what you guys are doing as well in this environment. Yeah, we'll talk a bit more about that. One of the things that we're seeing, especially in this remote work environment right now, is companies like IBM, and Oracle, and others that are Mac, that use a lot of Macs, really want zero-touch deployment using Apple Business Manager, so they can ship that device to that new employee or the existing employee, and it's all set up for them. And so, I think there's a general trend that we're seeing of, how do we actually enable that remote worker to be more effective across the board, across all our devices, across all of our products.\n\nAnd so, in this new world that we're in, which is probably not going to go back to the old way, what is Box doing to kind of advance on the product side to realize this? So, we think that the future is a hybrid one, where offices are going to be playing an important role. At the same time, we think that there's going to be more flexibility, more agility introduced to the ways that we work that give people more choice and allow them to be more productive from anywhere. And so, the center of that, that ability to create a hybrid environment where we can work from the office or work from anywhere, the cloud is at the center of that, and delivering a modern digital workplace is at the center of those two worlds. And so, we think a digital workplace is going to bridge the physical and the virtual in the future. At the center of that digital workplace, we need modern technologies to be able to do our work. We need to be able to have modern devices like MacBooks and iPhones and iPads. We need to be able to be on modern and secure networks. We need to be able to protect our identity from the cloud, so we can work from anywhere. We need to be able to collaborate in real time, to be able to hop on a video call, whether that's WebEx or Zoom or Google Hangouts. We need to be able to chat and communicate on products like Slack and other tools. And our job at Box is, we want to be the best way to manage content securely in that remote and distributed way of working. And so, anytime you want to be able to access files, anytime you want to be able to share files securely with your partners and your colleagues and people in and outside of your business, we want to be the best way to do that in the cloud. Fortunately, we work with nearly 100,000 customers globally. We're in about 70% of the Fortune 500, and we have amazing organizations that are trying to enable this new digital way of working, where on a moment's notice, you can hop on a new MacBook or jump on an iPad and be able to get to all of the data in your enterprise that you have access to in a very secure way, and be able to securely collaborate and share with the people that matter most in your business. So we've really pivoted our road map and pivoted our strategy to help our customers with these remote work use cases to really be able to help customers drive a new level of digital transformation in their business. There's sort of two big pillars that we think about. The first is the pillar of, how do you enable collaboration and modern work to get done in this new distributed environment where you might go into the office or you might work from anywhere instantaneously? And that's technology and products and services like the ability to collaborate in real time. We are really excited. We're working with an all-new version of our iPad app that will have Apple Pencil support. So you'll be able to annotate in real time on a document and be able to make sure that those annotations are seen on the Web or on the desktop from other people that need to be able to collaborate with you. We're working on all-new ways to be able to securely share content on mobile devices in a very seamless way. So, we're really, really excited about the innovation that's coming for helping remote workers and being able to work in this modern way. At the same time, we're also really excited about the number of business processes that we're seeing that are now going to be digitized for the future of work, and that's in a range of industries. From banking to health care to education to life sciences and more. So that's how we've sort of pivoted our strategy to make sure that we can help support customers right now. And in that strategy, could you elaborate a little bit more around Apple technology and how you think about that in your business as well as what you're hearing from your customers? Fundamentally, we think that there's a bridging of the consumer-grade technology that we're used to in our personal lives, whether it's a device like a MacBook or an iPhone, as well as the cloud services and the security that we need from an enterprise context. And that's really where, obviously, products like Box comes in. So, we are building across all the core platforms. Across Apple products, our vision is that we want to deliver the most seamless way of getting work done. Whether you're leveraging a MacBook or whether you want to be able to collaborate securely on an iOS device, we make sure that we have an iOS-first strategy in terms of how we design our applications, making sure that we're leveraging the best user experiences. And again, fundamentally thinking about this as a consumer-grade experience. How do we bring consumer-grade experiences into the enterprise, so people, no matter where they're working from, they don't have to worry about all the complexity the support and all the challenges that you might have to have in a normal IT environment. And that's really going to require consumer-grade solutions to being able to enable this new way of working. Mm-hmm. And I think that's one of the reasons why our companies work so well together, because we are obviously very consumer-focused. We obviously have this focus on the enterprise as well that's emerging. We want to bring that consumer DNA and that kind of consumer thinking in the products to enterprise products. So, if I think about even the things that we're working on right now, it's expanding on zero-touch Mac deployments, it's expanding on auto-advance to allow an organization to order computers, so once they arrive, they can just plug them right in and instantly, that employee is actually basically working and functioning. And then also been realizing that there are requirements in the enterprise that are really unique. Like updates, being able to control updates, when they happen, when they don't, and being able to recognize the fact that, unlike the consumer space, that enterprises have a different tempo or different kind of speed that they're actually iterating on. So, just a personal example. So, when we first went to a remote work environment even at Box-- We have only 2,000 employees, so it was easier for us and a little bit smoother. I remember when I needed to set up my new iMac to make sure that I had all the right video setup and the right environment, it took me, literally, maybe five minutes from booting up a brand-new machine to having access to every single critical application in our business and being able to work securely with all the people that I needed. And so, that ability to be able to work seamlessly in the cloud on any device, being able to work in any environment and instantly boot up the technology that you need from a fresh start of a computer, that's the power of what consumerization of technology is going to look like in the future. So that's something that we're really excited about. And again, as a personal user of these products, I can see it firsthand of being able to go from zero to your entire IT stack in five minutes on a new device: That's what the future of work is. Mm-hmm. What can you be-- If you want to give guidance, let's say, to an enterprise that's out in the audience listening, what kind of guidance can you give on how they can better deal with this rapidly-changing landscape? Yeah, I think, regardless of industry, again, we're seeing this across every single sector. I think this is a catalyst for digital transformation that is going to accelerate projects that maybe were two or three or five, ten years out, and that's going to start to happen. Those projects are gonna be executed in the coming months and quarters. So, I personally think this is one of the best times ever to be in either information technology or developer working on enterprise software, because of the fact that every single business is going to have to rewrite their underlying processes and their experiences for both employees and their customers. And so if you think about working backwards from-- Instead of looking at our business process that got developed over the 20th century and saying, \"What could that look like in the digital world?\" we have an opportunity now, from scratch, to say in the 21st century, \"What should that experience look like?\" When you can really kind of work backwards from what's the right way to deliver education in the future, what's the right way to deliver health care in the future, the right way to be able to serve customers if you're a bank and you want to automate their onboarding process and make sure that they never have to send you paper or do signatures in the future? So, I think developers are going to be at the center of being able to transform both the future of work, and the future of a lot of these enterprise experiences. So, I think a couple things that come to mind. First is, think like a consumer. When you're developing software for the enterprise, think consumer first. We are all consumers in our personal lives, and yet, somehow, when we go to the office, we sort of give up on thinking that we have to deliver consumer-grade experiences. We sort of have this feeling that, \"Okay. Well, enterprise software can be slow and complicated because, oh, it's enterprise software.\" Well, that makes no sense in the 21st century. We should have every single experience in the enterprise be able to match and keep up with experiences that we have in our personal lives. That's the first thing. The second thing is, I think we have to be thinking about a mobile-first and digital-first world. When you think about the kinds of products that you deploy, when you think about the kind of user experiences that get created, we know that these are going to be the ways that people want to be able to work. They want to be able to load up their iPhone quickly, be able to make sure that they can use these applications in a very, very seamless way. I'm spending more time on my iPhone in my work-from-home environment than I am even on my computer and it's because, in some of these cases, it's just easier to be able to communicate and chat and collaborate and get on video and open up a document when you're on an iPad or an iPhone. And so we want to be able to make sure that we're delivering amazing experiences. I think the third thing is, really, to be thinking about security, by design, built into the products that you're creating. We know that the world is dealing with a tremendous amount of challenge around data security and cyber security and data privacy, so really making sure that the software that we build has security built into the core, data privacy built into the core, this is what's going to differentiate all of our applications that we create for enterprises, and it's the only way that we can realistically go and serve at hospitals and government agencies, life sciences organizations, banks, universities, K-12 education and so much more. So, think like a consumer when you're building software, make sure that security is built in by design. And again, I think we have an opportunity to rebuild much of the software and the experiences for the 21st century. And what have you found as you focus on security and privacy, how you leverage with the Apple technology stack, let's say, to enable that for your customers? Yeah, I mean, first and foremost, the underlying capabilities that Apple devices are providing our users and our developers is obviously fundamental. So, whether it's the encryption that we have on an iOS device, whether it's the security and safety that's offered on a Mac device, this is why we recommend these platforms to our customers. We're leveraging a lot of the native APIs and core experiences from a security standpoint, and we're really excited about, again, whether it's MDM technology and so much more, to be able to plug in to more and more of these experiences over time. What are the some of the challenges that you're running into as you-- I mean, this vision that you paint, I totally agree with, in the enterprise, of where the trends are going, but what are the technical challenges you said that you see on the horizon that you would challenge the audience to focus on, or even ourselves here at Apple? Well, I think we've got a lot of-- certainly a lot of legacy technology that most enterprises are dealing with, and any large business, whether it's 5,000 employees or 100,000 employees and more, they're dealing with this duality of there's so much innovation, so many modern experiences they want to go create, and at the same time, they've a lot of legacy infrastructure. They've a lot of legacy processes. So, our general view is starting with some of the highest leverage parts of the business. The things that touch the end user, the employee, the customer, really start there, and make sure that we're focusing on those types of user experiences. I think we have to build toward a cloud-first architecture, a digital-first experience, oftentimes a mobile-first architecture in terms of the software that we're building, and I would just challenge every enterprise software developer, every IT organization to think in terms of those ways of delivering technology. I think obviously, Apple has been an incredible partner in this ecosystem. Apple probably single-handedly has done more to modernize people's thinking about enterprise software, especially because of iOS devices that caused the industry to say, \"Wait a second. Why do we have to have bad technology in our business environment? Why can't we use MacBooks, why can't we use iPhones, why can't we use iPads?\" And that's caused a different level of thinking about the software that we go out and build for our customers, and I think it's been a huge boon. There's a lot of things I think we all need to be doing around deeper interoperability, better seamlessness of experiences as more data moves to the cloud. It behooves all enterprise software developers to create a level of interoperability so customers can have choice, so they can have integrated experiences. I think there's going to be some exciting, new-- On the forefront of security that we're going to see, especially what Apple is delivering, but I think we have to make sure that security is baked into all of the technology that we use. It used to be that if you were a software developer, you thought it was somebody else's job to handle data security. It was the device or it was the network provider or it was just a security technology vendor. That's not the case in the 21st century. If you're developing software for the enterprise, security has to be baked into every single thing that you do and every single way that you handle data. So I think there's going to be a lot of change. I think we're going to see more change in the next couple of years in the software ecosystem than we have in the past couple of decades, and that's because we know that we're at the start of another wave of digital change happening in these industries. In this mobile-first approach that you're suggesting, how do microservices and continuous integration development play into that from a culture and a process perspective? Fundamentally, I think you have to be oriented toward microservices because of the fact that there's too many capabilities that you need to be delivering to your customers, and so we have to be able to deliver individual innovations that get updated for our customers on a continuous basis because of how quickly the world is changing. And so, when we think about releases, we don't think about releases in quarters or years, as you maybe would have five or ten or 20 years ago in traditional enterprise software. We think about releases on a daily basis. And we think about releases not only when we're going to ship native code that people are going to update on their iOS devices, but what cloud services are we now implementing in the background that's going to make our software better, faster, simpler, easier, more secure for our customers? The only way to really do that is if you have a modern architecture, if you can run on top of microservices, if you can separate out the core components of your application, if you can make sure you're doing continuous development and integration. All of those things are fundamental to a modern way of developing enterprise software. Now, realizing there's a lot of sessions at WWDC around new frameworks or updates to existing frameworks. This conversation's a little different 'cause we're talking about the cloud and the endpoints. What are the other considerations that developers need to have for how to design those cloud services that the devices are connecting into? Yeah, I think we're definitely in a new era of the client server architecture, right? What logic do you put in the cloud, what logic do you have on the device, how do you leverage and take advantage of the native characteristics of these devices, so where is the moment where something like Core ML starts to make sense, to be able to have device-level machine learning and leverage the processing power and the security and privacy power of the device? What things do you run in the cloud? And we're always having that sort of debate internally. What belongs at the end user level, whether that's a security reason or performance reason and what things do we want to make sure that we're leveraging the cloud for? We have a lot of services where we'll even have in the browser on a MacBook or any device, we'll have the browser be doing processing that maybe a couple of years ago we would have done as server-side processing, but because we've seen such improvements in HTML5 and modern technology, we can go improve that. Same thing on the iOS device, right? So, what things can we do local to that device so we can improve the user experience, make something snappier, make it faster, cache it in a more efficient way? And I think, again, it behooves all software developers to get clear on that architecture, because it's not a given that the way you would've done something ten years ago when the devices were slower, maybe they didn't have as much compute capacity, maybe we didn't have Core ML. You don't want to be designing things in the same way you would have maybe ten years ago today, when there's all-new services that you can be leveraging. I think taking a step back, taking inventory of what's possible now in 2020, and how we should be building software is a really big opportunity for, I think, all developers. And then bringing that full circle to the trend towards working from home, being forced, and then probably having a world where we have this hybrid, as you point out. What are the areas that you feel like are not being met? So, I think there's a huge opportunity for developers right now to say what is work going to look like in the future when, on a moment's notice, you might want to pull up any device, you might be in any location, you might be on any network, and you want to be able to collaborate in real time with anybody in your business? I think there's going to be a wave of innovation that reimagines the combination of synchronous work and asynchronous work the way that-- How do you start to approximate some of the ways that we used to maybe work in an office, but do that virtually? How do you start to hop on a video call within, literally, a couple seconds without having to schedule the full meeting? How do you collaborate in real time on documents and be able to leverage new ways of sharing information across just a plethora of devices and networks? So I think this is going to be an amazing opportunity right now for software developers both in large enterprises as well as start-ups to start to think about the new characteristics of work, the ways that we can deliver a modern digital workplace, to be able to get people on the same page, whether that's on video or whether that's in documents or whether that's in chat or whether that's in other ways of sharing knowledge, and there's going to be all-new companies that we look back on five years from now that will be the next era of Slacks and Zooms of the world that get created because of this new way of working and it's going to be incredibly exciting to see what emerges in the coming quarters and years. Yeah, I know. It's a really remarkable time, this convergence of home and work. Truly. It's blended now.\n\nAnd there's gonna be a whole new set of experience and applications and services that emerge from that. We definitely share a similar vision. Well, Aaron, thank you so much for your time today and hopefully you all enjoyed this discussion around creating great enterprise applications with Apple technology. -Thanks, Mike.\n-Thanks.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10204/3/4851FA64-34F3-4E4F-AFA0-D60383DD9E2D/wwdc2020_10204_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10204/3/4851FA64-34F3-4E4F-AFA0-D60383DD9E2D/wwdc2020_10204_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:27:18.873Z"
}