{
  "id": "10639",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10639/",
  "title": "What's new in managing Apple devices",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ Hello and welcome to WWDC.\n\nKevin Milden: Hello, I'm Kevin Milden and I'm on Apple's Device Management team.\n\nAt Apple, our team spends our time focused on making devices easier to manage across our platform, apps, and services that you use.\n\nWhether you're assigning 6th graders activities using Schoolwork on an iPad, setting up iPhones in your organization for the first time, or using Apple Business Manager to purchase apps and books for your organization, it is Apple's hardware, software, and services that are at the center of your deployment.\n\nAnd this year we've made some significant strides in bringing numerous crucial device management features to the Mac.\n\nToday we're going to start by reviewing how you can deploy, manage, and secure MacOS Big Sur.\n\nSetting up and deploying Macs has never been easier.\n\nWith Essential Services from Apple, your organization can quickly deploy and support Macs at scale.\n\nOur vision of enrollment requires nothing more than unboxing a Mac and booting it up.\n\nAnd we're delivering on that promise with automated device enrollment.\n\nAll the user needs to do is select their language and connect to Wi- Fi.\n\nIt automatically enrolls organization-owned devices into MDM, so you don't have to touch them before you hand them out.\n\nEnrollment customization allows you to add branding, consent text, and use modern authentication during the setup process.\n\nIt provides a better experience while using new auth vendors such as Microsoft Azure Active Directory, Okta, Ping, and more.\n\nUsing the credentials from your identity provider in enrollment customization, you can pre-populate the user's full name and short name.\n\nWe're also introducing the ability to choose if the account can enable user channel management too.\n\nAfter creating a user account, you can customize the setup process to meet your organization's needs.\n\nChoose which steps to hide and show such as Siri, TouchID, FileVault, Analytics, Location, and more.\n\nWith automated device enrollment there's no step three; you land at the desktop.\n\nAutomated device enrollment enables you to automate MDM enrollment and simplify device setup.\n\nYou can supervise devices during activation without touching them, as well as lock MDM enrollment for ongoing management.\n\nA few years ago, we introduced a new feature that makes it easy to setup Apple TVs at scale.\n\nIt's been very successful and we're bringing it to the Mac.\n\nAll that you do is plug in power and connect Ethernet and then boot up.\n\nAnd all of the setup screens are automatically skipped.\n\nYou land right at login.\n\nIt's the fastest way to set up a Mac and we think you're going to love it.\n\nAuto-advance for automated device enrollment makes it easy to set up a Mac.\n\nIt requires you to manage your devices using Apple Business Manager or Apple School Manager.\n\nOnly power and Ethernet are required but your network must support DHCP.\n\nSkip all the setup assistant steps and reach login within seconds or customize the setup to meet your needs.\n\nAnd if you use encrypted disks, you will be required to enter your password.\n\nNow I've got one more deployment feature for the Mac that I really want to tell you about.\n\nAnd yes, it's for the new Mac Pro! It's called Lights Out Management and will enable admins to deploy Mac Pros at scale.\n\nYou can start up, shut down, and reboot one or more Macs remotely, even if they are unresponsive.\n\nThis is accomplished by sending a command from your MDM server to the MDM-enrolled controller on your Mac network.\n\nLights Out Management requires macOS Big Sur and your Mac Pros must be on the same subnet.\n\nAnd you're going to want to install the Lights Out Management payload too.\n\nHere's how it works.\n\nYou'll need to enroll a Mac to act as the controller on your local network and you will need all the Mac Pros to enroll as well.\n\nThen connect all the Mac Pros to the enrolled LOM controller Mac.\n\nSend the command to your MDM server.\n\nYour MDM vendor will need to support the new Mac commands in order for this to work.\n\nThe LOM controller Mac receives the command and distributes them to each of the Mac Pros.\n\nLights Out Management for the new Mac Pro is an awesome new feature and we hope that you'll take advantage of it.\n\nThese terrific new enhancements to deployment will help you set up Macs at scale faster than ever before.\n\nBut once you have your Macs deployed, what about ongoing management? Let's start with supervision.\n\nSupervision gives admins greater control of how devices operate.\n\nWe're making a change here that you've  been waiting for.\n\nPreviously, user-approved MDM didn't have the same capabilities as automated device enrolled Macs.\n\nNot anymore! Any Mac enrolled in a user-approved MDM will now be considered supervised.\n\nAdmins have the same special abilities, such as controlling activation lock and leveraging bootstrap tokens, just as they do if the device was enrolled using automated device enrollment.\n\nYou can query and list local users and choose to delete them, as well as replace or remove profiles and install supervised restrictions using MDM commands and schedule software updates.\n\nWe've learned a lot from managed software updates on iOS and iPadOS and we want to bring that same experience to the Mac.\n\nThere's a number of new MDM commands for software update, including forcing client Macs to accept software updates and then restart, major releases of macOS and non-OS updates can now be deferred up to 90 days, and we've made a few changes to increase security, such as the removal of the software update catalog, as well as the Ignore flag for major updates only.\n\nNow that's the story for managed software updates, but what about apps? Managed Apps have been a terrific feature on iOS for many years, and we want to bring it to the Mac, too.\n\nYou can now remove apps using MDM commands or they can be removed upon device unenrollment.\n\nManaged app configuration and feedback are supported just as they are on iOS and iPadOS.\n\nAnd if eligible, you can convert unmanaged apps to managed using MDM.\n\nUser-enrolled devices that have managed apps installed do not support conversion.\n\nApps have always been the cornerstone of the macOS experience but as cool as they are, large apps can include additional components that need to be downloaded to each of your clients.\n\nDoing that can slow things down and use up valuable time, which is why we hope you're using Content Caching to reduce internet usage while speeding up the rate of downloading of apps, books, iCloud content, GarageBand music, software updates, Xcode components, and so much more.\n\nThere are over two dozen data types supported by content caching.\n\nWe've added support for internet recovery.\n\nThe initial boot image isn't included, but the full 6 gigabyte recovery image is cached, which will restore Macs on your network faster than ever.\n\nWhen we integrated content caching into macOS a few years ago, we included a new tab and activity monitor that displays key performance metrics to help you understand how your content is being used.\n\nWe're now making those metrics available to you using the new Content Caching Information MDM command.\n\nThey help you determine if content caching is turned on, working, and helping your clients download content faster.\n\nIt gives you the information about registration state, cache pressure, bytes served, and so much more.\n\nAs a developer, please resist the urge to set this command repeatedly at high frequency, as it really wasn't intended to be used like it is an activity monitor.\n\nThere's a bunch of great new features for content caching and we hope that you'll take advantage of them to speed up downloading of content to the devices on your network.\n\nNow just as we have with deployment and management, we're also bringing a number of security improvements from iOS to the Mac.\n\nAt Apple, we strive to strike the right balance between improving security and preserving effortless deployment workflows.\n\nToday we are introducing more things you can do with bootstrap tokens.\n\nA bootstrap token is a reserved encryption key provided by your MDM server that enables macOS to create admin accounts without needing to authenticate with an admin password.\n\nHistorically, admins would need to create complicated workflows to create accounts on the system and then add individual user accounts.\n\nNot anymore! Bootstrap tokens enable users to get a secure token and boot a Mac that uses FileVault.\n\nThis is a really useful feature if you used network accounts.\n\nBootstrap tokens improve the login workflow for mobile accounts.\n\nOnce implemented, admins can take advantage of authorized software updates and kernel extensions.\n\nBootstrap tokens are supported on the latest Macs with Apple T2 Security Chip.\n\nPlease review developer documentation to learn more about bootstrap tokens in your deployment.\n\nNow let's talk about how we took measures to protect users.\n\nYou might be asked to install a profile that was sent to you in an email or one that was downloaded in a web page.\n\nSince profiles can configure your device, we need to make sure that we don't install them accidentally from people that you don't trust.\n\nIn iOS and iPadOS, we introduced downloaded profiles.\n\nThis is where we isolate a profile that's been downloaded.\n\nWe have you install it manually by paying a visit to Settings.\n\nIt's designed to help protect customers.\n\nWe're bringing downloaded profiles to the Mac to offer the same security benefits.\n\nWhen you download a profile, you'll receive a notification that you can review it in Settings.\n\nVisit System Profiles pane and you'll see a new group labeled Downloaded Profiles.\n\nHere you can preview the profile and click Install.\n\nConfirm that you actually want to install it and enter your password to complete the installation.\n\nProfiles can modify the way your device is configured and we want users to take an informed decision when installing them.\n\nAs an MDM developer, you're going to want to consider the challenges that Downloaded Profiles poses to your deployment workflows.\n\nOnce a profile is downloaded, it remains in System Preferences for eight minutes before it is removed from the System Preferences pane.\n\nAs we informed you previously, we've continued to make security enhancements that impact several command line tools that you may be using in your deployment workflows.\n\nAs of macOS Big Sur, you will no longer be able to completely install profiles using Terminal.\n\nWhen you attempt to install a profile via the command line, it will treat it as if it was downloaded and you'll have to complete the install in the Profile System Preferences pane manually.\n\nAll other features of the Profiles command line tool will remain the same and continue to work as expected.\n\nIn addition to changes to the Profiles command line tool, macOS Big Sur also includes a tool called networksetup that makes it easy to view and edit your network settings using Terminal.\n\nThe problem is that admins and standard users have the same abilities to view and modify network settings from the command line.\n\nWe've now imbued these accounts types with different abilities when using the networksetup tool.\n\nWe've also hardened security by honoring the setting that requires your admin password when modifying system-wide preferences.\n\nHere's some detail around networksetup tool.\n\nAdmins and standard users now have different capabilities.\n\nStandard users can only read network settings, turn on and off Wi-Fi, and change the access point.\n\nThey no longer have the same unbridled capabilities that admins do.\n\nTick the checkbox to require your password when modifying settings and security and privacy but admins can get around this by using sudo.\n\nThere's one more significant security enhancement that you should be aware of.\n\nAutomated Device Enrollment uses device serial numbers to know which devices to enroll at activation.\n\nSerial numbers contain bits of identifiable information like where and when the device was built.\n\nThese 12-character numbers help Apple target devices made at the same time, in the same place, to maintain quality.\n\nTo address identifiable information being used maliciously, we're going to start issuing completely random 10-character serial numbers across our product line.\n\nAs an MDM vendor, you depend on automated device enrollment and serial numbers to identify devices.\n\nYou'll need to take the new serial number format change into account within your products.\n\nThird-party solutions must be capable of handling both the current product serial number formats and the newly-updated format at the same time.\n\nThere are a number of other new device management features, restrictions, and commands that MDM vendors can now take advantage of in macOS Big Sur.\n\nPlease consult our updated configuration profile and MDM protocol reference documentation at developer.apple.com to learn more.\n\nIt's a big year for the Mac, but the latest release of iOS and iPadOS have tons of great device management features included this year too.\n\nFrom Shared iPad for Business and Temporary Session to Shortcuts now supporting Managed Open In, iOS and iPadOS have a ton to offer administrators.\n\nJust like with Mac, we're going to focus on how admins can deploy, manage, and secure iOS and iPadOS too.\n\nLet's start with deployment.\n\nWhen time is of the essence, Apple Configurator helps you mass configure iPhones, iPads, and Apple TVs fast using a USB cable.\n\nApple Configurator now supports apps and books locations that are provided by Apple School Manager and Apple Business Manager.\n\nLocations are different places where devices are kept.\n\nFor example, an institution may use a completely different set of apps and books at an elementary school than they do at a high school.\n\nWith this new feature, admins can now go to the account menu and select the location they'd like to use.\n\nThat displays an entirely different set of apps and books for each location that has been configured in Apple School Manager or Apple Business Manager.\n\nThis is a critical feature for our customers and we're excited to introduce it.\n\nIn addition to locations, cfgutil is now more scalable and can restore larger numbers of devices than ever before.\n\nAnd if you didn't notice, Apple Configurator sports a brand new look in macOS Big Sur.\n\nNow let's turn to a few more additions in iOS deployment.\n\nAutomated device enrollment enables you to customize the setup assistant to simplify MDM enrollment and device setup.\n\nIt enables you to get to the Home screen without needing to use the setup assistant.\n\nAnd we're adding new skip keys for the new Getting Started and Update Completed panes in iOS 14.\n\nWe've now brought the Setup Assistant payload to iOS, although it works a little differently than on macOS.\n\nUsing the payload, you specify the same skip keys you use with automated device enrollment and then they will take effect during future upgrades.\n\nThe payload offers two benefits.\n\nFirst, it allows you to skip Setup Assistant panes during an upgrade that you didn't know about when initially setting up the device.\n\nAnd second, skipping the setup panes during upgrade is now possible on all supervised devices, not just those enrolled using Apple School Manager and Apple Business Manager.\n\nI would now like to discuss one of my favorite device management features: Shared iPad.\n\nIt allows students to have a personal experience on a shared device.\n\nShared iPad gives schools the ability to provide each and every student with a personalized experience and their own data, even if the students are sharing iPads.\n\nEarlier this year, we added some great new features to expand the ways in which Shared iPad can be used in different types of organizations, not only schools.\n\nShared iPad for Business can be configured using Apple Business Manager just as you do to configure it for students in Apple School Manager.\n\nEmployees can sign into Shared iPad using their managed Apple ID.\n\nThis is a great feature for service businesses such as restaurants where you can deploy shared devices to take orders from customers.\n\nIf you use Microsoft Azure Active Directory, your users can now sign in using federated authentication and Shared iPad now supports the new single sign-on extension too.\n\nBut wait, there's more! Shared iPad now supports dynamic numbers of cached users which allows you to set the amount of storage for each user instead of a fixed number of users.\n\nYou can also now delete all users from a shared iPad at once and we have added queries for estimated resident users and quota size.\n\nAnd a highly requested feature called temporary session.\n\nA temporary session further expands the way shared iPad can be used in different organizations by allowing a user to sign in temporarily without needing an account.\n\nWhen you sign out, all the data the user created during the session will be deleted.\n\nIt's a quick and easy way for people to start using a shared iPad without a managed Apple ID.\n\nThose are all the new deployment features we've introduced in iOS and iPadOS 14.\n\nNow let's review what we're going to do to make managing iPhones and iPads even better.\n\nFirst up is non-removable managed apps, a great new feature that admins will be excited about.\n\nPreviously, admins could completely lock the Home screen and prevent the deletion of all apps, which constrained the user's ability to manage their own apps.\n\nNow users can continue to rearrange their apps and install new apps and delete other apps that they've installed.\n\nAnd admins can mark only mission-critical managed apps as non-removable.\n\nWhen your users try to delete or offload a managed app, it prevents it and displays an alert.\n\nNon-removable managed apps ensures that your users always have the apps they need on their devices.\n\nYou can now mark specific managed apps as non-removable, which will prevent the user from removing or offloading.\n\nJust like organizations want to be able to have some control over the apps on their employee's devices, they also want to keep a tight control over their proprietary data.\n\nAnd this year, we've added several new ways to maintain that control.\n\nLet's start with a great new iOS productivity feature: Shortcuts.\n\nShortcuts deliver a quick way you can get things done with your apps or with just a tap by asking Siri.\n\nBy Shortcuts supporting Managed Open In, when a shortcut triggers an action where data flow is not allowed because of the device policy, the shortcut will immediately stop running.\n\nWe do this by controlling the flow of data to make sure that managed data does not get shared with unmanaged apps and services and vice versa.\n\nThis makes certain that your organization's data does not fall into the wrong hands.\n\nBuilding on preventing sensitive data from being shared, let's turn to notifications.\n\nOrganizations want to ensure that sensitive information cannot be revealed without user intent, so we've added a setting to control Notification previews to help.\n\nIt's a new key in the notification settings payload called Preview Type, which controls when previews are shown in notifications: never, always, or only after the user has unlocked their device.\n\nThe new key is only respected on supervised devices and will help your organization keep your data private and secure.\n\nNow I have just one more management feature I would like to share with you before we move on to our security features.\n\nManaging remote devices around the world is something that we are all becoming more familiar with.\n\nLet's say you have employees that are located across multiple countries and some of them don't use location.\n\nIt really doesn't make a lot of sense for their devices to be configured to use the time zone of your MDM server by default.\n\nTime management of end points is a critical function of key services.\n\nIf set incorrectly, it could cause serious problems such as authentication issues.\n\nSo we're introducing the new Set Timezone MDM command that allows you to choose the time zone for each device.\n\nAnd it's not dependent on Location Services whatsoever.\n\nMake sure you review developer documentation to learn more about how you can take advantage of this new command.\n\nAnd those are just some of the new management features we are bringing to iOS and iPadOS 14 this year.\n\nBut what can we do to continue to improve the security of your devices? In this section, we will cover some changes coming this year that will impact deployment workflows as well as some new management capabilities you can use to secure iPhones and iPads in your organization.\n\nVPN, or virtual private networks, let people send and receive data across public networks.\n\nThere are three types of VPN that iOS supports: Full Tunnel, which all traffic can flow through; Split Tunnel, which chooses which traffic can flow through it; and we've added support for per-app VPN, which only lets certain apps' data flow through it.\n\nToday, we're going to add support for you to choose which VPN your accounts should use.\n\nThis is called Per Account VPN for iOS and it allows you to choose a replacement VPN for Contacts, Calendars, and Mail domains.\n\nYou can associate an individual account with VPN just like you can the traffic of an app.\n\nDevelopers only need to replace the keys in the Domain payload to take advantage of this new feature.\n\nSince we're on the topic of encrypted traffic, you can now encrypt your DNS too.\n\nMost of our traffic is encrypted when we talk to a server.\n\nBut when we talk to a DNS server, those connections aren't secure.\n\nSo in addition to per account VPN, we're also introducing Encrypted DNS settings.\n\nEncrypted DNS allows you to enhance security without needing to configure VPN.\n\niOS already supports the standard for secure DNS.\n\nNow we're providing the ability to manage it via MDM as well.\n\nLet's talk about just one more new security feature we've included this year.\n\nBeginning in iOS 14, whenever a device associates with a Wi-Fi network, it will use a random MAC address instead of the device's true hardware MAC address.\n\nFor enterprise networks that use captive portals or filtering, the new feature may cause an unexpected behavior as the device may not be identified when it joins.\n\nIf the device fails to join the network, it will fall back to using its real MAC address.\n\nWhile users can disable this feature in Settings, we've also made it possible to disable it using the Wi-Fi payload.\n\nAs there were for macOS Big Sur, there are a number of other new device management features, restrictions, and commands that MDM vendors can now take advantage of in iOS, iPad OS, and tvOS.\n\nPlease consult our updated configuration profile and MDM protocol reference documentation at developer.apple.com to learn more.\n\nThanks for joining me to learn what's new in managing Apple's devices at WWDC 2020.\n\nWe hope you'll take advantage of the great new features across our platforms this year.\n\nThanks.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Device Management",
        "url": "https://developer.apple.com/documentation/DeviceManagement"
      },
      {
        "title": "Network Extension",
        "url": "https://developer.apple.com/documentation/NetworkExtension"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10639/6/CA966211-6AC2-4D0B-B067-5B260747CD5F/wwdc2020_10639_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10639/6/CA966211-6AC2-4D0B-B067-5B260747CD5F/wwdc2020_10639_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10223",
      "year": "2020",
      "title": "Deploy Apple devices using zero-touch",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10223"
    },
    {
      "id": "10138",
      "year": "2020",
      "title": "Discover AppleSeed for IT and Managed Software Updates",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10138"
    },
    {
      "id": "10139",
      "year": "2020",
      "title": "Leverage enterprise identity and authentication",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10139"
    }
  ],
  "extractedAt": "2025-07-18T09:20:34.454Z"
}