{
  "id": "10970",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10970/",
  "title": "A conversation with Lisa Jackson and former Attorney General Eric Holder",
  "speakers": [],
  "duration": "",
  "topics": [
    "Accessibility & Inclusion"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "LISA JACKSON: Hi.\n\nI'm Lisa Jackson and I lead Environment, Policy, and Social Initiatives for Apple.\n\nThank you so much for joining us for today's WWDC conversation on race in America.\n\nI am so honored to be here today and beyond excited to be joined by my dear friend and former cabinet colleague, former Attorney General of the United States, Eric Holder.\n\nNow, before we get started, I want to say a few things about Eric. There's the obvious.\n\nHe was the very first Black Attorney General of the United States and one of the longest serving AGs, a tough job in a tough town.\n\nHe came to the administration with a remarkable record as a successful attorney both in government and in the private sector. But the most notable attribute I want to call out is his unwavering commitment to equal justice.\n\nIn fact, Time Magazine noted this when they named him to their list of one hundred most influential people. And that's a big part of what we're going to talk about today.\n\nSo, Eric, welcome to your first Dub-Dub.\n\nThanks for being here. ERIC HOLDER: Well, thanks for having me, Lisa. It's always good to see you. LISA JACKSON: Now, s we're talking about justice now in a time where we're surrounded by gripping and painful reminders that the fight continues. For many of us, this has been a reality of our life. But for others, this seems to be a new realization.\n\nSo, what do you make of what feels like an all-time high in public awareness around this set of issues? ERIC HOLDER: Well, you know, I think we're in the throes of a generational racial awakening. I think that these happen every so often in American history and I think we're on the verge of another one here.\n\nWhat people saw in Minneapolis with the death, the killing of George Floyd, coupled with other videos that people have seen, coupled with just, I think, a general unease about things racial in the United States, I think we've seen people get into the streets, express concerns not only about what we see in our criminal justice system, but more generally about the condition of people of color in the United States.\n\nI think we are as I said, at the beginning of something that I think ultimately is going to lead to some positive change.\n\nI'm actually cautiously optimistic about where this movement is going to take us.\n\nLISA JACKSON: Wow.\n\nThat's great to hear because there's definitely a lot of energy out in the streets and there's also energy in places across the country, in boardrooms, in companies, in schools.\n\nIn 2009, you famously called this country a nation of cowards for our failure to talk openly about racial issues. And you took some heat for that comment.\n\nNow look at us. So, how many people have called to apologize? ERIC HOLDER: I'm still waiting by the phone to get those apologies or you know, some indication that maybe I called something right back in 2009. The point of that speech was, and it's still true, I think, today, here in the United States, we are experts at avoiding conversations about race and in a lot of ways, that's understandable.\n\nThese are painful, awkward conversations but they're necessary conversations.\n\nIf we want to get to a better place when it comes to racial things, we've got to discuss our history, we have to be cognizant of what the present is all about, and we have to talk about where we want to go in the future.\n\nNow, this means that we have to ask tough questions of one another.\n\nWe have to face some hard historical truths. But if we don't engage in these conversations, we're not going to make the kind of progress that we want.\n\nSo, that was the point of that speech. I think the speech has actually held up pretty well and what I said back then, you know, about Americans being reluctant, hesitant to talk about racial things, I think is unfortunately still true, but I think those people in the streets, those people in the streets are going to force this nation into a very needed - a very needed conversation.\n\nLISA JACKSON: Something we can no longer avoid and that we shouldn't avoid.\n\nERIC HOLDER: I think that's just, you know, that's the beginning. We have to have the conversation but then we have to use that conversation and that necessary interaction to come up with concrete steps to take us to that better place, change policies, put in place measures that will alleviate the unfairness, the injustice that still exists in this country.\n\nLISA JACKSON: So, that's - that's interesting. Let's talk about policy because I know you're an expert on the police system.\n\nYou were our nation's top law enforcement official and so much of your career centered on law enforcement at all levels.\n\nHow do you contextualize the fight for justice with the glaring injustices we're seeing carried out by police? And what do you see from a policy perspective about moving forward? ERIC HOLDER: Well, firstly, I think people need to understand that you know, people find racism in the criminal justice system.\n\nWell, that shouldn't be shocking. We are still a nation that is dealing with racism throughout our society.\n\nAnd so, if you look at any component of that society, you would expect to find racism.\n\nNow, that's particularly troublesome when it comes to the criminal justice system where property, where life can be taken by the state.\n\nAnd so, you want to make sure that we have as neutral a system as we possibly can.\n\nI mean, there are concrete steps that can be taken.\n\nWe need to, you know, ban chokeholds.\n\nWe need to have better training. We need to be better in our selection of who serves as police officers. We can investigate police departments. All of those things are important, extremely important, but we've really got to deal with those larger societal issues if we want to move our criminal justice system to a better place.\n\nAnd that gets back, again, to facing our history and dealing with these larger issues, the fact that we don't have an educational system that works for everybody in this country, that fair employment is not necessarily something that everybody enjoys here, that housing in the United States of America is not necessarily made available to everybody on an equal basis.\n\nYou have to deal with these core issues in addition to dealing with those things that are manifest in the criminal justice system if we want to get to that better place. LISA JACKSON: To these systemic issues, the ones that are sort of embedded in how we run and how we live our daily lives.\n\nERIC HOLDER: Exactly.\n\nI mean, it's - you can't divorce the criminal justice system from the society that it is apart of. And you know, this sounds like a daunting task, you know, talking about systemic changes of things that have been in place for hundreds of years, but at the end of the day, we're talking about manmade problems that are susceptible to manmade and womanmade solutions.\n\nAnd that's what makes me relatively, you know, relatively confident here.\n\nWe've got this new awakening.\n\nWe've got people in the streets. We have a new level of civic engagement, a new level of interest, a new willingness, I think, to confront those hard issues.\n\nIf we can maintain this, this moment that we have can be turned into a movement. So, that's what I think can be done. I think it's going to probably be led by young people as social change in the past has tended to be as well.\n\nSo, as I said, I'm cautiously - cautiously optimistic.\n\nLISA JACKSON: Now, you know, Apple just announced our new Racial Equity and Justice Initiative.\n\nSo, at the heart of it is Apple using our platforms, our voice, our resources to challenge systemic racism.\n\nI know a lot of times, inequalities are hidden in the system.\n\nThey're not always directly able to be seen. Can you share some examples of how this has shown up maybe in your own life or in your career, the inequities you've seen? ERIC HOLDER: Well, as an African American man in the United States of America, you know, we all have stories, you know, that we can tell. I remember going to run to a movie in Georgetown which is a neighborhood in Washington, D.C., very rich neighborhood, a predominantly white neighborhood.\n\nIt was evening, dark, so I was running to a movie along with my cousin. Stopped by the police because they saw two Black men running in a white neighborhood and assumed that something must have gone wrong here.\n\nIt must be something inappropriate.\n\nStopped us, put the spotlight on us, asked us what were we doing. I said well, you know, going to see a movie. What they didn't understand, the police officer didn't understand is that they had stopped my cousin, a Vietnam veteran and me. At the time, I was a federal prosecutor. I was an employee of the United States Department of Justice who worked with police officers and FBI agents.\n\nBut they didn't see that.\n\nThey just saw two Black guys and so you know, a story. And you know, my story is not different than others that - other Black men - that other Black men can share. So, that's, you know, a very visible, personal thing. But then there are systemic things that tend to be a little more hidden.\n\nWhen you look at the ways in which people are refused mortgages - red lining is what we call it in the United States. You know, areas are forbidden.\n\nCertain areas are forbidden for people of color to locate in. So, you go to a bank, you fill out an application, and your application is rejected. You don't really know why but it's a result of discrimination. We've brought lawsuits against banks when I was the Attorney General to stop, you know, to stop that practice.\n\nIf you look at the Fortune 500, if you look at law firms, people of color are simply not represented to the degree that you would expect as leaders of those organizations. And these are people who are, you know, there are significant numbers of people of color who are qualified, who should have opportunities to lead, but they simply don't get those opportunities and as a result, we have again, these silent barriers, these silent glass ceilings that keep people away from positions of leadership that they otherwise should have.\n\nLISA JACKSON: Yeah.\n\nWhen I'm explaining it to people, I sometimes remind them of something I'm sure you heard from your parents, which is my mother and father used to say, you have to be three times as good to get you know, a third as much.\n\nSo, I think, you know, this idea of striving.\n\nWe're not afraid of doing the work but if the system is stacked against you, it leads to frustration.\n\nIt leads to anger.\n\nERIC HOLDER: Yeah.\n\nYou know, it's interesting because I've heard certain people say it's an exhausting thing to be an African American and have to deal with these stereotypes, to deal with the prejudice, to deal with the discrimination. And I thought to myself, you know what? It really isn't exhausting because we train for this from the day that we leave the womb.\n\nIt's something that on a day to day basis, we get used to.\n\nIt's something that we - it's almost like training for a marathon. You know? Day after day after day, you have to put up with this.\n\nYou have to figure out ways in which you deal with it.\n\nAnd after a while, it becomes almost unconscious.\n\nIt's just kind of the way you think that you have to lead your life. But you know, if you're a person of color and you can imagine a world where you wouldn't have to deal with all of those things, boy, it would be a much better existence.\n\nAnd I think that hidden - that hidden thing that we have to deal with really does have a pernicious effect both on our psyche and I think research shows, on our bodies as well.\n\nHigh levels of tension that leads to all kinds of health problems.\n\nBut again, it's not something that you're conscious of on a day to day basis because you deal with it all the time and you just accept it, unfortunately, for the way life has to be. And that - that has to change.\n\nLISA JACKSON: You know, I'm going to change the subject a little bit.\n\nI'm going to let that sit there for a second but then I'm going to change the subject just a bit.\n\nI was thinking back on the drive this morning, to inauguration day in 2009.\n\nYou and I, we were next to each other with our spouses that morning.\n\nThe weight of history, the pageant of it all. We were both the first Black heads of our respective cabinet agencies. I am immensely proud of that.\n\nI always say I was the first Black EPA Administrator for the first Black president. But it says something about our country and our progress or lack thereof.\n\nIs it something you think about and you know, how does that hit you? ERIC HOLDER: Yeah. I mean, it's certainly something that I thought about then.\n\nIt's certainly something I reflect on now.\n\nIt's clear. I wasn't the first Black lawyer who was qualified to be Attorney General of the United States. I mean, I'm very grateful for the fact that I was given that opportunity. I hope I did a good job. You know, there's kind of a dual pressure that you feel being the first.\n\nYou don't want to disappoint people who have sacrificed and supported you and made it possible for you to become the first head of the EPA, the first head of the Justice Department. People sacrificed. People died.\n\nPeople committed themselves so that other - next generations would have opportunities to which they were denied.\n\nAnd so, there's that pressure. Then there's also that pressure that you want to make sure that you perform for the larger world and so that the stereotypes of lack of ability, of lack of performance, you dispel those and you feel that pressure as well.\n\nYou know, it's - it's a lot of this stuff is about pressure, as I talked about before.\n\nBut again, you know, given those opportunities, I think I felt and I'm sure you felt a real duty to perform as best we could, to move the needle, to open the doors for people who would come - who would come after us. You know, it was great to serve with you, to serve with President Obama. I remember that day in 2009 and the hope that I felt and I think the hope that the nation felt.\n\nI think actually, the hope that the world felt.\n\nAnd I think, you know, we had a good eight-year run. There have been some reversals since that period of time but I think as I said, the United States, and I think the world, is really on the verge of a new era, a new and better era.\n\nLISA JACKSON: One thing we worked on together was environmental racism or to fight environmental racism, to bring about environmental justice.\n\nAnd you know, if we're talking, environment is going to come up.\n\nWe know that communities of color are disproportionately impacted by a range of environmental ills, whether it's climate change, air quality, water quality, drinking water quality, land use decisions about what land we are even able to - to consider developing in terms of housing or schools. Is there space for an issue like that in the conversations that we're having in this moment? ERIC HOLDER: Oh, there's not only space for that.\n\nThat is a necessary part of the conversation. We're really talking about life and death issues there.\n\nI mean, we can put in place all kinds of new structures, change attitudes, make opportunities available, but you need to have people live and live in a way that enables them to use the God-given talents that they have.\n\nI mean, we have seen, you know, the negative impacts of environmental racism shortening lives, negatively impacting lives, curtailing peoples' ability to reach all that they are capable of doing.\n\nEnvironmental racism is something that I think for too long has not been front and center and needs to be. I mean, it has to be because you're talking about you know, the way in which a society treats, you know, its people.\n\nAnd locating things next to communities of color that are going to cause high rates of cancer, high rates of asthma, you know, the kinds of things that curtail, again, peoples' abilities.\n\nThese are the kinds of things that people in government have to stop, that societies have to say this is unacceptable, and we have to be, I think, more conscious of our environment and the impact that environment has on all of our people. LISA JACKSON: So agree.\n\nI even like to point out to younger people, even the roads we're driving on oftentimes cut a swath right through the heart of Black prosperity and the Black community.\n\nI grew up in New Orleans where Claiborne Avenue became an underpass, right? And it has a huge impact.\n\nSo, New Orleans. I'm also going to talk about music. It is Black Music Month. I know music is in your blood as well.\n\nWe just celebrated Friday, Juneteenth.\n\nWe talked about Black music as the soundtrack for protest and you're no stranger to protests. You were even on the ground with activists in Ferguson, Missouri. What has been the soundtrack of your struggles through the years? And follow-up question; what's the music that's giving you life right now? ERIC HOLDER: Well, when I think about protests and music that I like, there is one album.\n\nWhat's Going On, Marvin Gaye, 1971-1972.\n\nIt was a great album then.\n\nI think it's the greatest album that's ever been made.\n\nWith, you know, all due respect to the Beatles and other artists.\n\nIt was great back in the early 70's and it still resonates in the 21st Century.\n\nYou know, What's Going On.\n\nYou listen to Marvin sing in that song, over the course of that whole album, you know, both sides.\n\nIt's - he talks about the problems that he confronted, his brother confronted in Vietnam, but it speaks also to issues that we have here in the 21st Century.\n\nYou know, and so, I still listen to that. I still love that.\n\nBut now, you know, it's interesting. You know, what am I listening to now? I mean, 21st Century, this is a turbulent time and I look for peace in my music and so I've gone back.\n\nI'm kind of hanging out in the 70's.\n\nSo, Marvin Gaye, Luther Vandross, Aretha Franklin, Earth, Wind, and Fire, the Stylistics.\n\nAll - this is the music of my youth.\n\nA turbulent time but a time that we got through, a time that gives me hope, makes me think that you know, as turbulent as the late 60's and early 70's were, we got through it and we made a better America.\n\nWe have turbulent times now in the early part of the 21st Century and again, I'm cautiously optimistic. I think we'll get through it again and music helps me have that optimism. LISA JACKSON: Yeah. Me too.\n\nI'm going to bump Living Just Enough for the City up on that playlist too.\n\nI always - Innervisions.\n\nI think that's the reason I actually became an environmentalist, listening to the story of this brother getting off the bus in New York and what happened to him, you know, in those decades after. ERIC HOLDER: If you look at What's Going On, you've got to remember Mercy, Mercy Me, the Ecology. I mean, Marvin covered everything, you know? He covered protests, demonstrations, Vietnam, the Ecology.\n\nIt's a - it's a masterpiece.\n\nLISA JACKSON: It is. It is. Alright, let me take it to the tech community.\n\nThis is a wonderful audience listening to us, dynamic, talented developers who - who are interested in this fight, interested in the fight for change, and I've heard from so many people across Apple, throughout our network, who are looking for ways to help.\n\nWhat are some ways that tech and developers, app developers specifically, can help tackle racism in the work that they do every day? ERIC HOLDER: Well, tell you, you know, this is an unbelievably creative community and I think using the skills that you have to - to aggregate, to massage, to work with data and then to share information, I think that's - I mean, that's the core of what it is that developers do, I think, at their best, you know, simplifying things, making things accessible to people around the world.\n\nSo, I would say that you know, I am not as creative nor technically proficient as people are in this audience, but using those - those skills, those really special skills to come up with ways in which you make available to people the possibilities that they have, opportunities with regard to how they can make their lives better, opportunities in which they can you know, monitor things that are being done in their societies, ways in which the information can be shared across borders.\n\nThis is all the kinds of stuff that you all do so extremely well.\n\nI would ask you to think, you know, about maybe turning your focus from the things that are more traditionally have been expected of you and think about new ways that you can look at this, this other frontier, this racial frontier that is not only in the United States but in other countries as well, and think about ways in which you can focus that creativity, those skills on this problem of race and ethnic strife.\n\nWhat are the things that you can do there that can alleviate those problems? I'm really confident.\n\nAgain, if this community focuses on those issues, coupled with great companies like Apple, you all could have a really meaningful impact for the good on the issues that we have been discussing.\n\nLISA JACKSON: Alright. We will take that.\n\nEric, it is always such an honor to talk to you, such time well spent, so much to take away from our time together.\n\nI just want to thank you so much for joining us, for all you do, for all you've been in service to equality to our community. Just huge thank you. And thanks to all of you for tuning in.\n\nEnjoy the rest of Dub-Dub.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10970/2/E58549F7-1B89-47E6-B569-083F8033815E/wwdc2020_10970_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10970/2/E58549F7-1B89-47E6-B569-083F8033815E/wwdc2020_10970_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:09:10.601Z"
}