{
  "id": "10071",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10071/",
  "title": "Evaluate and optimize voice interaction for your app",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHi, I'm Jess. I'm on the Siri team.\n\nI'm a conversational interaction designer, which is a fancy way of saying that I think about the kinds of things people should be able to do with Siri. I'm going to talk about these two things today.\n\nSo first, let's talk about what you can do with Siri. To get at the heart of it, let's first dig into what we at Apple mean when we refer to \"Siri\" in the first place. You may be familiar with this bit from the Siri Human Interface Guidelines.\n\nSiri makes it easy for people to accomplish their everyday tasks quickly using Voice, Touch or Automation.\n\nThis means that Siri should be equally as powerful and enjoyable to use across all these modalities for all supported tasks.\n\nAs a conversation designer, I, of course, want to focus today on Voice. There are many parts of the overall Voice experience, including the assistant, Intents, Shortcuts, Suggestions, Automations. Siri is a lot of things. First, let's look at Siri, the conversational assistant available on your Apple devices. Siri helps you do all kinds of things, including get information, like the weather, an answer to a math problem or hours of a local business. Complete tasks, like calling a loved one, setting a calendar event or checking important Reminders. And pass the time with all kinds of conversation from asking for jokes to hearing a story.\n\nAll of us at Siri work hard to make a great assistant, but there are ways that you can help it become even better.\n\nLet's look at what you, as a developer, can do with Siri.\n\nIt all starts with intents. But what even are intents? Conceptually, intents are how we a speak a common language. That definitely sounds like something we want to do, but what does it mean in practice? Let's take a look at some examples.\n\nAn intent helps answer this question: What is sending a message? Well, think about what is actually involved when a message is sent. We need to know who you want to send the message to. And we definitely need to know what you want to say in your message.\n\nWe've defined really powerful natural language support for some key experiences in what we call domains, that group related intents to do the things people do every day.\n\nYou'll see these groups referred to as System Intents.\n\nThese intents come with the conversational flow that's needed to complete a request. Do you need to ask what music to play or say a message has been sent? Comes with. Just add your data.\n\nOf course, there are still some things you should think about from the design perspective here.\n\nWhile most of what Siri will say has been written for you, you should still make sure that the dialogue sounds good with your data in it, both from a sentence structure perspective and a text-to-speech perspective. And error cases are always really important, so that people understand what's happened, which means you should pay special attention here and make sure that the errors or unsupported cases in your app map to the dialogue that Siri provides.\n\nBut what about other stuff, like what is it to order coffee? Well, you tell us. You're the expert on your use case. That's where custom intents come into play. With custom intents, the conversational flow isn't provided. But as I said, you're the expert on your use case, so that puts you in an excellent position to create this flow.\n\nJust think through the logic of your use case. What steps does someone need to take? What information do they need to provide? And how would you talk them through it? What words do you use, what order do you ask for things? In addition to intents, we should also talk about Shortcuts.\n\nShortcuts is an umbrella term for a lot of functionality. Shortcuts are a great tool for developers to make their functionality even easier for people to access. They also empower people to create their own routines for things they like to do and then share those routines with others. Under the Shortcuts umbrella, there's Suggestions. Siri can suggest a Shortcut for an action someone has done at least one time. It can surface these suggestions in a variety of ways, making for a more personalized Siri experience and a quick and easy way to access your app's functionality. Siri can also suggest Shortcuts for actions people haven't done yet, but might want to do, based on what they've done before.\n\nThe Shortcuts app. In the app, people can find premade Shortcuts for all kinds of actions, both fun and useful. They can also create Automations, which can run directly on a person's device or can be used by everyone at Home. Just set up the right conditions to run the actions, like time of day, location or when a specific event happens. Last, but certainly not least, Voice.\n\nThese Shortcuts are powered by the custom intents we talked about earlier. They enable people to access your in-app functionality without having to open the app and allow people to add actions from your app into Automations that they may want to set up. Now that we've talked about the ways you can add to Siri, let's turn our attention to what to add to Siri. Voice shouldn't just be about filling out forms. That can be useful, but speaking answers one by one to a bunch of fields isn't what makes a great voice interaction.\n\nVoice is great for simplifying multistep interactions, especially ones that are completed frequently. Think about playing music. If you want to play your favorite artist's newest album, you first need to open the app. Then you either need to know the name of the album or search through the band's whole catalog to find it. At last, you can play it.\n\nWith Voice, you can say, \"Play the latest album by DaBaby,\" and let the app do the heavy lifting of figuring out what it's supposed to play. It's less steps, which is great, but there's also less required from people to accomplish their goal.\n\nSometimes, apps are laid out with several steps before the actual task people want to complete. Imagine our old friend Soup Chef. You have to look at the menu before you can select a soup, even if you know exactly what you want to order. That in-app hierarchy is important to help people who are new to your app know what there is to do. But people who order your soup all the time don't need to see the menu to know they want to order the tomato bisque. Voice accelerates them past the information they no longer need and gets them right to where they want to be-- ordering a delicious bowl of soup.\n\nAnd maybe you have some power users of your app who frequently access something that's not prominently featured in your UI, like Settings.\n\nThis is a great fit for Voice. People who love that feature will be able to access it quickly. And remember that people can use their voice even when they're driving, walking with AirPods or otherwise unable to get to your app on their phone. Voice is great for things people want to do when they're multitasking.\n\nIn addition to having a great feature set, you also want to ensure your experience has great conversation. Taking advantage of available modalities is a great step towards natural conversation. Let's take a quick look at the two modes Siri can use to communicate.\n\nFirst up, silent mode.\n\nIn iOS 14, if the iPhone ringer switch is muted, Siri will be in silent mode by default. As implied by the name, Siri doesn't speak in silent mode. Instead, the screen UI and, where relevant, printed dialogue work together to present all the information people need to complete their task.\n\nAnd then there's Voice mode. Here, while an available screen will still show UI, Siri speaks out all the information people need to complete the task.\n\nSiri:Your message to Eden says, \"Want to get coffee later?\" Ready to send it? How you adopt these modes depends on what solution you've implemented. System intents have a lot of functionality baked into them, including handling these different interaction modes. You don't have to do anything to get this working for people.\n\nCustom intents do require a little work to support this, but the tooling makes it easy. Just indicate what dialogue and UI you want Siri to use when people are looking at the screen and what you want to use when they aren't. Siri will ensure the right pieces are used at the right time.\n\nSo, now that you know the modes Siri can communicate in, let's talk about what Siri actually says. One of the things the Siri team works on is ensuring Siri doesn't speak more than it needs to. So, where appropriate, Siri will use shorter dialogue once people are familiar with a piece of functionality. Let's take a look at an example.\n\nHere, Siri provides more information the first time you ask to change a setting.\n\nThe second time, people don't need the same detail.\n\nOne of the places where Siri does this is in attribution, or letting people know where information is coming from.\n\nIf you build a custom intent and you do your job well, people will use your shortcut a lot. In that case, Siri will stop including the attribution for your shortcut when people access it. But that means you have a responsibility to have conversational dialogue.\n\nAnd so, here are some things to keep in mind to help you do that. Questions are a great conversational marker. They let people know you're expecting an answer, so be sure to use them when people need to provide information to continue.\n\nTry to avoid jargon in your dialogue. You're an expert on your use case, but other people might not be.\n\nUse best practices for spoken English, not written English. This keeps it feeling, well, conversational. And as much as possible, keep dialogue short. It's hard for people to remember everything they hear.\n\nThanks for watching and enjoy WWDC.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10071/2/07184404-5005-4A26-B469-960B8653ECC9/wwdc2020_10071_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10071/2/07184404-5005-4A26-B469-960B8653ECC9/wwdc2020_10071_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10283",
      "year": "2021",
      "title": "Design great actions for Shortcuts, Siri, and Suggestions",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10283"
    },
    {
      "id": "10190",
      "year": "2020",
      "title": "Create quick interactions with Shortcuts on watchOS",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10190"
    },
    {
      "id": "10074",
      "year": "2020",
      "title": "Decipher and deal with common Siri errors",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10074"
    },
    {
      "id": "10086",
      "year": "2020",
      "title": "Design for intelligence: Apps, evolved",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10086"
    },
    {
      "id": "10088",
      "year": "2020",
      "title": "Design for intelligence: Discover new opportunities",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10088"
    },
    {
      "id": "10087",
      "year": "2020",
      "title": "Design for intelligence: Make friends with \"The System\"",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10087"
    },
    {
      "id": "10200",
      "year": "2020",
      "title": "Design for intelligence: Meet people where they are",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10200"
    },
    {
      "id": "10060",
      "year": "2020",
      "title": "Design high quality Siri media interactions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10060"
    },
    {
      "id": "10073",
      "year": "2020",
      "title": "Empower your intents",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10073"
    },
    {
      "id": "10061",
      "year": "2020",
      "title": "Expand your SiriKit Media Intents to more platforms",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10061"
    },
    {
      "id": "10084",
      "year": "2020",
      "title": "Feature your actions in the Shortcuts app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10084"
    },
    {
      "id": "10083",
      "year": "2020",
      "title": "Integrate your app with Wind Down",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10083"
    },
    {
      "id": "10068",
      "year": "2020",
      "title": "What's new in SiriKit and Shortcuts",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10068"
    }
  ],
  "extractedAt": "2025-07-18T09:16:32.933Z"
}