{
  "id": "10658",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10658/",
  "title": "What's new in education",
  "speakers": [],
  "duration": "",
  "topics": [
    "Business & Education"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHi, my name's Brian and I'm an engineer on the Apple Education team. Today I'll be talking about what Apple's been up to this year in education.\n\nFor more than 40 years Apple's been working with educators to help them create rich and meaningful learning experiences. More recently, Apple's provided technologies to support not just students and teachers, but IT and school administrators as well. And, of course, none of this would be possible without the apps and content that developers provide. Since we launched the App Store, developers like you have built thousands of amazing educational apps for the iPhone, the iPad and the Mac. We're committed to working with you to provide the best educational experiences for everyone.\n\nWith that in mind, let's look at how education apps fit into the Apple ecosystem. There's a lot to cover. So, I'll spend a few minutes on the developer opportunities in each of these areas.\n\nLet's start with Schoolwork. Schoolwork makes it easy for teachers to share materials, assign activities and track student progress.\n\nThe latest version of Schoolwork introduces a brand-new design. It's now even easier to switch between Handouts and Student views.\n\nThis is the App Activity Chooser. It's where teachers can assign the Activities from your ClassKit enabled apps to a Handout.\n\nThe Chooser now shows richer metadata for your Activities with the addition of thumbnails and summary info.\n\nBe sure to update your app to use the new metadata fields in ClassKit.\n\nThe new Handout view provides insights into overall class and individual student progress. This view is driven by the Progress data that your app provides. As you can see here, your app can report time spent, percentage complete and quiz scores.\n\nPlease see the ClassKit documentation for a complete list of status reporting options.\n\nSchoolwork 2.0 has an all new design, Handout Library and Handout detail view. The Detail view is great for showing progress from your app's Activities. And there's also support for the new metadata fields, so you can show off the content like never before.\n\nIf you want your app to work well with Schoolwork, you'll need to adopt the ClassKit Framework. Once you do, be sure to include all the metadata that you can and report any progress on Activities back to ClassKit.\n\nSchoolwork helps students and teachers easily tap into the ecosystem of apps that you create.\n\nHow do you do that? You do it with ClassKit. Let's dig into the latest ClassKit details.\n\nAs you saw in Schoolwork, ClassKit is a framework for iOS that lets your app content be assigned to a student.\n\nAnd your app can then report progress back to Schoolwork.\n\nStudent data is very sensitive, and that's why ClassKit only reports Activities that have been assigned in a Handout. And it's only available to certain people, like the student's teacher.\n\nProgress on any Activities that weren't assigned will not be shared or displayed. For example, if a teacher gives a student the reading assignment \"Fun with Science\" in Apple Books, the time spent and reading progress will be reported for that item.\n\nIf that student then also reads \"Basic Arithmetic,\" no status will be reported because that was not assigned in a Handout. In order for app Activities to be displayed in the Activity Chooser, your app must first publish that data to ClassKit as a CLSContext. Typically, this happens after a teacher downloads your app and browses to an Activity.\n\nThis works great for teachers that are already familiar with your content, and using your app, but what about those that aren't? That's why today we're introducing something new for Schoolwork called the ClassKit Catalog API.\n\nThe ClassKit Catalog is a central store of your app's public Activities. Assigning Activities from your app is no longer limited to the local context store. Now the only requirement will be that your app is installed and all of your Activities will be available from the Catalog. Using a web API, you can publish your Activities and they will be available from the Activity Chooser.\n\nThe Catalog also includes new metadata fields that'll make it easier for teachers to find your content. You can learn more about working with ClassKit and the new ClassKit Catalog API, by checking out this year's session \"What's New in ClassKit.\" To get the most from ClassKit, make sure to report progress from your Activities. Include the thumbnails and other improved metadata, and submit your data to the ClassKit Catalog. Schoolwork, ClassKit and the new ClassKit Catalog API are just the beginning of what we have for you today. Let's take a look at the service that brings all of our educational apps together. Apple School Manager, our simple, web-based portal for schools to manage accounts, devices, and content, all from one place.\n\nWith Apple School Manager, IT administrators can easily create classes and manage login credentials for teachers and students. There are also several options for streamlining this integration with Student Information Systems, SFTP, and federated authentication using Microsoft Active Directory. Enrolling devices into Mobile Device Management is easy and you don't have to physically touch devices before distributing them. Check out the session \"What's New in Managing Apple Devices\" to learn more about Apple School Manager.\n\nThe Apps and Books section is where administrators can purchase content for their schools. As a developer, you'll want to make sure it's easy to purchase and deploy your applications.\n\nTo find out more about how best to sell your app to schools and businesses, check out the 2019 session \"App Distribution - From Ad-hoc to Enterprise.\" Apple School Manager is a great way to connect your school to both Apple's ecosystem of products and services as well as the thousands of educational third-party apps for the iPad, the iPhone and the Mac. And this year, it all works together. Apple School Manager, Schoolwork, and Classroom are more integrated than ever.\n\nNow classes created in Apple School Manager are automatically available in both Classroom and Schoolwork.\n\nAnd updates from Apple School Manager are synced down as well.\n\nWhen students sign in with their Managed Apple ID, they will automatically show up in Classroom, and they can see their Schoolwork classes. In addition to better integration with Apple School Manager, Classroom is getting a number of new features too. With Classroom, teachers can easily launch your app on every student's iPad at the same time. Or launch a different app for each group of students.\n\nTeachers can also easily see what students are up to by viewing their iPad screens and even take a closer look using pinch to zoom, which is new this spring. And if your app is ClassKit enabled, teachers can even launch your app with the right Activity already open.\n\nIf you're a teacher, and you create your class in Classroom, you start your class and invite your students to join with a four-digit code. Now you can just tap the AirPlay Class Code button, and all your class info is instantly shared with your students on your Apple TV.\n\nNew this year, classes created using Apple School Manager and Schoolwork will now show up instantly in Classroom. This fall, teachers will also be able to create their own classes in Classroom for use in Apple School Manager and Schoolwork.\n\nClassroom added a bunch of new features this year with Apple School Manager class integration, AirPlay class invitations and pinch to zoom.\n\nYou'll want to make sure that your app is ClassKit enabled to get the most from Classroom integration.\n\nNow that we've covered classroom management, how about the student login experience? That brings us to Shared iPad.\n\nWith Shared iPad, students can quickly log into an iPad and use it as if it were their own device. Your app should behave on a Shared iPad just like it would on a personal device, except the data must be synced from the cloud.\n\nWhen a student signs into a Shared iPad, you shouldn't expect that any of that user's data to be present, as the data may not be available after the student logs out.\n\nAnd new this fall, Shared iPad will offer Temporary Session.\n\nShared iPad Temporary Session enables schools to deploy devices with standard configurations that students can use without sign-in credentials. Imagine that you're a student on your first day at a new school and your accounts aren't ready yet. With Temporary Session, you can still grab an iPad and join the class. When you sign out, all the data created during that session will be deleted. With Temporary Session, no Apple ID is required to sign in and no data is retained after the end of the session.\n\nBy default, Temporary Session is turned on. If you're an MDM developer, we've introduced a new supervised restriction for customers to choose to opt out of using Temporary Sessions.\n\nRemember, for your app to provide a good student experience, all data must be synced from the cloud.\n\nAnd when a student is done with the Shared iPad and logs out, your app needs to be ready to sync in the background. Using longLived CKOperations and UIBackgroundTasks will make this possible.\n\nThat brings us to the topic that all students love, taking tests. New in macOS this year is the Automatic Assessment Configuration Framework.\n\nWe introduced the ability for iPads to be used in standardized testing in 2016. And we wanted to bring this feature to the Mac as well.\n\nThe new Automatic Assessment Configuration Framework enables educational institutions to leverage the power of the Mac, while at the same time preventing students from using features that could give them an unfair advantage.\n\nThe Automatic Assessment Configuration Framework allows you to provide a secure environment for your applications to deliver tests to students.\n\nThe Framework is available on iOS, macOS and supports Catalyst as well.\n\nTest takers are locked into the testing app and features, such as Screen Sharing, Universal Clipboard or Dictation are automatically disabled for the duration of the test.\n\nTo find out how your app can take advantage of the new Assessment Framework, see this year's session, \"What's New in Assessment.\" If you're developing a testing app on iOS or the Mac, you should consider adopting the Assessment Framework.\n\nYou'll need to apply for a new entitlement, so check out the Automatic Assessment Configuration documentation for more information.\n\nOn iOS, the old UIKit Assessment mode has been deprecated, so please be sure to switch to the new framework. Also on iOS, you can use configuration options to customize which system features are available during testing.\n\nAnd that's what's new in Apple Education this year.\n\nNow that you've heard of all of our updates, it's time to figure out where you fit in. If you create apps for use in the classroom, you should be using ClassKit.\n\nYou'll want your app's content to be easily available for teachers to assign as Activities. So be sure to submit all of your app Activities to the ClassKit Catalog.\n\nIf you create apps for testing, be sure to check out this year's Assessment session on how to deploy your app on iOS and the Mac.\n\nAnd all education apps should be ready to work well on a Shared iPad.\n\nWhether you make an MDM system to help IT manage thousands of devices or an app that helps third graders study vocabulary, every piece of technology built by developers like you creates a better learning environment\nfor future generations.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Automatic Assessment Configuration",
        "url": "https://developer.apple.com/documentation/AutomaticAssessmentConfiguration"
      },
      {
        "title": "ClassKit",
        "url": "https://developer.apple.com/documentation/ClassKit"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10658/8/827B5251-1529-46D9-AFD4-274C9CECE198/wwdc2020_10658_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10658/8/827B5251-1529-46D9-AFD4-274C9CECE198/wwdc2020_10658_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10005",
      "year": "2020",
      "title": "What's new in assessment",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10005"
    },
    {
      "id": "10672",
      "year": "2020",
      "title": "What's new in ClassKit",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10672"
    }
  ],
  "extractedAt": "2025-07-18T09:27:21.575Z"
}