{
  "id": "10182",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10182/",
  "title": "What's new in HealthKit",
  "speakers": [],
  "duration": "",
  "topics": [
    "Health & Fitness"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHello, everyone, and welcome to \"What's New in HealthKit.\" My name is Netra, and I'm a software developer on the HealthKit team.\n\nWe have some exciting new developments in HealthKit to share with you, and we can't wait to see what you do with them.\n\nThe first thing I want to share with you is the ability to track symptoms in HealthKit.\n\nTracking symptoms is an important aspect of monitoring health data. Our users might want to track a wide range of symptoms. This could be shortness of breath, sleep or appetite changes, or simply a running nose. Symptoms offer valuable insights into your health. They can also help you or your doctor make informed decisions about diagnoses or treatment. This year, we are proud to introduce 30 symptom data types to HealthKit. We have attempted to cover a wide range of symptoms.\n\nDevelopers can now read and write symptom samples in order to build virtual health experiences in their apps. We can't wait to see the amazing apps you create using these symptom data types. We recently introduced the ECG App on Apple Watch. An ECG, or electrocardiogram, is a test that records the electrical pulses that make up a heartbeat.\n\nBy looking at an ECG, a doctor can gain critical insights about your heart rhythm, and also look for irregularities in it.\n\nThe ECG App on Apple Watch can recall heartbeat and heart rhythm using the electrical sensors on the Digital Crown.\n\nThese waveforms can be viewed in the Health app, and they can also be exported as PDFs to a doctor. This year, we're putting the power of ECG in the hands of all you developers. In the latest version of iOS and watchOS, ECG samples will be available for reading.\n\nAn ECG sample can be read as an HKElectrocardiogram.\n\nAn HKElectrocardiogram represents a waveform as a series of voltage values.\n\nNow, this sample has some important properties associated with it.\n\nWhen you take an ECG on Apple Watch, the recording is checked for atrial fibrillation.\n\nAtrial fibrillation is a form of irregular rhythm. It signifies that the upper and lower chambers of your heart are out of rhythm.\n\nAfter a successful recording, Apple Watch will give you the result of the recording.\n\nThe result is in the form of a classification.\n\nThe classification can be a sinus rhythm, which means that the heart is beating in a uniform pattern.\n\nOr it can be atrial fibrillation.\n\nAtrial fibrillation implies an irregular heart rhythm.\n\nIt is an indication that the user should probably go see their doctor. If Apple Watch is unable to determine the ECG result, either due to a low or a high heart rate, or due to any other reason, the result is considered inconclusive.\n\nThere are some more important properties that make up an HKElectrocardiogram sample. The next one is the symptomsStatus.\n\nIt tells us if the user associated a symptom with this ECG. We already saw the new symptom data types introduced this year. When a user takes an ECG, quite often it's because they have a symptom they are experiencing. This could be heartburn or tightness in their chest. The symptom experienced can be recorded along with the ECG. As mentioned earlier, the HKElectrocardiogram sample is a collection of voltage measurements. The sample is backed by more properties that describe the measurements. These include the average heart rate, the sampling frequency and the number of voltage measurements. The number of voltage measurements refers to the individual voltage measurements that make up an ECG sample.\n\nTo retrieve the individual measurements, you can run the HKElectrocardiogramQuery.\n\nYou can fetch the ECG samples via any of the HealthKit queries and then initialize the HKElectrocardiogramQuery with the fetched sample.\n\nWhen this query is executed on the health store, you get the individual voltage measurements backing the ECG in the data handler. Electrocardiograms are an important diagnostic tool for heart health. Another important metric of the user's health is their mobility. These are metrics that gauge a user's functional exercise capacity, or their ability to do aerobic work.\n\nMobility is strongly tied to respiratory diseases and heart health.\n\nMobility is especially important for patients recovering from an injury, or aging individuals. Mobility metrics are usually measured across a period where the user is walking without stopping on a flat surface. Your iPhone or Apple Watch can also record some of this data during bouts of walking. HealthKit is proud to introduce a new set of mobility types this year.\n\nThe first is the walking speed and step length.\n\nWalking takes strength, fitness, balance, and coordination. Changes in any of these areas could affect your walking speed and step length.\n\nThis may also decline with age, injury, pain, or illness.\n\nBalance and coordination are captured by the walking asymmetry and double support percentage.\n\nThe next one is the stair ascent and descent speed. They are an indication of your cardiovascular health, balance and coordination.\n\nFinally, the six-minute walk test distance is a frequent clinical test for mobility. The more mobile and fit you are, the higher this number will be.\n\nThese data types are available for reading and writing on the latest iOS and watchOS. We have introduced some major features in HealthKit this year. These include symptoms, the HKElectrocardiogram sample and the HKElectrocardiogramQuery, and the mobility data types. We are so excited to see how you take advantage of all these new types, and we look forward to seeing all the amazing apps that you create. Go build great health apps, and as always, let us know if you have any feedback for us.\n\nThank you for watching.\nHave a great a WWDC.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10182/4/96BB3F0A-784E-4154-A542-2F681FB93E30/wwdc2020_10182_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10182/4/96BB3F0A-784E-4154-A542-2F681FB93E30/wwdc2020_10182_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10656",
      "year": "2020",
      "title": "Beyond counting steps",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10656"
    },
    {
      "id": "10664",
      "year": "2020",
      "title": "Getting started with HealthKit",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10664"
    },
    {
      "id": "10669",
      "year": "2020",
      "title": "Handling FHIR without getting burned",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10669"
    },
    {
      "id": "10184",
      "year": "2020",
      "title": "Synchronize health data with HealthKit",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10184"
    }
  ],
  "extractedAt": "2025-07-18T10:38:03.399Z"
}