{
  "id": "10068",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10068/",
  "title": "What's new in SiriKit and Shortcuts",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHello and welcome to \"What's New in SiriKit and Shortcuts.\" My name is Daniel Hsu, and I'm an engineer on the Shortcuts team.\n\nToday, I'm excited to be joined by my colleague, Natalia, to tell you about the latest updates to Shortcuts. SiriKit is our suite of developer APIs for bringing enriched Siri and shortcut support into your app. It's a great way to make the things people do with your apps easier to accomplish by surfacing them outside of the boundaries of your app and letting them out into the operating system. This enables several key experiences.\n\nUsers can perform these actions with their voice, through suggestions that appear on the lock screen and Spotlight, and of course, through shortcuts and the Shortcuts app. The Shortcuts app, which comes built in on iOS, iPadOS and watchOS, is how we make it easy for people to make using the device faster, more automatic, and more personal.\n\nUsing the editor, you can drag and drop easily to piece together actions from all of your favorite apps, which can then be run with just a single tap, by asking Siri, or from many other places in the system, like from a widget on the Home screen, or even automatically with automations.\n\nThere are practically endless possibilities for the kinds of shortcuts you can create and how you use them, from asking Siri to order your coffee, to changing the lights and temperature in your HomeKit-enabled home as you're leaving work. We're putting all the power in your hands. Getting started with shortcuts can be as simple as tapping an \"Add to Siri\" button, which you may have already seen in many of your favorite apps.\n\nIt's important for you as a developer to make setup easy and discoverable.\n\nMake sure to include an \"Add to Siri\" button in a contextually relevant place, not just in a nested settings view. That way, the people that perform those actions in your app every day can set up a shortcut that makes executing that action even faster in the future.\n\nAnd, they can even give it their own personalized trigger phrase, like \"soup time.\" Now that I have that set up, I can quickly reorder my favorite soup from anywhere on my phone. Siri is an intelligent assistant that offers a faster, easier way to get things done with your voice.\n\nAnd this year, in iOS 14, Siri comes with this beautiful, new, compact design.\n\nWe redesigned Siri from the ground up to focus only on the most essential information, minimizing disruption, while still allowing you to quickly get things done, no matter what you're doing on your phone. Your Siri UI should really feel like an extension, both functionally and aesthetically, of your app. To illustrate, let's take a look at the Weather app. Checking the weather in the Weather app is the complete experience. At a glance, you're able to see the weather for all of your favorite cities, and you can drill down into a specific city to see more details, like air quality, sunrise and sunset times, and much more.\n\nIn iOS 13, asking Siri for the weather shows you the current forecast, the upcoming hourly forecast, and a few other details.\n\nUpdating this experience for the compact UI in iOS 14 was an exercise in choosing the most essential things.\n\nIn the new compact UI, we focused on just the most succinct and helpful answer possible. This meant eliminating things that weren't directly relevant. But this doesn't mean minimalism for minimalism's sake. It's really about getting to the heart of what the user intention is. Now, in iOS 14, if you ask for the weather, you'll get exactly that.\n\nIn iOS 14, we brought the same great compact UI experience over to Shortcuts.\n\nIf your shortcut needs input from you, a new compact UI will appear. This works for entering text, numbers, dates and more.\n\nYou can even compose messages and emails, pick a photo, or choose a song.\n\nWe also extended the same UI treatment everywhere you can run a shortcut. Before, you may have needed to jump into the Shortcuts app to complete a task. Now your shortcuts will run seamlessly in the background, and will only prompt you if the shortcut needs input from you.\n\nThis makes a lot of sense, because after all, shortcuts has always been about getting the user to what they want to do even faster. We want to help you understand how to apply this new design principle in your intents.\n\nThere are a few cases you should be aware of. The first is disambiguation, when you're asking follow-up questions to clarify the user's intent.\n\nThe second is Intents UI, which is how your app UI shows in Siri and Shortcuts.\n\nLet's talk about disambiguation.\n\nWith conversational shortcuts, you have the opportunity to ask follow-up questions.\n\nIf you're taking advantage of this for your intents, you should consider adopting the new APIs for customizing how the list is presented.\n\nNew in iOS 14, you have the option to add images and subtitles to your option list.\n\nThis can help people visually differentiate between similar options, which can be important, for example, when ordering soup.\n\nBut use these judiciously, and use your best judgment. Imagery can help someone make the right choice, but it can also end up feeling overwhelming with too much information onscreen.\n\nNow, let's talk about Intents UI.\n\nYour Intents UI now appears in this new compact UI, whether you're running from Siri or Shortcuts.\n\nWhen designing your Intents UI for this new environment, consider what your intent is supposed to do, and what is actually important to show when using it.\n\nBecause the compact UI appears on top of whatever the user is doing, the less vertical space your Intents UI takes up, the more lightweight the experience will feel.\n\nConsider providing a shorter snippet where possible, to minimize disruption to the user's current context.\n\nIn order to help the snippet UI defer to the context it's being presented in, Intents UIs now use a consistent background material whether they're run from Siri or from Shortcuts.\n\nIf you'd like, you can take advantage of the new material by keeping the background color of your Intents UI view transparent.\n\nIf you do choose to use a transparent background material, make sure to test your UI on a variety of different backgrounds to ensure readability.\n\nIn summary, choosing the essential is a key principle for designing for the new compact UI. We can't wait to see what you build. That's the new Siri and Shortcuts experience in iOS 14. Now over to my colleague, Natalia, for more exciting updates to shortcuts.\n\nWhen Shortcuts became an built-in app in iOS 13, it gained a whole new audience. From people using simple shortcuts to set a laundry timer or calculate a tip, to power users with hundreds of shortcuts. Shortcuts allow people to find new, creative ways of interacting with your apps. And in iOS 14, we're making it easier to organize shortcuts by introducing folders.\n\nWith new ways to create and manage shortcuts, people will find and keep track of shortcuts from your apps faster. To get started, there are a few smart folders that help people easily identify which shortcuts appear in the share sheet or on the watch. That's right, people can now run shortcuts on the watch with the new Shortcuts app on watchOS. In addition to running shortcuts from within the app, people can set shortcuts as complications and run them right from the watch face. That means that you can bring the functionality of your apps to the watch face just by using Shortcuts. The watch app works seamlessly with Shortcuts on iOS. People can add or remove shortcuts available on the watch with the new Apple Watch switch in Shortcut details.\n\nTo learn more about how to make your shortcuts work great on the watch, check out the session, \"Create quick interactions with Shortcuts on watchOS.\" Now sometimes, people want shortcuts to run automatically on their behalf when certain conditions are met. And for this, in iOS 13, we introduced Personal Automations. Personal Automations let people run actions based on events, such as time of day, arrival at a location, or the opening of an app. People already build routines around your apps, and automations allow them to do it faster. For example, we've seen people automate their journaling routines with the Open App trigger. Whenever a journaling app is open, the event gets logged in a habit-tracking app, the device is put into Do Not Disturb mode, and a focused writing playlist starts playing.\n\nThis is just one example. There's so much more people are doing with automations. And in iOS 14, we're taking automations even further by introducing new trigger types.\n\nPeople will now be able to run shortcuts when they receive an email or a message, when they close a certain app, when their battery hits a certain level, or when they connect to a charger.\n\nAnd more trigger types can now run automatically without asking people first.\n\nA great place to find inspiration for shortcuts is the gallery, and in iOS 14, we've added automation suggestions to the gallery. They provide catered automations that people may find handy based on how they use their device.\n\nYour actions are the key to great automations. To learn more about enabling people to interact with your app through shortcuts, watch the video on featuring your actions in the Shortcuts app.\n\nAs you can see, shortcuts are great for taking the guesswork out of everyday tasks. No matter how complex your routine is, you can easily automate it with shortcuts.\n\nOur routines may differ, but one thing we all have in common is our need for a good night's sleep. So this year, we're enabling developers to help people manage their sleep routine. If your app involves mindfulness, journaling, music, or any of the other supported sleep categories, your action can be featured in the Wind Down setup experience. All you need to do is mark your shortcut donations as good for sleep with the new INShortcutAvailabilityOptions API. If your app is even remotely sleep-friendly, make sure to watch the session on integrating your app with Wind Down. This year, we have so many exciting improvements to SiriKit that we have a separate SiriKit session. We encourage you to check out \"Get the most out of Siri, Shortcuts and SiriKit\" to learn all the details.\n\nThere are a lot of new features in SiriKit and Shortcuts in iOS 14. We're introducing a brand-new shortcut-running experience and folders.\n\nWe're bringing the Shortcuts app to the Apple Watch.\n\nFor automation, we're adding automation suggestions to the gallery, and providing more triggers.\n\nAnd finally, we're supporting the new Wind Down experience. There's even more that we didn't get to talk about in detail. To dive deeper into what's new in SiriKit and Shortcuts, make sure to watch the sessions linked to this video. Thank you for watching.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Adding Shortcuts for Wind Down",
        "url": "https://developer.apple.com/documentation/SiriKit/adding-shortcuts-for-wind-down"
      },
      {
        "title": "Providing Hands-Free App Control with Intents",
        "url": "https://developer.apple.com/documentation/SiriKit/providing-hands-free-app-control-with-intents"
      },
      {
        "title": "Soup Chef: Accelerating App Interactions with Shortcuts",
        "url": "https://developer.apple.com/documentation/SiriKit/soup-chef-accelerating-app-interactions-with-shortcuts"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10068/6/21534713-4524-4D0D-B555-7E3C2D960F96/wwdc2020_10068_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10068/6/21534713-4524-4D0D-B555-7E3C2D960F96/wwdc2020_10068_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10194",
      "year": "2020",
      "title": "Add configuration and intelligence to your widgets",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10194"
    },
    {
      "id": "10197",
      "year": "2020",
      "title": "Broaden your reach with Siri Event Suggestions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10197"
    },
    {
      "id": "10190",
      "year": "2020",
      "title": "Create quick interactions with Shortcuts on watchOS",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10190"
    },
    {
      "id": "10074",
      "year": "2020",
      "title": "Decipher and deal with common Siri errors",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10074"
    },
    {
      "id": "10086",
      "year": "2020",
      "title": "Design for intelligence: Apps, evolved",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10086"
    },
    {
      "id": "10088",
      "year": "2020",
      "title": "Design for intelligence: Discover new opportunities",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10088"
    },
    {
      "id": "10087",
      "year": "2020",
      "title": "Design for intelligence: Make friends with \"The System\"",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10087"
    },
    {
      "id": "10200",
      "year": "2020",
      "title": "Design for intelligence: Meet people where they are",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10200"
    },
    {
      "id": "10060",
      "year": "2020",
      "title": "Design high quality Siri media interactions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10060"
    },
    {
      "id": "10073",
      "year": "2020",
      "title": "Empower your intents",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10073"
    },
    {
      "id": "10071",
      "year": "2020",
      "title": "Evaluate and optimize voice interaction for your app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10071"
    },
    {
      "id": "10061",
      "year": "2020",
      "title": "Expand your SiriKit Media Intents to more platforms",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10061"
    },
    {
      "id": "10084",
      "year": "2020",
      "title": "Feature your actions in the Shortcuts app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10084"
    },
    {
      "id": "10083",
      "year": "2020",
      "title": "Integrate your app with Wind Down",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10083"
    },
    {
      "id": "10028",
      "year": "2020",
      "title": "Meet WidgetKit",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10028"
    }
  ],
  "extractedAt": "2025-07-18T09:16:27.371Z"
}