{
  "id": "10636",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10636/",
  "title": "What's new in streaming audio for Apple Watch",
  "speakers": [],
  "duration": "",
  "topics": [
    "Audio & Video"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nMy name is Suresh Koppisetty and I'm an engineer on the Streaming Media team.\n\nToday, I'm going to give you some updates on What's New in Streaming Audio on Apple Watch. Last year in watchOS 6, we introduced the ability to stream audio content directly on Apple Watch. As a developer, you could use Apple's very own AVPlayer or your own custom audio protocols for streaming audio content on Apple Watch. This year with watchOS 7, we are bringing the support for new audio codec in AVPLayer. Extended high efficiency advanced audio coding xHE-AAC gives us the ability to deliver equivalent quality at lower bitrate or you can choose to deliver higher quality at equivalent bitrate as compared to other codecs in AAC family. Now given that Watch has highly variable network conditions, we should aim to deliver high quality audio content with as low bitrate as possible. Hence, we recommend using xHE-AAC for encoding all your audio assets. Having said that for interoperability reasons, we also want you to include AAC-LC, HE-AAC or HE-AACv2 variants in the manifest and let the AVPlayer decide what's the best variant to play. That's all about new codecs on watchOS. In case you want to learn more, we have an amazing talk, Deliver a better HLS Audio Experience by my colleague Simon. OK great. Now you got streaming audio on Apple Watch working and you also have this new highly efficient codec to help you improve user experience, but there is still one thing missing.\n\nThat's access to protected content. Developers have these vast, ever growing catalog of protected content that they would love to be able to deliver on Apple Watch. To support this, we are happy to bring FairPlay Streaming to watchOS 7. FairPlay Streaming was first introduced on iOS in 2015. It's a specification which describes the set of steps an app needs to follow in order to securely deliver content decryption keys so the platform could decrypt and playback encrypted media. While delivering FairPlay Streaming keys your app works as a liaison between the platform and your key server. AVContentKeySession is an AVFoundation class designed specifically for handling decryption keys. When the application receives an on demand key loading request from AVFoundation, it handles the various steps in key loading process and responds back to AVFoundation with an encrypted key response.\n\nWith this, AVFoundation can start decryption and playback. Now watchOS 7, we are bringing support for AVContentKeySession for all your key handling needs. AVContentKeySession is not tied to lifecycle of an asset. This decouples key loading from media loading and playback. Hence, applications can have better control on the lifecycle of keys. AVContentKeySession allows applications to initiate key loading on their own at any point in time. This gives applications the ability to optimize key delivery and improve different aspects of playback experience. To know more about AVContentKeySession please refer to AVContentKeySession best practices doc. That's all about the new things and watchOS 7.\n\nNext, I would like to highlight some of the best practices specific to streaming on Apple Watch for improving the user experience even further. Streaming on watchOS is not the same as streaming on iOS. Watch is a low-power wearable device and due to its increased user mobility the network conditions on what are highly variable. This presents us with some interesting challenges for building streaming applications. With that in mind, we recommend avoiding unnecessary network round trips including HTTP redirects on any of the resources needed for playback. Any additional HTTP redirects would directly contribute to start up time.\n\nPre-fetch resources like keys and certificates -- this will reduce the number of network requests during critical part of playback start. You could use the newly introduced AVContentKeySession for pre-fetching content keys. It also helps if you cache the certificate. You could use the expiry tag from HTTP responses to decide how long to cache. Since Watch is only dealing with audio-only content, we recommend using a higher target duration of around 20 seconds to be more resilient to network mobility and battery performance without having a drastic impact on playback startup time. To summarize, we have introduced a new audio codec that helps you deliver audio content more efficiently. We have added the ability to stream protected content on Watch with FairPlay Streaming. We also talked about some of the best practices specific to streaming on Apple Watch for improving streaming performance.\n\nI hope you use these new additions and tips to build amazing audio apps on Watch and bring normal audio content to our customers. If you need more information on best practices for building audio streaming apps on watchOS, please refer to these other sessions as well. Thank you. And enjoy the rest of WWDC.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10636/5/9930A39B-629C-4BD8-A16B-4516BC60E872/wwdc2020_10636_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10636/5/9930A39B-629C-4BD8-A16B-4516BC60E872/wwdc2020_10636_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10158",
      "year": "2020",
      "title": "Deliver a better HLS audio experience",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10158"
    },
    {
      "id": "716",
      "year": "2019",
      "title": "Streaming Audio on watchOS 6",
      "url": "https://developer.apple.com/videos/play/wwdc2019/716"
    }
  ],
  "extractedAt": "2025-07-18T09:25:01.739Z"
}