{
  "id": "10222",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10222/",
  "title": "Create custom apps for employees",
  "speakers": [],
  "duration": "",
  "topics": [
    "Business & Education"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC. Hi my name is Adam Humphrey, and here at Apple I'm on a team that works with enterprise companies all around the world to help them create great custom apps for their employees. And today I'm happy to share some of our knowledge to help you do the same. Apps have changed the way we live our lives. People now expect the same change at work. At Apple, we believe employees should have access to apps that allow them to do their best work and fundamentally improve how things get done. So let's begin. I'll start by describing some of the characteristics that are unique to enterprise apps. Then I'll talk about how to find opportunities in employee roles that are best served by custom apps. And next I'll talk about the importance of not just including your employees in the design and development process but enabling them to drive it. And finally I'll talk about the tools Apple has developed to help you build custom apps quickly, get them in the hands of your employees and continuously improve with their feedback. All right, so let's dive right in. First let me talk about some of the characteristics of an enterprise app. Simply stated, enterprise apps are employee facing and these apps are as unique as the employees who use them. Another characteristic is that many of them aren't found in the public App store. Enterprise apps are mostly distributed internally by the enterprises themselves using MDM and Apple business manager. Some enterprise apps are used by a lot of employees. Like this, company directory app which allows you to easily search for your colleagues see their availability and quickly connect with them. Or this conference room app that can find the closest available conference room and allows you to book it with just one tap. Some are role-based, tailored to very discreet groups of employees.\n\nFor example this sales associate app has specific information and unique workflows that help sales associates with clienteling, task management, corporate communications and other workflows they need to do their job. And still others are part of a group of apps that seamlessly work together to create unique workflows that best support many different employee jobs. For example a sales associate app can work with a runner app which helps employees get stock from storage locations and make sure they get the right item in the fastest route possible. A product catalog app, that can be used by many different employees to view new product arrivals, inventory and availability, and these apps can share data seamlessly between each other enabling unique workflows and of course with single sign on, app groups and key chain, when you sign into one app you're automatically signed into the entire group of apps, reducing time to get things done. Something that all good enterprise apps have in common? They improve an employee's job.\n\nThese apps should reduce their workload and the amount of mental energy needed to accomplish a task rather than only being used to gather data for a business. This can be as simple as replacing a paper based workflow and as complex as helping a pilot fly a state of the art airplane. So now you have a better understanding of some of the characteristics of an enterprise app.\n\nI want to talk to you a little bit about some of the ways to identify which employees would be best served by these types of apps. As you know, not all employees are at their desk from 9:00 to 5:00. Some employees do the work on the go and at many different locations during the day. These mobile employees are often helped by apps that include way-finding, enabling them to easily navigate to their next job. This might even include how long it will take to get to their next job, especially when take into account traffic and weather conditions. Most enterprise apps allow people to work even when there's no network available. And with location services, these apps can vastly improve data accuracy and reporting. Power line maintenance technicians who work in very difficult and remote terrain have benefited from these apps. At times many miles from cell service. They replace their heavy cumbersome equipment with iPads, iPhones, and Apple Watches which reduce the amount of equipment they had to carry around. And the Apple Watch app enables them to do some workflows right from the wrist saving a lot of time and effort and improving overall work quality and employee satisfaction. And what about the parts of your business that are still run primarily on paper. Jobs with paper heavy processes are often ripe with app opportunities.\n\nOne industry that's experienced this paper to digital transformation was aviation.\n\nFor years airline pilots carried briefcases with reams of papers and documents containing all their flight information. After the invention of the iPad, some of the very first pilot apps enabled pilots to store thousands of charts and documents on an iPad instead of paper carried in their large briefcase.\n\nThese apps had huge impacts on all types of pilots, from international commercial pilots, all the way to flight instructors. The positive impacts of these apps was felt industry wide. Now some employees they carry around scanners, cameras, G.P.S. devices, measuring devices, audio and video recorders. These are all often great opportunities for an enterprise app. The iPhone and iPad are extremely sophisticated pieces of hardware. An insurance claim adjuster used to carry around a laptop, a voice recorder, a tape measure, a digital camera. With an app design specific for the workflow. Now they can do the majority of their work right on an iPad. Sometimes it's extremely helpful for an employee to action on something right away without the need to make a phone call, send an email or even launch an app. There are incredible opportunities for you to create simple but powerful workflows by customizing notifications. By using notification content extensions, you can create custom workflows that an employee can use right from within the notification, making some workflows as easy as a glance and a tap. When corporate pilots saw this they were ecstatic. This simple rich notification shows leg information and weather conditions and with a glance the pilots can easily know if they'd be home for dinner or if they'd be gone for a day or two. Not to mention what clothes they should pack, without the need to launch an app. they can quickly accept or decline new trip assignments right from this rich notification, and with notification extensions the company dispatchers know which pilots have received these notifications This is especially useful if your workforce is flying all around the globe and not always connected to a network And speaking of networks, with Wi-Fi Bluetooth and cellular networks you can create processes that allow multiple employees to collaborate effortlessly. With iPad inspectors can seamlessly work together deep in subway tunnels even without cellular connectivity using technologies like Bluetooth and I-Beacon. Teams can streamline inspections quickly, accessing information required to locate identify and complete inspections.\n\nThese are just a few of the examples of great opportunities for enterprise apps. Start looking for these opportunities in your own organization and allow the people doing the actual work to drive the process of design. Let's talk about that now. It's incredibly important to allow the employees who do the job to drive the design process and that usually starts with interviewing them and observing them in their jobs.\n\nTry to understand their pain points. The blockers that keep them from doing their best work. You should seek a diversity of input by interviewing an employee who's new to the role, a veteran employee, an employee somewhere in between. Bring these employees together and interview them at the same time. This way you give them the opportunity to dialogue about their different perspectives of the work they do. You then use these rich insights to inform the app you build. You'll find that the veteran employee may have their own work arounds based on years of experience and a new employee, they may have recently gone through employee training and they can share how the process is supposed to be done by the book and they'll point out where processes are difficult to learn and where an app might make it easier.\n\nYou might be encouraged to involve a manager, a director or a subject matter expert instead of the actual employees who do the job day in and day out. Instead prioritize direct experience and get the details from the people who actually fly the plane so to speak, rather than relying on the input from employees who can be more focused on the ideal or approved process rather than the realities of the job that needs to be done. This even includes those managers who used to be on the job for many years before they became a manager. Stick with the employees who, if they weren't talking to you would be doing the actual work. It's also very important to get a holistic understanding of the employees role. Have them talk about a standard day in their life. Have them discuss their entire day, not just the 9 to 5. Sometimes you'll find work gets done over their morning coffee. Including their entire day and your discussion enables you to find blockers that may not be obvious once they are on the job. This will help you understand what features go into this app and where other opportunities lie. You may even find you weren't solving their biggest pain points. We once started interviewing a sales associate for a new mobile point of sale app and during the course of that interview we discovered all their immediate needs were in clienteling, not the point of sale. This allowed us to pivot early and ultimately create an app with much greater impact. All right. So now you have a holistic understanding of the employees work and have confidence you've focused on the right problem. It's time to dive into the details. Understanding the exact steps in employees workflow and getting to the root of their challenges, is key to truly designing an app that improves their work. Be sure to qualify the response with the others who do the same job. For example you can say \"Hey Dan, what Rebecca just set about tracking mileage. Is that the same for you? Or do you track mileage differently?\". I want to talk about a few very important tips that can really have a positive impact on the information you get from your employees during these interviews.\n\nMake sure it's a safe place for open communication with no managers to influence their responses. You want the unvarnished truth. When an employee changes their answer to that of a manager or is watching their manager for validation, you can be assured you're not getting the whole truth.\n\nYou are there to gain insight and help improve their lives at work. Sometimes you might catch yourself subconsciously filling in the details as they tell you their story. Don't assume anything. Always ask for clarification when things seem vague. Hey, even ask for clarification if things seem obvious. You'll be surprised how much of what you infer ends up being way off the mark. And don't forget to constantly ask why. Continue to ask clarifying questions. Remember that the majority of employees will be stuck in what they want to fix in their current workflows today. And it isn't always easy for them to step back and look at the larger problem, or even recognize that there is a problem. Not to mention imagine a future state when they have the app.\n\nFor example think about how store managers may not be able to talk about a future state of shift scheduling until their sales associates are able to swap shifts in sales associate app. And the final and most important tip. You must always have empathy for the employees you interview. You are there to get all the information you need to solve their problems and allow them to drive the design process. Put yourself in their shoes and try your best to feel their pain. I once interviewed an employee for a large transportation company and he was so ecstatic to have an empathetic ear to talk to you. He said in his 30 plus years of working at that company this was the very first time he truly felt like his knowledge and experience was going to improve the work of his colleagues all around the world. That really hit home.\n\nSo what next. The fastest way to get an app in the hands of your employees is to optimize your design and development time. Developing and testing in Xcode is the fastest way to decrease time to a deployment. Apple provides you with very powerful tools in Xcode to build and test apps. Use these to streamline your development and testing activities and get the app in the hands of your employees as quickly as possible. Gone are the days of three year design and development cycles for a single gigantic app that tries to be everything to everyone. Small and focused and always evolving is the ticket to creating solutions that continually improve and adjust to changing roles.\n\nUsing standard views and controls can save you a lot of design and development time. And these design patterns are easily recognized and understood by Apple users. So the need for training and support is greatly reduced. This doesn't mean your app can't be beautiful or elegant. On the contrary it just means try to keep custom controls to a minimum so your users don't have to learn a whole bunch of new interactions or navigation paradigms when they first use your app. Next keep it focused. It's perfectly ok to create a focused app that delivers initial value for your employees and later grows to add many more features and workflows. Bottom line keep your app focused and always evolving. This is the best way to make sure your app is always useful to your employees. And please don't forget to leverage tools like TestFlight. TestFlight helps you beta test versions of your app and get constant feedback from your employees. Not only when you're building the first release but also when you start adding additional features and workflows. And remember your employees should be driving the design process. So continue to get feedback from them as you design and develop your app. Does this app solve their problems? If not continue to iterate until it does. If it does what can you do to make it even better. You'll quickly learn what features or apps to build next. This allows your organization to organically build product roadmaps and continually iterate apps to adjust to changing roles and responsibilities.\n\nRemember my earlier example about pilots using iPads to replace their paper charts and documents? Those same apps today, they are very sophisticated and some even use data from planes avionics systems to create custom real time procedures based on that information.\n\nIt's amazing how far these apps have evolved with constant feedback from the pilots that use them. Throughout this session, we've reviewed employee app characteristics and how they help your employees do their best work.\n\nFound key areas for app opportunities such as mobile employees and paper processes.\n\nWalk through the ways you can have your employees drive the design process to ensure your apps are impactful. And finally how to quickly build and release your app and then keep improving them over time. These learnings will help you on your journey designing and developing great custom apps for your employees. We can't wait to see what you come up with and please know the work you do. These apps you create, they can fundamentally improve the lives of your employees at work. Trust me I've seen it many times before and it's always inspiring.\n\nI wish you luck. Thank you.\nAnd have a great WWDC.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10222/7/8EB4D4CB-2C1F-43E4-B544-53CC7495139A/wwdc2020_10222_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10222/7/8EB4D4CB-2C1F-43E4-B544-53CC7495139A/wwdc2020_10222_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:27:38.889Z"
}