{
  "id": "10969",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10969/",
  "title": "A conversation with the cast and creators of Mythic Quest: Raven’s Banquet",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "DANA: I painted this one last - SPEAKER: I can't watch anymore TV. JO: If you don't think that the toilet paper industry started this, then you're f*****g crazy.\n\nPOPPY: Hello. IAN: There she is. Hey, Poppy. I waited for you. I waited for you this time in the meeting. POPPY: Nice one, mate. IAN: Looks like somebody did find that shower. POPPY: I wanted to look fancy. IAN: Did you wash your hair? POPPY: Yes, I washed my hair. IAN: All right. I'll keep my eye on it. POPPY: Okay. Okay. Alright, alright. Okay, okay, okay, okay. Fine. You know what I actually did - LOU: Guys? G*d d***it. Guys. F**k. Good. There. Jesus. Now, remember, this only works if we all do our part, okay? We get one shot at this so don't f**k it up, Rachel. No one can hear you. It's paradise. All right. It looks like we're ready at CW but Brad has a quick announcement. Whatever. Fine. Brad, go. BRAD: Yeah. Hey, everybody. So, I had this bet with David and well, he totally sandbagged and lost on purpose, but then we made the stakes really high and we played one final time and well, I still beat his a**. SPEAKER: Oh. David. SPEAKER: David, is that you? DANA: You look weird. SPEAKER: You look like an egg. DAVID: I know I look weird, okay. SUE: You look like a baby turtle. LOU: Wait, is that David or Sandy Duncan? DAVID: But it'll grow back in like eight or ten months. I don't know. Has anyone ever shaved their eyebrow? I don't know how long that takes. Does it grow back? Whatever. It doesn't matter. I just - I feel bad that I lost the $300,000 for charity. BRAD: I already donated it. DAVID: What? BRAD: Yeah, I was always going to donate it. DAVID: What? BRAD: Ian doubled it. IAN: Yo. DAVID: But why? I thought you were opposed to giving away money? BRAD: No, no, no. I told you I need to get something out of it which I did. Your dignity. That's $600,000 for charity. Way to go, David. SPEAKER: Way to go, David. SPEAKER: Good job, David.\n\nDAVID: Thanks, guys. SPEAKER: It all worked out, right? RACHEL: Actually, since we're all here, I think it would be really nice to - LOU: Oh, God. Here comes some boring SJW rant about - RACHEL: You know what? F**k you, Lou, okay. You're being such a d**k. Oh, s**t. I think I started it. IAN: Wait, what? LOU: Go. Go, go, go, go, go. Oh, s**t. It's working.\n\nDANA: Wait, where's CW? SPEAKER: Where is he? RACHEL: Come on, dude. BRAD: C-dubs. Come on. IAN: Come on, man. JO: Where is he? POPPY: Oh my God. IAN: Come on. JO: Come on. CW: Huzzah. LOU: Yes. CW: I made it. SPEAKER: C-dubs, you the man.\n\nCW: F**k you, coronavirus.\n\nROB MCELHENNEY: Hey there, everybody. Thank you for having a few of us from the Mythic Quest team here today in the all-new WWDC virtual world. Joining me are Charlotte Nicdao who plays Poppy. Imani Hakim who plays Dana. Danny Pudi who plays Brad. And Megan Ganz who is the co-creator and executive producer. Okay. Let's jump in with the first question. This comes from Michael from Phoenix, Arizona. Michael says Mythic Quest is absolutely my favorite show. That's a great start. That's a great start to this entire thing. BRAD: I'm loving this question. ROB MCELHENNEY: Mythic Quest is absolutely my favorite show centered on development. MEGAN GANZ: Oh. ROB MCELHENNEY: That seems a little bit more - that seems - MEGAN GANZ: We're the only one. We're the only one, so. ROB MCELHENNEY: Fine. We'll take it. Michael, we'll take it. It feels so true to life. I'm curious how many consultants you worked with on creating the scripts? Meg, you want to take that? MEGAN GANZ: Yeah. Well, our first and foremost, like, our partners in Mythic Quest are Ubisoft. So, we had constant communication with them. They were in the writers room with us. They were guiding the whole process, letting us know - introducing us to the world. On top of that, they also facilitated people from many different studios coming to visit us. We had programmers. We had a monetization expert. We had writers. We had all sorts of different people come in and talk to us. My favorite of all of those people was the first female coder we spoke with who was just as surly as I wanted her to be. She was suffering no fools and not mincing words about her experience and I absolutely loved every second of talking to her. ROB MCELHENNEY: That was a really fun experience because she seemed very upset. MEGAN GANZ: Yeah. ROB MCELHENNEY: She was very upset, I think mostly by the portrayal that she had seen of programmers on - on various television shows or movies that we had seen and she was like, you guys better get it right. So, I hope we got it right. Okay. This comes from Patricia from Oakland, California. I freaking love watching - I mean, two for two. Two for two. I freaking love - it's a good start. I freaking love watching the dysfunctional relationship between Poppy and Ian. It's honestly so validating to see conversations I witnessed over my career acted out on screen. As you were developing these characters, what's one thing that struck you as truly bizarro in tech culture? CHARLOTTE NICDAO: You know, one thing that did feel bizarre to me, especially with Ian and Poppy's relationship, is like, the - the fact that she literally builds everything and yet he's considered to be the genius. I enjoyed playing with that in their relationship. ROB MCELHENNEY: Okay. This is a question that comes from Valentin from Mössingen, Germany. As a fifteen-year-old that is heavily inspired by books, movies, and TV shows, what are some of your tips for getting into the business of storytelling, particularly through movies and TV shows? IMANI HAKIM: I would say no matter where you are in the world, to find your community, find people who are already involved in the space that you want to operate in, and read books. Study. Watch more movies like you're already doing. But I think mainly just find the community where you can learn and pick up new tools from people who are already involved in it. DANNY PUDI: I would say, yeah. Practice telling your story. I think that's really important. The more you work on telling your story or just storytelling in general, whether that's working on videos for your family or practicing jokes in the bathroom in front of your mirror, not that I do that. I have some friends who do that. But those things all help you hone in on your voice, so I think that's good. And then yeah, like what Imani said, is find your people. Find people who are working on aspects of storytelling that you're not, so writers, directors. Form a little crew and work together to help each other get better. ROB MCELHENNEY: Next question comes from Russia. All right. Ilya from Moscow, Russia. Lots of love from Russia. My question is, do any of the cast members have any coding experience at all in real life? Anybody? IMANI HAKIM: No. CHARLOTTE NICDAO: When I - when I got cast, I signed up to a - to a - like an online school, like free coding school called Code Academy, thinking like, I would, you know, just learn the basics and then I'd have like a kind of understanding that I could use in my portrayal of the character. And I think I tried to do one lesson before I was like, no. I can't do it. And I still get emails from them being like, pick up where you left off. And it makes me feel really guilty and really stupid. MEGAN GANZ: I learned the words server/client architecture. I don't know what it means but I know it's a thing that I think programmers care about. We - we need to get better about it because - because we have partners in Ubisoft, what we do is in the script, whenever there are moments where Poppy needs to describe what it is that she's actually doing, we just write the word haptics over and over because we heard that word once and we were like, oh, that sounds techy. So, we just write haptics, haptics, haptics and then the good people at Ubisoft go through the scripts and replace those with actual language that you might use. ROB MCELHENNEY: Okay. Oh, here's a question from Portugal. From Viseu, Portugal. This person's name is João. And they would like to know, which episode did you have the most fun filming? Imani, which episode did you have the most fun filming? IMANI HAKIM: Oh. I would say all of the episodes were really fun but I think the one that stands out to me the most obviously is the - the montage episode. Was that number two, I believe? Episode number two. Rachel and Dana, they have this fun montage and it was just really fun to shoot and it's one of my favorite memories. ROB MCELHENNEY: Hey, Danny. I have a question for you and it - and it hails from Melbourne, Australia. And yes, Charlotte, you'll get an opportunity to answer it as well. But I don't know. CHARLOTTE NICDAO: Melbourne. DANNY PUDI: Charlotte, you can take any Chicago questions from now on. CHARLOTTE NICDAO: Good. I've been studying up. ROB MCELHENNEY: If you were to create an app or a game, what would it be and why, asks Yuma from Melbourne, Australia. DANNY PUDI: One app that I actually use, I use this app which is a plant recognition app that I love and it is - literally I just ride my bike around the neighborhood and I take out my phone and I'm like, look at that tree. I wonder what kind of tree that is. And I like, snap a picture of it and they're like, oh, this is a pepper tree. I'll be like oh, wow. That's so cool. And that's super exciting for me. So, I think something dealing with like, plants or maybe how to successfully make plants live would be really kind of cool for me to do. ROB MCELHENNEY: Okay, so, Charlotte, it's clear that Danny blew that opportunity to take a question. So, we're going to - we're going to kick it to you, being from Melbourne, Australia. We'll ask it again. If you were to create an app or a game, what would it be and why? And how would it be different from Danny's plant app? CHARLOTTE NICDAO: Okay, see, I actually have an answer to this question. And it's going to - it's on record now that it's my idea so if anyone steals it, you know that it was me. It's a dating app but instead of like, answering questions about yourself, you get shown a series of memes. You decide which memes you think are funny and then you get matched with people who also find those memes funny. DANNY PUDI: Oh. CHARLOTTE NICDAO: And it's called - I'm trying to think of a pun on the fly. It's called You and Meme. ROB MCELHENNEY: That's pretty good. CHARLOTTE NICDAO: It'll have a better name than that. ROB MCELHENNEY: Okay, so, this comes from DJ from Ann Arbor, Michigan. What apps did you use to shoot the quarantine episode? I believe I can answer that. We used - for our camera app, we used something called Filmic Pro version 6.10.9 I believe. And it's just incredibly easy to use. But what you're seeing mixed with the hardware of the iPhone has created a professional grade look that you saw in the quarantine episode. And then the audio was - was an app called MOTIV Audio version 2.62.1 or something like that which would just be the most recent version. And again, it worked really seamlessly with the camera package. And a mic system - that hardware there was called Shure Mic MV88 Plus. And that worked really seamlessly with the hardware as well and - and really, that's - that's how we achieved 99.9% of the - of the technical elements of the show. So, that's the boring stuff. Now moving on. Well, it's Developers Conference so you kind of want the boring stuff. So, we'll mix it in a little bit. This is a question from Leonard from Singapore. Charlotte, is there a scene that you personally really liked? CHARLOTTE NICDAO: No. ROB MCELHENNEY: Great. Moving on. CHARLOTTE NICDAO: Yes. So many scenes. My top - my top scenes, I loved shooting the mocap stuff in the masked man episode with you, Rob. And I also loved - you know what? I'm realizing now all my favorite scenes are when I got to wear silly costumes because I also loved shooting at the streamer conference, pretty much anything where I got to wear that masked man costume and especially the scene where I was sitting in a beanbag. Like, I don't think I even had any lines in that scene. I just enjoyed sitting in that beanbag in my costume. ROB MCELHENNEY: The next question is from Henry from Kensington, Maryland. Danny, for the quarantine episode, you had to be your own lighting designer, audio team, camera person, et cetera. Which crew role did you turn out to be a natural at and which one not so much? DANNY PUDI: Great question. So, another app that I'm working on is the best place to take a picnic and it's designed to look at - ROB MCELHENNEY: Okay. Moving on. Thank you, Danny. Thank you, Danny, for that. Imani. IMANI HAKIM: Yes? ROB MCELHENNEY: For the quarantine episode, you had to be your own lighting designer, audio team, camera person, et cetera. Which crew role did you turn out to be a natural at and which one not so much? IMANI HAKIM: I would say I was - I was the most natural at maybe sound and the glam. I think because - I've had more practice at doing my own makeup so that came a little bit more natural. And the things that I wasn't the most natural at is for some reason we had to check our settings multiple times and it just - I couldn't remember. So, I applaud all of the DPs and all of the hard workers in the crew because it was - it was weird for me. ROB MCELHENNEY: Charlotte? CHARLOTTE NICDAO: I'm the opposite of Imani. I was absolutely the bane of our hair and makeup team's existence, I think. Even getting ready for this today was just a nightmare for them. I don't know why. I think - I was joking with Thea, our makeup artist, that my sister started doing makeup when she was a teenager so she's really good at it and I started doing makeup like since quarantine started and I had to start doing it myself for stuff like this. ROB MCELHENNEY: Imani, this is a question again from Australia and we're just not going to let Charlotte answer any of these. Jimmy in Sydney, Australia asks, you used multiple iPhones to shoot this, right? I'm curious on how to control all of them at the same time and how the director was able to see the shooting in progress in real-time. Imani, can you maybe just walk us through from your perspective, what it was like and how we - how we created the setup in which we could work? IMANI HAKIM: Yeah. So, Apple sent over a ton of equipment for the actors to use, from iPhones to sound equipment to lighting. And the way that we were able to have Rob direct the episode and see everything that's going on, we had - we had all the crew members and the actors in the scenes on Zoom where we would have our iPhones on this really cool contraption and it would - it would show the screen to the people in the Zoom and they were able to watch what we were doing through the iPhones. It's a lot but it worked really, really great. ROB MCELHENNEY: And from your perspective, one of the things I keep getting asked about was because also we were - we were communicating through AirPods, and a lot of - and we could barely see each other because even in the rig that we have setup right now, we can't really see each other because we're blocked by so many different things. And people were asking, what was it like to work with not only your other actors in a scene but also direct people? And I found that in some ways, it was a little bit more intimate because you're so - obviously as actors, we're trained to listen to what other people are saying and react to that. But oftentimes what happens is because of so much nonverbal communication, you're assuming what a person is going to say or you're feeling it before they even say it and it doesn't necessarily allow for you to listen to the extent that you could or should be. And when you're limited by not being able to see somebody but just hear them, it almost opens up another form of communication because you have to really pay attention to every word and to the tenor of their voice. Did - did all of you guys find something similar? IMANI HAKIM: Yeah. I think to your point, Rob, I think it - like you said, it really forces you to sort of drop in and be more connected than what - what you would usually be. Like, we're pretty - we're pretty connected on set but there was something about this where we know that we're counting on each other through the scene to get this story across, to get this scene across in a way with barriers that we've never experienced before. So, it's almost like it forces you to have this sense of camaraderie and community and to show up for each other in ways that you didn't necessarily expect. DANNY PUDI: Yeah. I would say also, it does make you listen a little bit more to the rhythm of scenes in terms of how lines are coming through. There is this sort of delicate balance of making sure that we're speaking in a way that is natural but also not overlapping too much, not - I think there was just a little bit of a worry on my part of sometimes the wi-fi signal not being super strong and worried that I either missed the end of the line or I jumped it. And so, there's this like, hyper listening but also just sort of like, almost like at times, I was just relying on sort of like an instinct of jumping in on a line just when I felt like I think this is the right time to say this line. But you're just hyper aware of people finishing thoughts, right? And so, that was kind of a really interesting game within the game. ROB MCELHENNEY: Great. Meg, this one comes from Tukwila, Washington. A gentleman named Rick wants to know what is the most valuable lesson you've learned about the industry? MEGAN GANZ: I would say like the presence of women in the video game industry. I - I had no - I kind of - I had no idea that there were such an equivalent amount of women playing video games and I guess you just don't hear about it and it feels like a lot, when I was growing up, the marketing was so directed towards men that I guess I always assumed that that was who was playing. And now, I'm being - my eyes are being opened to an entire world of women not only playing these games but also making them and - and Ashly Burch who plays Rachel on the show who is you know, heavily involved in the gaming community and has done voice overs for a lot of great games, has introduced me to a couple games that are just, I feel, a little bit more feminine oriented and that I just sort of didn't understand that there was that space in gaming. So, it's been a real delight. Also, just the narrative that modern games, like, their ability to tell complex and meaningful and deep stories. I mean, we - my husband and I are just playing The Last of Us 2 now and it is, I mean, breathtaking. Like, I can't play it before I go to bed because it has that much of an effect on me and I previously I guess, only thought that that was possible with movies and TV. So, that's been real eye opening. ROB MCELHENNEY: This hails from Charlotte, North Carolina which again, we will not allow Charlotte to answer. CHARLOTTE NICDAO: But - ROB MCELHENNEY: From Nick, the most unexpected response you've gotten from someone about the show. And I'm kidding. Charlotte, handle it. Go. CHARLOTTE NICDAO: Oh, I want to think about it though. Does anyone have an answer quicker than me? Wait, what was the question? I was just thinking about my name.\n\nDANNY PUDI: It's Charlotte. ROB MCELHENNEY: Your name is Charlotte. DANNY PUDI: It's Charlotte. ROB MCELHENNEY: Yeah. DANNY PUDI: It's always - right? It's always been? CHARLOTTE NICDAO: Yeah, yeah. DANNY PUDI: Still is. MEGAN GANZ: Danny, can you make an app for Charlotte that can remember her name for her so that she doesn't have to waste valuable time remembering what her name is? DANNY PUDI: Already on it. Name rememberer. Already on it. ROB MCELHENNEY: Okay. I'll repeat the question. Nick from Charlotte, North Carolina would like to know, what's the most unexpected response you've gotten from someone about the show? Anybody? Anybody not named Charlotte or named Charlotte? MEGAN GANZ: My mom really likes it which I wasn't necessarily expecting because the past shows that I've worked on, she usually says they talk too fast. That's her major complaint. And I feel like we talk pretty fast on the show but she still really likes it. She's never played video games and has no interest in them. So, I think she just likes CW and she's just showing up for that which is great. We'll take it. ROB MCELHENNEY: I think for - for me, I think it was - I believe it was the same day, I saw two tweets in support of the show, one from Elon Musk and one from Barry Jenkins. I thought that was a really great day for the show. CHARLOTTE NICDAO: Yeah. ROB MCELHENNEY: Okay. Megan Ganz, we have a question from Wilton, Connecticut. John Paul wants to know what was the most eye-opening slash surprising thing about shooting on iPhones? MEGAN GANZ: Oh, well, I had some experience shooting on iPhones before because I did an episode of Modern Family that was shot about half on iPhones and - ROB MCELHENNEY: We're not here to talk about your Emmy winning endeavors, okay? We're here to talk about your Apple show on Mythic Quest. So - Meg likes - Meg likes to bring up all of the shows she won Emmys for except for the ones that she works with me on. MEGAN GANZ: All of them. One. I - aside from that award-winning show, my experience, I mean, it's kind of incredible, the ease at which - the - how easy they are to use. I mean, I have zero idea of what I'm doing as a director of photography, even maybe less than I know about programming. And the fact that with just a few settings on the phone, we can produce footage that looks absolutely equivalent to the footage that we get from on set with the giant cameras is just phenomenal. You know, it's - it's really - has removed all barriers to the - to the filmmaking process. It's - if you would have told people thirty years ago that they would have gotten this kind of quality out of a phone that's in their pocket, they just would have never believed you. So, I mean, it was a fantastic experience for me. I am actually planning at the moment, of shooting some more stuff on iPhones that's not even - not even necessarily when we're in quarantine because I just was so pleased with the result. So, I encourage anybody that is thinking about making something, especially if you are looking at getting into the industry, I don't think you should wait to make your mistakes once you've gotten the job. I think you should start shooting things now, edit them together, see what they look like. Shoot it again. Reedit it. Like, see where your mistakes are because you'll be developing skills and making your mistakes when it doesn't count and then hopefully when you get the opportunity to make a cool episode like we did, you'll have gotten some of those mistakes out of your system. ROB MCELHENNEY: Okay. Well, that seems like a great place to finish up. Again, on behalf of the entire Mythic Quest team, thank you for having us at the WWDC this year. Have a great time. DANNY PUDI: Thank you. MEGAN GANZ: Bye. DANNY PUDI: Bye everyone. IMANI HAKIM: Happy Dub-Dub. >> CHARLOTTE NICDAO: Dub-Dub.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10969/4/8C4E91EB-B1EC-45EA-8964-ADA23A5C50A0/wwdc2020_10969_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10969/4/8C4E91EB-B1EC-45EA-8964-ADA23A5C50A0/wwdc2020_10969_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T10:28:06.904Z"
}