{
  "id": "10086",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10086/",
  "title": "Design for intelligence: Apps, evolved",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services",
    "App Store, Distribution & Marketing",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHi. My name's Mark Mikin, and I'm the Siri Experience Evangelist here at Apple.\n\nI know this is WWDC, but it wouldn't quite be WW if we didn't have a session about why you should build something in addition to all the awesome videos we've made about how to build it. And this is one of those \"why\" sessions. In particular, we want to talk about something we call system intelligence from a few different perspectives and over the course of a few videos. First we'll define it, and then I'll talk about how it relates to design and then how it's powered by extensibility.\n\nSo now let's explain what we mean when we say \"the intelligent system experience.\" You've probably heard terms at previous WWDCs like \"proactive,\" and being proactive is a key part of this.\n\nAnother piece of it is Siri, which is why I, the Siri Experience Evangelist, am here talking to you. So over the course of the next several videos, my colleagues at Apple, the ones that actually work on these technologies, will help me define just exactly what we mean when we say \"intelligent system experience\" and what you can do to be a part of that system.\n\nLet's get started with the most basic definition, which we'll build on throughout these videos. I found the simplest way to explain it is that it's how the operating system works with the apps that people use every day to make \"the everyday\" easier for people.\n\nAnd that's intelligence.\n\nNow, it's easy to view the features we place under this umbrella, like Voice and Siri Suggestions, as a convenience. It makes something easier, and you could keep doing it the hard way if you wanted, but that's not quite the right way to look at it. Intelligence should be viewed as a design practice. In fact, it's a design that's, in a way, alive. So let's talk about this concept of a living design. What do we mean by that? Well, ultimately, what's the core job of a designer? It's to help people accomplish something. And one of the key ways a designer enables this is by leveraging the familiar. Take this, for example: the \"share\" button.\n\nWhen someone using an app wants to share something, how is this capability conveyed to the person using the app? By using a signifier, or a symbol. In the case of iOS, someone can easily recognize this symbol because it consistently gets used across our apps and yours.\n\nIn other words, it's a platform convention. And guess what? Intelligence is a platform convention too.\n\nIt's something enabled and reinforced by its consistent appearance on the platform. But unlike other forms of design, intelligence isn't a static glyph or icon like the \"share\" button. It's alive.\n\nIt manifests itself by adapting to how the system, the platform, conforms to how people use their devices.\n\nNo two people's Siri Suggestions or conversations with Siri are alike.\n\nAnd what's needed or suggested can change at any second. The more we do that, with the help of your apps, the more people's expectations change.\n\nPeople expect their devices and the apps installed on them to be smart. And \"smart\" is clearly a loaded term, as is \"intelligence.\" We all know that people get frustrated when their expectations aren't met. When something doesn't feel as smart or as helpful as they think it should be, they don't care if it's the system or the app's fault. It just doesn't feel quite right.\n\nSo as an app developer, you have a big responsibility. After all, apps are a key piece of this story through something we call extensibility.\n\nBefore we go deeper on how intelligence is powered by an app through extensibility, let's first define what an app even is. The simplest way to look at it is that an app is an app icon, and when I tap on it, I get this awesome experience. When I swipe away, I close the app, and then I'm done. The next time I want to use that app, I tap on the app icon again, and I'm right back in.\n\nAnd for many people, that's still how they use an app today. But apps have actually been evolving over time, and that's something that we've been working toward for years.\n\nLike when we debuted the very first app extensions six years ago at WW 2014.\n\nAnd when we debuted SiriKit at WW 2016, we used that same foundation of app extensions to allow apps to work with Siri for the very first time. And then there were shortcuts, and now we have the new widgets and app clips. And it's not like we've been building a bunch of software features just to make the operating system better. A lot of the technologies that are foundational to the intelligent system were actually built to help our growing ecosystem of devices. Like with Handoff, which first started with iPad, iPhone and Mac, but was really crucial for enabling Apple Watch.\n\nAnd the next thing you know, we have this intelligent glue that ties together all of our devices and apps and the operating system to make everyday stuff easier for people. And this intelligent system we're building with your help is built from the ground up from a foundation of respecting your privacy.\n\nYou'll hear more about that later, but no intelligent system is worth sacrificing a fundamental human right for.\n\nNow, in the following videos, we'll try and cover system intelligence from a few different angles.\n\nFirst up, we'll expand on this common theme of how intelligence, paired with extensibility, allows for quick interactions that save people time.\n\nWe'll also walk through how we measure a successful intelligent interaction and how there's a measurable impact on the value people get out of your apps.\n\nThen we'll walk you through how, without even knowing it, people can benefit from intelligence features throughout their user journey to help people become more proficient at taking advantage of their phones and their apps. Sometimes even before they download an app.\n\nThen a few more of our colleagues will talk you through some of the underlying technologies that power it. There are three key concepts that are consistent throughout, and we'll show you how you can use just a few APIs to provide a lot of value to people.\n\nSo, without further ado, check out the next video, where my colleague JP will talk about the opportunity at hand.\n\nThanks for watching.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10086/3/F5DA137E-B1E5-4180-96CC-2D6680E5996E/wwdc2020_10086_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10086/3/F5DA137E-B1E5-4180-96CC-2D6680E5996E/wwdc2020_10086_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10194",
      "year": "2020",
      "title": "Add configuration and intelligence to your widgets",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10194"
    },
    {
      "id": "10197",
      "year": "2020",
      "title": "Broaden your reach with Siri Event Suggestions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10197"
    },
    {
      "id": "10190",
      "year": "2020",
      "title": "Create quick interactions with Shortcuts on watchOS",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10190"
    },
    {
      "id": "10074",
      "year": "2020",
      "title": "Decipher and deal with common Siri errors",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10074"
    },
    {
      "id": "10088",
      "year": "2020",
      "title": "Design for intelligence: Discover new opportunities",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10088"
    },
    {
      "id": "10087",
      "year": "2020",
      "title": "Design for intelligence: Make friends with \"The System\"",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10087"
    },
    {
      "id": "10200",
      "year": "2020",
      "title": "Design for intelligence: Meet people where they are",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10200"
    },
    {
      "id": "10060",
      "year": "2020",
      "title": "Design high quality Siri media interactions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10060"
    },
    {
      "id": "10073",
      "year": "2020",
      "title": "Empower your intents",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10073"
    },
    {
      "id": "10071",
      "year": "2020",
      "title": "Evaluate and optimize voice interaction for your app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10071"
    },
    {
      "id": "10061",
      "year": "2020",
      "title": "Expand your SiriKit Media Intents to more platforms",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10061"
    },
    {
      "id": "10084",
      "year": "2020",
      "title": "Feature your actions in the Shortcuts app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10084"
    },
    {
      "id": "10083",
      "year": "2020",
      "title": "Integrate your app with Wind Down",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10083"
    },
    {
      "id": "10068",
      "year": "2020",
      "title": "What's new in SiriKit and Shortcuts",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10068"
    }
  ],
  "extractedAt": "2025-07-18T09:16:16.948Z"
}