{
  "id": "10088",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10088/",
  "title": "Design for intelligence: Discover new opportunities",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services",
    "App Store, Distribution & Marketing",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHi. I'm JP Lacerda, and I work on the Proactive Intelligence team. An intelligent system experience is a collaboration between the operating system and your apps. It is a platform convention and a quality of great design. It's also powered in large part by extensibility. Let's talk about the huge opportunity that you have with intelligence.\n\nWe'll start by defining how we think about intelligence. Then we'll walk through the many intelligence entry points on the system. We'll conclude by talking about how you can measure the impact of intelligence on your app.\n\nSo let's define intelligence. The goal of intelligence is to make your Apple products feel like they know you.\n\nLike they understand you, your goals, your intentions, your habits, your preferences, your interests, and even your relationships.\n\nAnd they can use this understanding to help you achieve more by accelerating you to a goal that you already have in mind. And discover more by enriching your life with meaningful content, people, places and apps, delivered to you at just the right time.\n\nIntelligence helps you accomplish all this with less tedium by saving you clicks or taps to get to what you want, and also fewer distractions by helping you focus on what matters most. Ultimately, intelligence allows your Apple products to give you superpowers. As a developer, you play a crucial role in the creation of these superpowers.\n\nYour app can participate in intelligence by integrating with the system, which allows the system to see your app as much more than a monolithic container. The capabilities of your app extend to the system.\n\nAnd you get many more entry points into your app beyond the home screen when we make suggestions on your behalf.\n\nLet's walk through some examples of this, starting with Shortcuts.\n\nShortcuts lets you get things done with your apps with just a tap or by asking Siri. The Shortcuts app is built right into iOS, and allows you to set up simple or complex multi-step shortcuts and automations. You can run Shortcuts with your voice, and get relevant suggestions throughout the system, like in the new Siri Suggestions widget, in Search, and on the lock screen. New in iOS 14, if your app vends a widget, a Smart Stack will position your widget at the top of the stack at just the right time, like the Weather widget in this example.\n\nLet's look at other intelligence entry points, like Sharing. Our devices allow users to create beautiful content like photos and videos. Sharing Suggestions make it really easy to get content to the people in groups that matter the most to you. Intelligence also makes it easier to get information on your app to other parts of the system. Like with Siri Event Suggestions, you can get reservations from your app into Calendar.\n\nAll you have to do is book a reservation, like a restaurant reservation, and it'll automatically appear in Calendar, just like this.\n\nOn the lock screen, Siri can notify you when it's time to leave for your restaurant reservation based on current traffic conditions.\n\nWhen you open Maps, you get Siri Suggestions, which makes it super convenient to get directions to the airport, for example, with just one tap.\n\nSiri can proactively suggest turning on Do Not Disturb, so you can stay focused on what matters most, like the movie you're about to watch.\n\nAnd we may even provide a suggestion to check in for a flight, right on your lock screen. But how can we measure the impact of intelligence? Privacy is a fundamental human right, and at Apple, it's one of our core values. If you choose to opt in, we use analytics from your device to help us improve our products. The collected information does not identify you personally, and can be sent to Apple only with your explicit consent. Participating in intelligence is a great way to improve the traffic, utility and visibility of your app.\n\nFor example, when a user engages on their first Sharing Suggestion for your app, they will, on average, share twice as much as they did before through your app. We saw this trend across many apps that opted into Sharing Suggestions. Participating in intelligence can also be a great way to make your app more useful to your users. Some airlines shared with us that they saw 82% of notification check-ins come from their Siri Event Suggestion check-in action.\n\nIntelligence can also be a great way to increase the visibility of your app. Some third-party apps are seen, on average, five times every day on the lock screen, in Sharing, in Search, and other entry points throughout the system.\n\nSo, play your part in intelligence. You'll get more entry points into your app and help your users build superpowers. Here are some concrete ways you can do that.\n\nThink about which entry points would be best suited to your app's actions and adopt those that make sense. You should also consider how you will measure the impact of intelligence on your app.\n\nAnd finally, while this section covered your opportunity with intelligence as a developer, you can build an even more holistic view of intelligence by looking at it from your users' perspective and how they may string together these various experiences. To help you do this, in the \"Meet People Where They Are\" section, Radhika is going to take you through a day in the life of a user who benefits from intelligent system experiences.\n\nI hope you've enjoyed this session,\nand enjoy the rest of your WWDC.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10088/3/F305AEBE-F447-4B36-A540-FA6C33F70969/wwdc2020_10088_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10088/3/F305AEBE-F447-4B36-A540-FA6C33F70969/wwdc2020_10088_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10194",
      "year": "2020",
      "title": "Add configuration and intelligence to your widgets",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10194"
    },
    {
      "id": "10197",
      "year": "2020",
      "title": "Broaden your reach with Siri Event Suggestions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10197"
    },
    {
      "id": "10190",
      "year": "2020",
      "title": "Create quick interactions with Shortcuts on watchOS",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10190"
    },
    {
      "id": "10074",
      "year": "2020",
      "title": "Decipher and deal with common Siri errors",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10074"
    },
    {
      "id": "10086",
      "year": "2020",
      "title": "Design for intelligence: Apps, evolved",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10086"
    },
    {
      "id": "10087",
      "year": "2020",
      "title": "Design for intelligence: Make friends with \"The System\"",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10087"
    },
    {
      "id": "10200",
      "year": "2020",
      "title": "Design for intelligence: Meet people where they are",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10200"
    },
    {
      "id": "10060",
      "year": "2020",
      "title": "Design high quality Siri media interactions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10060"
    },
    {
      "id": "10073",
      "year": "2020",
      "title": "Empower your intents",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10073"
    },
    {
      "id": "10071",
      "year": "2020",
      "title": "Evaluate and optimize voice interaction for your app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10071"
    },
    {
      "id": "10061",
      "year": "2020",
      "title": "Expand your SiriKit Media Intents to more platforms",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10061"
    },
    {
      "id": "10084",
      "year": "2020",
      "title": "Feature your actions in the Shortcuts app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10084"
    },
    {
      "id": "10083",
      "year": "2020",
      "title": "Integrate your app with Wind Down",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10083"
    },
    {
      "id": "10068",
      "year": "2020",
      "title": "What's new in SiriKit and Shortcuts",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10068"
    }
  ],
  "extractedAt": "2025-07-18T09:17:18.032Z"
}