{
  "id": "10200",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10200/",
  "title": "Design for intelligence: Meet people where they are",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services",
    "App Store, Distribution & Marketing",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHi, my name is Radhika, and I work on the Proactive Intelligence team here at Apple. As JP just mentioned in the previous video, it's clear that the intelligent system experience provides a lot of value for the developer. Now, we'll look at how this benefits users.\n\nTo do this, let's walk through how system intelligence can actually help people, even before they download an app, and how it can help through every step of the way from someone who's just starting to use an app to becoming a power user.\n\nTo illustrate this, we'll use something relatable, like breaking up the workweek by doing some exercise. I'll tell this story from the perspective of someone that's just starting to learn how to take advantage of all the cool stuff on their phone. Let's say this person always works out with a friend.\n\nThat friend might text them with the address of a new gym they're going to today.\n\nAnd before they even type the address in Maps, there's a suggestion to get driving directions to that gym that's just a tap away right there in Maps.\n\nSo again, no gym app installed yet, but Maps is smart enough to pick up on the location of the gym from Messages. Pretty cool, right? Let's say she arrives with her friend at this gym and they decide they want to do a workout class together. They don't really know what classes are available at this gym, so they're looking for the gym's class schedule. Starting with iOS 14, there'll be an App Clip for that.\n\nShe could walk past the same reception desk every day, but this time, there could be an NFC tag for an App Clip at the register. By just holding her phone close to the tag, she could see the schedule just like it would appear in the gym's app but without needing to hunt down and download something.\n\nWhat's really cool is that if she finds this particular App Clip useful, there's a way to download the full app right there.\n\nNow, this imaginary gym rat has gone from going to the gym without an app to realizing how the App Clip can help her plan out her week. In fact, she might want to start picking the day she wants to go to the gym based on what classes are scheduled. So, she ends up downloading the app. Now, she's starting to plan ahead.\n\nDiscovering this app helped her solve a problem she didn't even know she had. Our new app user is now being far more proactive in building healthy habits and creating an intentional schedule. She's started planning out her week on Sunday mornings, which is a very responsible thing to do. In fact, she's gotten even faster at opening her apps by pulling down to reveal Search.\n\nAnd lo and behold, when she pulls down, even before she starts typing, the app is waiting for her right there in Siri Suggestions.\n\nThat's because Siri can actually learn and predict what app she wants to launch based on how she uses her phone.\n\nSo, she has the app on her device, and she's starting to use the various features within the app, like looking at the yoga schedule and finding new classes she can try out.\n\nShe's pretty familiar with the app, and can get to the information she needs most of the time.\n\nShe's really into yoga. So even though she has her week planned, she's always trying to squeeze in an extra yoga class. She usually checks the yoga schedule after work by going into the app, but recently, she's been using the timely shortcut suggestions.\n\nShe can jump right to the yoga schedule by tapping on it in Search. It ends up saving her a couple of steps, and most importantly, she can probably get in some extra yoga time.\n\nSo, our friend is now pretty accustomed with the app and is really loving her new gym routine. There have been some hiccups, though, so she's looking for ways to make things even easier for herself.\n\nShe ended up missing a group class recently because she didn't notice a schedule update. With a busy workweek, she didn't end up checking the app frequently enough.\n\nLuckily, this year, with the new widgets, there's an intelligent experience available right on her Home Screen.\n\nWith a few quick taps, she can create a Smart Stack with all her favorite widgets, including Mission Gym, and add it to her Home Screen.\n\nThanks to system intelligence, the stack will rotate automatically to show the most relevant and timely widget. So, in her case, if the class schedule changes, the stack will automatically rotate to the gym widget, giving her enough time to react to any changes. This way she'll never miss a class. More importantly, in the future, she can browse upcoming class times directly on her Home Screen by glancing at the widget and picking a time that works for her. If she wants to learn more, she can always tap on the widget to jump to the right place in the app. So instead of looking for the app and then navigating through it, she can find everything right on her Home Screen.\n\nOur friend has been working out pretty frequently now. She did notice, however, she has been repeating the same few things right before she works out. She always checks the bus schedule before starting the workout, and she uses the Mission Gym app to track her exercise. This is where Shortcuts is bound to come in handy.\n\nShe can set up a Shortcut automation that will run when she arrives at the gym. So when she gets there, she can see the bus schedule and start her workout.\n\nSo, as you can see through this user's journey, system intelligence can help people discover new apps and accelerate them every step of the way after that.\n\nBy leveraging these intelligence touch points, you can work with the system to deliver better, more holistic experience for your users at the right time and place. Now, I'm going to hand it over to my colleague Sufiyan who will talk about the underlying technologies that power all of these experiences. [chimes]",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10200/4/575ED5AA-73D9-48C4-904C-CC97FDE94A36/wwdc2020_10200_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10200/4/575ED5AA-73D9-48C4-904C-CC97FDE94A36/wwdc2020_10200_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10194",
      "year": "2020",
      "title": "Add configuration and intelligence to your widgets",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10194"
    },
    {
      "id": "10197",
      "year": "2020",
      "title": "Broaden your reach with Siri Event Suggestions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10197"
    },
    {
      "id": "10190",
      "year": "2020",
      "title": "Create quick interactions with Shortcuts on watchOS",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10190"
    },
    {
      "id": "10074",
      "year": "2020",
      "title": "Decipher and deal with common Siri errors",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10074"
    },
    {
      "id": "10086",
      "year": "2020",
      "title": "Design for intelligence: Apps, evolved",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10086"
    },
    {
      "id": "10088",
      "year": "2020",
      "title": "Design for intelligence: Discover new opportunities",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10088"
    },
    {
      "id": "10087",
      "year": "2020",
      "title": "Design for intelligence: Make friends with \"The System\"",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10087"
    },
    {
      "id": "10060",
      "year": "2020",
      "title": "Design high quality Siri media interactions",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10060"
    },
    {
      "id": "10073",
      "year": "2020",
      "title": "Empower your intents",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10073"
    },
    {
      "id": "10071",
      "year": "2020",
      "title": "Evaluate and optimize voice interaction for your app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10071"
    },
    {
      "id": "10061",
      "year": "2020",
      "title": "Expand your SiriKit Media Intents to more platforms",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10061"
    },
    {
      "id": "10084",
      "year": "2020",
      "title": "Feature your actions in the Shortcuts app",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10084"
    },
    {
      "id": "10083",
      "year": "2020",
      "title": "Integrate your app with Wind Down",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10083"
    },
    {
      "id": "10068",
      "year": "2020",
      "title": "What's new in SiriKit and Shortcuts",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10068"
    }
  ],
  "extractedAt": "2025-07-18T09:17:04.126Z"
}