{
  "id": "10162",
  "year": "2020",
  "url": "https://developer.apple.com/videos/play/wwdc2020/10162/",
  "title": "Design for location privacy",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello and welcome to WWDC.\n\nHey there. My name is Rachel, I'm a designer from Apple Maps, and I want to talk to you about location privacy. Today people share precise location data, like this, with many of the apps that they use. In iOS 14, Core Location gives people new control over their data by allowing them to share their approximate location instead.\n\nThis is a massive change.\n\nAnd it blew our minds. After all, our team designed Apple Maps entirely around precise location.\n\nIt's the focal point of the map, it's used throughout the app to find the most relevant search results and calculate arrival times and distances, and our navigation features depend on it. Location data is used everywhere, and apps of all kinds will be impacted by this change.\n\nJust here at Apple, Weather uses location data to provide live, nearby forecasts. Wallet uses location data to match transactions to places. And Photos uses location data to tag photos and create Memories. When our design team first heard about approximate location, it was really hard for us to imagine how Apple Maps could work without precise location data.\n\nFor those of you who are feeling similarly about your app right now, we want to share how we adapted Apple Maps to support approximate location, and in doing so improved on our approach to respecting people's data and privacy.\n\nWe hope that our experience might inform your work, no matter what kind of app you design. If this is the first you're hearing about approximate location, consider checking out these two talks, \"Building Trust Through Better Privacy,\" and \"What's New in Location,\" before continuing on.\n\nThree principles guided our team as we designed Apple Maps for location privacy.\n\nFirst, when designing for location privacy, prioritize user control. Give everyone control over the location data that they share and respect their preferences.\n\nOur design team made several changes in Apple Maps to ensure that the app works well for people no matter what kind of location data they share. The biggest change, and challenge, was annotating approximate location on the map.\n\nA pulsing blue dot represents precise location today. It is a very strong visual in our app and acts as a primary organizational element. We needed a different annotation to represent approximate data accurately, and to do so without impeding map functionality. So we designed a shaded, circular area to indicate approximate location. This new element both shares in the visual language of the blue dot, and adapts in styling to interaction, so as people zoom in, the overlay fades, to maintain cartographic legibility.\n\nThe design team also audited the app to identify where else we use precise location data, such as to calculate arrival times and distances, like here in Favorites.\n\nCalculating this data is not feasible with approximate location, and removing it from the user experience does not drastically impact functionality. We made small adjustments like this to Search and place details as well.\n\nSo, to prioritize user control in your app, don't require precise data to use your product. Allow people to do as much as possible while sharing approximate location.\n\nAnd for those people sharing approximate location, remove nonessential UI that requires precise data.\n\nSecond, when designing for location privacy, build trust through transparency. We all want to use data responsibly and to create great user experiences.\n\nCommunicate clearly with people about what data your app uses and how that data is used. In Maps, we invest in writing. Clear language, especially at important decision points, like here on first app launch, explains what data our app asks for and what value it provides. Clarity and accuracy will ensure that people have the right knowledge to make decisions about their location data.\n\nNext, communicate to people the result of their choices. For people who choose to share approximate location with Apple Maps, we added a status bar and control at the top of the map.\n\nWhen people first launch Maps, that status appears larger and stronger in visual treatment. This reminds them of past decisions and gives them direct access to control of the setting.\n\nOnce people show interest and interact elsewhere in the app, the visual treatment reduces in prominence.\n\nThis way, people still get the benefit of persistent transparency and control, without distracting from other functionality.\n\nSo, to build trust through transparency in your app, use clear writing to explain data usage and its value proposition. Remind people of what data they are sharing. They may be sharing location data with multiple apps.\n\nAnd make your app flexible so that people can change their experience as their needs change.\n\nFinally, when designing for location privacy, offer proportional value in exchange for the data shared. Some features will absolutely require precise location data, and that's okay. Limit requests for precise data to specific features that require it and connect your request to value in the user experience. In Apple Maps, turn-by-turn directions require precise location.\n\nSo when people indicate they want directions, we ask for one-time access to precise location. And we try to ask people as close to giving them directions as possible. For Apple Maps, this means that people sharing approximate location will still see all the same directions buttons, like this one in place details.\n\nWhen someone taps Directions they will be able to manually input their places of origin and destination.\n\nSince Maps needs precise location to auto-populate the place of origin, we add in a new option, called My Location, to the suggested places. This gives people the option to create a route from their precise location.\n\nWhen someone chooses My Location, then we ask for their precise data. This request is connected to people taking action, in this case, asking for directions, and is positioned close to when they will receive those directions, making clear the use and value of sharing precise location in this scenario.\n\nSo in order to offer proportional value in your app, only request precise location when the functionality requires it. Make your request in response to related action people take in your app, and position this request close to the functionality it powers.\n\nOur team found that designing for location privacy is very important and very possible. Just remember to prioritize user control, build trust through transparency, and offer proportional value. With this guidance, we were able to support approximate location in Apple Maps in a way that respected everyone's choices about data sharing and maintained an elegant experience. We hope these principles might come in handy as you develop support for approximate location in your apps.\n\nThanks for your time, and enjoy WWDC.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Human Interface Guidelines: Maps",
        "url": "https://developer.apple.com/design/human-interface-guidelines/maps"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10162/3/D6788D29-2A26-4A77-B69F-34F28F2044ED/wwdc2020_10162_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2020/10162/3/D6788D29-2A26-4A77-B69F-34F28F2044ED/wwdc2020_10162_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10140",
      "year": "2020",
      "title": "Build location-aware enterprise apps",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10140"
    },
    {
      "id": "10676",
      "year": "2020",
      "title": "Build trust through better privacy",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10676"
    },
    {
      "id": "10660",
      "year": "2020",
      "title": "What's new in location",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10660"
    }
  ],
  "extractedAt": "2025-07-18T09:37:49.402Z"
}