{
  "id": "10115",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/10115/",
  "title": "What's new in App Analytics",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi. My name is Mahesh Molakalapalli. I'm an engineering manager from the App Store team. In this session, I am excited to introduce you to the newly redesigned App Analytics and highlight a number of updates. Our goal with App Analytics is to maximize your opportunity on the App Store by providing unique insights. We do this by sharing metrics about your app across the entire App Store ecosystem without requiring you to add any code.\n\nToday, I will tell you four new ways that App Analytics gives you the data you need to grow your business. I will talk about the new metrics that allow you to monitor transactions better than before. Then I will show you how you can measure macOS usage, including for iPhone and iPad apps on Mac. After that, I will talk about how you can use data to analyze your App Clips performance. I will end with how you can enhance your presence on the App Store with Custom Product Pages, In-App Events, and Product Page Optimization. Let's start with monitoring store transactions. Later this year, we will be adding a lot of new metrics to App Analytics, helping you better understand transactions from pre-orders to total downloads. To help bring this data to life, I will be using my favorite test app, Mountain Climber. This app helps customers view livestreams of hikes at famous mountains so that people can enjoy the outdoors while staying at home. Let's pretend you are the developer of Mountain Climber, and you are about to launch your app for the very first time. Your app will be live-streaming a climb up Half Dome as your inaugural event, and you want to get as many people onto the app as you can in anticipation of the climb.\n\nIn order to generate that excitement, you set up a pre-order to drive people to your product page, as you want to make sure your customers have the app on day one. Later this year, App Analytics will let you monitor how your pre-order campaign is driving interest in your app with a brand-new pre-order dashboard. This dedicated dashboard will let you see how many Impressions, Product Page Views, and Pre-Orders you have. And you will be able to view your pre-orders by device and by source type. You can also view by territory. This will help you to see where your pre-orders are coming from and focus your marketing efforts on those areas.\n\nAnd on the Metrics tab, you will be able to see how your pre-orders are rolling in over time. It is common to see a large spike in the beginning when the pre-order is first launched. This is a good indication that some of your future customers are very excited about your app. When your pre-order is complete and your app becomes ready for sale, the dashboard will open up and show all of the metrics for your app. Once Mountain Climber goes live, it's time to see how many purchases you are getting. You are selling access to the Half Dome stream. And in this case, it costs $0.99 to have unlimited access to the climb. The proceeds from this transaction will be available in App Analytics.\n\nTo view your proceeds, click on the drop-down and select Proceeds. This will pull up the Proceeds chart so you can track it over time and see if your overall revenue is increasing.\n\nNow, let's say you have just released a new update to Mountain Climber, which you call version 1.1. And you want to see how many customers have updated to this latest version. Later this year, you will be able to go into App Analytics and see your app updates over time. The total number of updates tell you how many customers have your new app version, allowing them to take advantage of the new features you just rolled out. Next up, re-downloads. We know that customers might remove apps from their devices for different reasons, and it's important for you to understand when and how your app gets those customers back.\n\nSo later this year, we're excited to introduce re-downloads to App Analytics. You will be able to view re-downloads by territory, device, and more, so you can pinpoint where your re-downloads are coming from and adjust your re-engagement strategy to maximize your customer base. But it doesn't end there. We are going even further by providing total downloads as well. Total downloads represent first-time downloads plus re-downloads and will give you the most complete picture of how many customers are downloading your app from the store. Now that you know about all the ways you will be able to monitor your store transactions, let's talk about how you can use macOS to reach even more customers with your app. With the introduction of Mac with Apple Silicon, iPhone and iPad apps are now automatically available on the Mac with no additional code, which lets you reach more customers with your app. Now you can see how many customers are using your app on the Mac in App Analytics. By selecting the dimension drop-down at the top and clicking on Device, you can view data by device and see how many of your sessions are coming from MacOS, which falls under the Desktop category.\n\nHere we can see that there have been over 6 million sessions on Mac in the last 30 days.\n\nClicking on the metrics drop-down allows you to see a number of other new metrics for the Mac, including Installations, Active Devices, active in the last 30 days, Crashes, and Deletions. Let's take a look at crashes. Looking at the data, it looks like Mountain Climber has very few crashes on the desktop. Considering how many sessions the app has, this is a good sign that the app is stable and working as expected on Mac. Now you know how to measure your macOS usage even if your app wasn't originally built for the Mac. Next, let's talk about how you can analyze your App Clips. App Clips are a great way for customers to quickly access and experience what your app has to offer. Whether your customers are ordering take-out from a restaurant, renting a scooter, or setting up a new connected appliance for the first time, they will be able to start and finish an experience from your app in seconds, with App Clips. And now in App Analytics, you can learn all about how your customers are discovering and using your app clip. Let's take a look. On the Overview page, we have a dedicated ribbon to help you get a high-level understanding of how your app clips are performing by viewing Installations, Sessions, and Crashes for your clip. If you click on View Details, you will be taken to a more detailed Overview page for App Clips. Here, you can see how many Card Views your clip has. Cards are what pop up on the customer's phone to confirm that they want to open a clip.\n\nWe also show how many Sessions your clip has attracted as well as how many Crashes you have. Below that, we show you how many Installations your clip has and where those installations came from. The last part of the Overview page highlights the Top Territories where your app clip was found, which can be viewed by Card Views, Installations, and Sessions. As you can see, there are a ton of great ways to analyze your App Clips and see how your customers use them. Lastly, let's talk about how you can enhance your presence on the App Store. We have three new App Store features coming up in the fall that we are very excited about - Product Page Optimization, Custom Product Pages, and In-App Events. Each of these features is designed to help you acquire more customers through the App Store. Let's talk about how you can use App Analytics alongside each of these features. First, let's talk about Product Page Optimization. With this feature, you can set up and test different variants of your default page to determine which one best works with your App Store visitors. As part of this, App Analytics will be releasing a brand-new dashboard. The new dashboard helps you determine which variant results in the best conversion rate. We will also perform statistical analysis on the results using a Bayesian methodology allowing you to monitor the test over time. And you will also be able to stop the test at any time. With this feature, you can be sure that you are using your best icons, screenshots, and preview videos.\n\nNext, let's talk about Custom Product Pages. With this feature, you will be able to customize the content of your product pages and drive audience to the page you think will be the most relevant.\n\nThen in App Analytics, you will be able to view the results of each product page across multiple metrics, including product page views, downloads, conversion rate, proceeds, retention, and more. You can learn about both Product Page Optimization and Custom Product Pages in the session called \"Get ready to optimize your App Store product page.\" One more existing feature that we announced is In-App Events. This lets you promote app experiences happening within your apps on a particular date and time, such as a game competition, a live-streaming experience, and more. In App Analytics, you will be able to see how your event is performing on the store, including how many impressions your event had on the store, how many people asked to be notified when the event begins, how many customers downloaded the app from your event page, and how many app opens came from the event page on the store. All of this will help you understand which events are catching your customers' attention and making them excited about your app. You can learn more about In-App Events by viewing the session \"Meet In-App Events on the App Store.\" With that, I want to thank you for watching this presentation. To recap, the goal of App Analytics is to help you maximize your opportunity on the App Store by providing insights that only Apple can offer. Whether you're using In-App Events, Custom Product Pages, Product Page Optimization, App Clips, and more, App Analytics has you covered. Thank you. [upbeat music]",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "App Store Connect API",
        "url": "https://developer.apple.com/documentation/AppStoreConnectAPI"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10115/3/E7E6A158-C193-43E7-9C20-5CA614ED768E/downloads/wwdc2021-10115_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10115/3/E7E6A158-C193-43E7-9C20-5CA614ED768E/downloads/wwdc2021-10115_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10295",
      "year": "2021",
      "title": "Get ready to optimize your App Store product page",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10295"
    },
    {
      "id": "10171",
      "year": "2021",
      "title": "Meet in-app events on the App Store",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10171"
    },
    {
      "id": "10651",
      "year": "2020",
      "title": "What's new in App Store Connect",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10651"
    }
  ],
  "extractedAt": "2025-07-18T09:19:38.840Z"
}