{
  "id": "110142",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/110142/",
  "title": "Accessibility by design: An Apple Watch for everyone (ASL)",
  "speakers": [],
  "duration": "",
  "topics": [
    "Accessibility & Inclusion",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ So our goals have always been to build great accessibility into all of our products because many of us navigate our lives in different ways. At Apple, we like to think of accessibility touching four different broad categories-- vision, cognitive, motor, and hearing. And we look at all those segments and try to think about how they impact each product. Are we doing something in this area where we should have a different accommodation? Do we have something that we need a special assistive technology to provide a different way to interact with this device? How do we make the whole world accessible? Every day, we're thinking about accessibility. We care because they push the boundaries of the experience in a way that we can't imagine. If you can create not just a good accessibility experience, but a great accessibility experience, you'll have a fan for life. The Watch is a unique kind of computing platform. It's very personal. It touches your skin. It also has a long history of what its use is for, and what its functions are. To make it something accessible, you really wanna look at-- what is the product supposed to do? What is its core mission of what this is gonna bring value for? So when you look at that for the Watch, that's when we start to realize, like, all right, how do we make this more accessible for someone who's blind? What do we do for someone who's low-vision? And how do we do it on a CPU the size of a postage stamp? Apple developed this product, and the primary focus was to be able to read the time, and so the contrast with the black background with the legible letters was very important. Well, it turns out that was also important for low-vision users, and it's great for the person who needs that accessibility, but it also turns out to be useful for everyone else. So one of the great things about making a product accessible by design is that you do things that you may not think are necessary, and I'm reminded of a story of a woman that I met who had Usher syndrome. So she came to us and said, \"You know, what's really great about the Watch is that I can read the email on this really small screen because all my vision is focused in this central area. It's actually better than having a big screen.\" When you sort of invest in accessibility, you have to look at things from a different perspective, and so that often leads to features that become mainstream over time, and I think the Apple Watch is a great example of showing a lot of those things, from the large-type watch face which was designed for low-vision users but it's available for everybody. Part of the thing about making the Watch accessible is what is the primary function? One of those things was telling the time quickly, and sometimes discreetly, so that's where Taptic Time came into play, which is a feature that we have that allows a user to feel out the time using the haptics played back to them. When we were testing, one of the things that I noticed right away sort of walking around and using the device, if I was mobile, I had to take one hand off of my cane, stop, and then touch my device. And I thought, \"Well, that could be very dangerous, right?\" So one of the things I thought is, \"Man, it would be really great if I could -just raise my hand...\" - 1:04 p.m. - And hear the time, and then I don't have to stop or jeopardize my safety.\n\np.m. That's a very, very simple solution, but it solves a very, very important problem. But we've learned that there's more to accessibility than pure technology solutions. So the Mickey Mouse watch face, when it was introduced, I think it really surprised everybody, especially because it even had some really neat little features like Mickey's tapping his foot, but to a low-vision or blind audience, if I touched the watch, all I would get is a description, or maybe, perhaps, the time spoken by the same text-to-speech I hear everywhere else on the watch face, and that's just not good enough. I remember I was in a presentation, and I was sitting in the back row behind someone, and they were talking about the Mickey Mouse watch face, and I heard a woman in front of me say, \"Oh, I just really wish I could hear Mickey speak.\" And I turned to the engineer who was there with me. I said, \"We gotta do something about this.\" It's 9:41.  And we started to look into this. Why can't we just ask Disney to work with us to make some of these voices? Disney actually said, \"Yeah, let's work on this.\" Well, not only was it going to be recorded in English, but it was going to be recorded in more than 30 languages. Buongiorno! - - - The feedback after we demonstrated our prototype, it wasn't about is this going to be a great accessibility feature? What we actually got was \"Can everybody have this?\" Wow, okay! But the hardest question was figuring out how often should Mickey laugh?  - One. One is just not enough.  Three is not enough. No, we need all the laughs.\n\nBut for a sighted user using it, they may not want to hear that as much, so we ended with two different standards. When VoiceOver is on, Mickey laughs more often. When VoiceOver is not on, Mickey doesn't laugh quite as much. I remember reading to my kids at night, and they would reach over and just tap on the Mickey watch face over and over again to hear him speak. And those are really fun times. To work on something that, you know, is for one community, but it's so cool that it ends up affecting everybody. It's about bringing to light for a character that people have loved for nearly a century.  So one of the-- you know, the jobs of being a developer, and especially in accessibility, is to know the landscape of the technology so that you can use these things and solve the problems in new, unique ways. So oftentimes we hear these stories that people say they love their Watch, but it can be awkward to use, and that's because I don't have an arm or another hand to touch the watch with. When we started trying to meet this need for our users, we thought, \"Well, we have this very smart Watch, and it's on your wrist. So could we create a completely gesture-based human-to-computer interaction?\" And we started off with these more-- more sort of, like, gross gestures. Lift your arm. Twist your wrist. And we quickly learned that we needed the gesture that would expend the least amount of energy, and we started with just this pinch gesture, which is pretty low impact. And so we started to play around and say, \"Well, there's some signal here. What if we combine the accelerometer, the gyroscope, and some of those health sensors that detect heart rate, and use that to detect subtle muscle movements in your arm? Combine that together, put it into a machine-learning model to distinguish just these sort of very minute differences, and see what we got out of that.\" - We have a colleague who has low muscle tone in his arms, and so, he was instrumental in testing and really narrowing down the gestures. So we discovered that we can use, for simple gestures, pinch, double pinch, clench, and double clench for complete access to the Apple Watch.  ♪ ♪ Hey, I can't talk right now.\n\nI mean, this is the kind of stuff that you couldn't even imagine a few years ago. I mean, we're talking about real sci-fi kind of things right now. Apple Watch is uniquely suited to really meet this need for our users. The interface itself is designed for focused interactions. We worked really closely with our font designers to add a glyph language to SF Symbols that basically represents all of the hardware and software inputs of the Apple Watch. Then, you have an accelerometer. We can detect your blood flow. You have a gyroscope. So all of these sensors on the Watch allow us to detect even these very minuscule gestures. I can't wait to hear how this feature is a game-changer for people. I can't wait to see what developers are going to do with this new technology. So accessibility is incredibly important because it creates equity for the world. It allows people to be independent, to have a sense of control over their life, their environment, things they would like to do, passions they have. Accessibility is really about allowing more people to use your thing, that we're gonna make room that everybody can use it to the best of their abilities. So why wouldn't you want more people to use your product? Why wouldn't you want to make it better for everyone? To me, that sort of gets to the heart of why we get into this from the beginning. Why do we love programming so much and developing so much? It's so people can use our stuff. I wish developers knew that doing accessibility within their apps really provides a warm, comforting feeling for users. It's unexplainable. You work really hard on something, on an idea, on a concept, and then you see it come into place, and then, even better, you see how it impacts someone's life. And there's just no feeling like that. You just feel like the world is great again because you've solved the problem. [upbeat music]",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/110142/2/7A8BFD0C-E9CB-46D3-B598-2A8EEA5F89F0/downloads/wwdc2021-110142_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/110142/2/7A8BFD0C-E9CB-46D3-B598-2A8EEA5F89F0/downloads/wwdc2021-110142_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10308",
      "year": "2021",
      "title": "Accessibility by design: An Apple Watch for everyone",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10308"
    },
    {
      "id": "10323",
      "year": "2021",
      "title": "Wednesday@WWDC21",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10323"
    }
  ],
  "extractedAt": "2025-07-18T09:08:34.589Z"
}