{
  "id": "10120",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/10120/",
  "title": "Support Full Keyboard Access in your iOS app",
  "speakers": [],
  "duration": "",
  "topics": [
    "Accessibility & Inclusion"
  ],
  "hasTranscript": true,
  "hasCode": true,
  "transcript": {
    "fullText": "♪ Bass music playing ♪  ♪ Sommer Panage: Hi, my name is Sommer Panage.\n\nI'm excited to talk to you today about Full Keyboard Access on iOS.\n\nFull Keyboard Access is a feature for our customers with motor impairments.\n\nSo to begin today, I'll be giving you a quick overview of motor accessibility in general on iOS.\n\nAfter that, we'll take a closer look at Full Keyboard Access and all the power it brings users, particularly on iPad.\n\nAnd finally, we'll dive into key APIs and principles that you as a developer should be sure to keep in mind as you build your applications to be certain that they support keyboard users.\n\nNow, let's get started with a review of motor accessibility.\n\nWhen we discuss developing accessible apps for iOS, we want to keep all users in mind.\n\nWe often talk about accessibility in terms of VoiceOver, a technology for those who are blind or low vision.\n\nHowever, it's important to also make sure our software works for anyone with motor impairments as well.\n\nMotor impairment is a wide-ranging term and can impact how someone uses their iOS device in many ways.\n\nSome people may have a limited range of motion.\n\nOthers may have finer motor impairments such as tremors or other difficulties touching the screen.\n\nAnd depending on the severity of the motor impairment, many people find it easier or even necessary to interact with their devices via external hardware such as keyboards, joysticks, or buttons.\n\niOS provides numerous assistive technologies to help those with motor impairments have a seamless experience with their devices.\n\nFor example, we offer AssistiveTouch for people who might have some difficulty with hardware interactions or Multi-Touch gestures.\n\nAssistiveTouch uses an onscreen menu to simplify these interactions down to simple single taps.\n\nSwitch Control allows those with more limited motor abilities to interact with their iOS devices using one or more external switches or buttons.\n\nAnd of course, there's also Voice Control, which allows people to interact with their iOS devices using only their voice.\n\nAnd that brings us to one of our newest motor technologies, Full Keyboard Access.\n\nWhile iOS has offered support for keyboards since iOS 9, it's been a supplementary mode of input.\n\nWith Full Keyboard Access, released in iOS 13.4.1, customers can now interact with their device 100 percent via the keyboard.\n\nIt's a middle ground between AssistiveTouch and Switch Control for those who may not have enough dexterity to touch their screens but who also do not necessarily need or want to use external switches.\n\nIt also offers an alternative to Voice Control for those who may be nonverbal, have a speech impairment, or who simply might be in an environment where using Voice Control doesn't make sense.\n\nFull Keyboard Access is also great for those who depend on custom or accessible keyboard layouts such as a one-handed keyboard or this ergonomic split keyboard here.\n\nIn order for Full Keyboard Access to offer people a true iOS experience without the touchscreen, it provides numerous additions to basic keyboard input.\n\nFull Keyboard Access also has navigation commands so that users can get to every single element onscreen, interaction commands, and a Gesture mode for things like drag and drop.\n\nAnd all of these commands use Tab as the modifier key.\n\nHowever, they're also fully customizable for people who may prefer different key combos.\n\nSo let's take a look at how a user might navigate on their iPad using Full Keyboard Access.\n\nSo first, I can use the arrow keys to move to the Notes app and Space bar to activate.\n\nFrom there, I can Tab over to create a new note and then I can immediately edit.\n\nI think I'm going to take some notes about version two from one of my apps called Shape Shuffle.\n\nLet's make it great for iPad.\n\nWhen I'm done editing, I can use Control-Tab to get out of editing mode.\n\nNow if I want to delete an old note, I can use Tab-Z to bring up a list of actions.\n\nThen I can use arrow and Space to delete the note.\n\nNow, let's say I want to make one more new note.\n\nWell, I could Tab over to the Create Note button again, or I could use the Find feature by using Tab-F.\n\nThen I just type in \"new\", and there we go.\n\nSo now that you know all about Full Keyboard Access and how it's used, it's time to look into how you, as an app developer, can make sure that keyboard users have the best possible experience.\n\nIn 2020, I talked with you about Switch Control, and we worked on this fun game for kids to learn their shapes, colors, and numbers.\n\nTogether, we made this app accessible.\n\nThis year, I decided to rev Shape Shuffle for iPad so that we can make sure that it works great with Full Keyboard Access.\n\nIf you haven't seen Shape Shuffle yet, no worries.\n\nHere's a quick tour.\n\nIn each level, the player gets a prompt like the one we see here: Two Yellow Squares.\n\nThen they have to tap through the cards below to try to find the three required cards; in this case, a card with two objects, a square card, and a yellow card.\n\nOnce they've double-tapped each correct card, they can move on to the next level.\n\nAnd as the levels go up, the prompts get harder.\n\nIt looks like I just found two, so I can double-tap to add it to my board and continue searching for yellow and square.\n\nNow, if I'm not sure if the card is the right one or not, I can put a pin in it by long-pressing it so I know to come back later.\n\nI'll put a pin in these two in the bottom left.\n\nThen, when I return, I can make my final pick and beat the level.\n\nHm... I got it! Now let's start with our gameplay view to see how things work when I play another round but this time via my keyboard.\n\nSo as I hit Tab and Space bar, things seem to be working well.\n\nI can move between cards with Tab and flip them with Space.\n\nNow let's try to add or pin our triangle card.\n\nI'll hit Tab-Z to bring up my Actions menu, but I'm not seeing any actions available.\n\nNow, there are actually two ways we can address helping users to quickly get to common actions in our game, like add and pin.\n\nThe first way we can solve this is via a custom action.\n\nCustom actions are great because they translate across many assistive technologies.\n\nWhen you add custom actions to something, it will show up in VoiceOver, Switch Control, and Full Keyboard Access.\n\nCustom actions are what show up when you hit Tab-Z.\n\nAs you can see here, all I need to do is create a UIAccessibilityCustomAction for the actions I want to add, then go ahead and set those to my accessibilityCustomActions array on my cardView.\n\nAlso, it's always great to add an image.\n\nWhile these images won't show up for Full Keyboard Access, they will show up for Switch Control.\n\nHere's what my UI looks like with custom actions added.\n\nWhen I press Tab-Z, I see this nice popover letting me add the card or pin it.\n\nCustom actions are great for anyone using our accessibility features; however, there's another really cool approach that you can take here.\n\nYou can add a custom keyboard shortcut.\n\nThe nice thing with a custom keyboard shortcut is that it will work for both your Full Keyboard Access users as well as for those who are just using a keyboard with their device, but they don't have Full Keyboard Access turned on.\n\nIt's great for accessibility and power users alike.\n\nTo see a list of keyboard shortcuts, you just need to hold down the Command key.\n\nYou can learn all about keyboard shortcuts and much more for iPad in our talk this year, \"Take your iPad apps to the next level.\" Today, I'll show you a short example of how you can harness this API which was new in Mac Catalyst 13 and now brought to iOS and iPadOS 15.\n\nBy overriding buildMenu in your AppDelegate, you can set your key commands Here I create two UIKeyCommands; one for my add action and one for my pin action.\n\nI make sure to add a discoverability title as that's what will show up in my KeyCommand HUD when I hold down Command.\n\nNext, I create a new UI menu, which I name \"gameplay\", and I pass the new commands as \"children\".\n\nFinally, I insert the menu into my menu builder, and I'm done! Now, since I only want these items to be active in the HUD when I actually have a selected card, I also override canPerformAction on my GameViewController so that I only show these items when a card is actually selected.\n\nHere's what our game looks like when I hold down the Command key, and I have a card selected.\n\nAnd here, I want to highlight a key principle of developing for Full Keyboard Access.\n\nYou should try to add custom actions and keyboard shortcuts to all of your common actions to improve efficiency for your users.\n\nNot only are they both easily discoverable, but they improve the experience for anyone interacting with your app via a keyboard.\n\nLet's come back to our game.\n\nI've added the triangle with my new actions.\n\nNow I'll use Shift-Tab to go back toward the home button.\n\nHowever, as I'm doing that, I see another issue.\n\nThat triangle is selectable even though when I tap on it with Space bar nothing happens.\n\nSo first of all, why is our cursor going to this element if we can't interact with it? Well, I've already done some VoiceOver support work on this app, and here's what that looks like.\n\nYou'll see that I'm setting isAccessibilityElement to true on my items as well as giving it an accessibilityLabel.\n\nThis is great because VoiceOver needs to read each item to our user.\n\nHowever, if someone is a Full Keyboard Access user only, then their cursor will also go to many items marked with isAccessibilityElement.\n\nIn order to tell Full Keyboard Access to skip this element, we need to add one more line.\n\nHere, you can see that we set accessibilityResponds ToUserInteraction to false.\n\nThis tells our system that while this is an accessibility element, it's not one that the user can interact with.\n\nSo the cursor for motor technologies such as Full Keyboard Access or Switch Control should skip it.\n\nNote that accessibility RespondsToUserInteraction is only meaningful if isAccessibilityElement is already true.\n\nBy default, the system tries to correctly set elements with isAccessibilityElement true to interactive or not.\n\nIn most cases you'll only need to set accessibilityResponds ToUserInteraction to false when you have an object that you want to be accessible to VoiceOver but not to Full Keyboard Access or other motor technologies.\n\nThis brings us to a second key principle of developing for Full Keyboard Access.\n\nAs you're testing your app, you'll want to be sure that the cursor only goes to items that the user can interact with.\n\nNow, as you're building your app and making sure focus only goes to the right places, it might be tempting to override canBecomeFocused instead of the API that we just discussed.\n\nHowever, this overrides focus behavior for the whole focus engine and will impact people using Tab to navigate when Full Keyboard Access isn't even on.\n\nSo it's best to steer clear of this when only wanting to modify behavior for Full Keyboard Access users.\n\nIn fact, this brings up an important area.\n\nThe focus system that's used to drive Full Keyboard Access is the same one that drives Tab navigation across all of our OSs like iPadOS.\n\nWhile you likely won't need to touch it in order to work with Full Keyboard Access, if you'd like to learn more, I recommend these three talks.\n\nThis year we have two other talks called \"Focus on iPad keyboard navigation\" and \"Direct and reflect focus in SwiftUI.\" And back in 2017, there's a fantastic talk all about how the focus engine drives tvOS.\n\nNow, coming back to our home screen, I want to be sure that I can use Full Keyboard Access's awesome Find feature.\n\nSo let's give it a try.\n\nOK, the number levels work great out of the box.\n\nSearching for levels eight and twelve is easy.\n\nAnd because I've already added some VoiceOver support, I'm getting the Settings button, too, with Find.\n\nBut what happens if I don't know that the button is called Settings? Maybe I type in \"preferences\" or \"prefs.\" Hm. No luck.\n\nTo solve this, we can set an array of strings to our accessibilityUserInputLabels.\n\nHere, I'm setting the localized words for prefs, preferences, gear, and settings to this label to be sure that people can reach it no matter what they might type.\n\nBy adding these strings, you'll also be doing a favor to your Voice Control users, as they can now speak any of these names to tap your Settings button as well.\n\nOf course, this won't interfere with your VoiceOver label.\n\nSo now when you type in \"prefs\" it works great! And this brings me to our third and final principle today.\n\nMake sure that you always provide as many labels as you can for your image-based controls so your users can always get to them quickly with Find.\n\nNow, before we finish up, I want to do a little fun polish.\n\nSo let's take one more look at my home screen.\n\nSince all these items are UI buttons, Tab is moving to them naturally.\n\nAnd that's great.\n\nBut notice how my cursor is always a rectangle? To make things more playful, let's make it match the shapes of the buttons.\n\nTo show nice cursor shapes around our buttons, we can just use accessibilityPath -- the same accessibilityPath, in fact, that you'd use for VoiceOver.\n\nFor static views, you can set the accessibilityPath to that of the shape itself with a UIBezierPath.\n\nNotice that I'm setting the accessibilityPath in screen coordinates.\n\nIf you're in a scroll view, you'll want to override accessibilityPath so it's always correct relative to screen coordinates, even when you're scrolling.\n\nLet's take a look at how fun this bit of polish looks.\n\nNow as I Tab through, we can see circles, triangles, and squares.\n\nAnd it'll be the same with VoiceOver as well.\n\nWith that, let's review some of the key ideas to keep in mind when you're developing your app for keyboards, but particularly, for Full Keyboard Access.\n\nFirst, use custom actions and keyboard shortcuts to really go that extra mile, adding efficient means to navigate your apps.\n\nNext, make sure the cursor doesn't land on items that the user cannot actually interact with.\n\nAnd finally, be sure that you add user input labels, especially on image-based controls, so that people can take full advantage of Full Keyboard Access's Find feature.\n\nAnd that's everything! I hope that today you now understand the importance of motor accessibility in all of Apple's products.\n\nWhile there are numerous ways of interacting with our devices, the keyboard has become a powerful tool for our users.\n\nWith the information from this talk, you should now be able to be certain your apps provide an excellent experience to Full Keyboard Access users and to everyone.\n\nThank you and have an amazing WWDC 2021.\n\n♪",
    "segments": []
  },
  "codeExamples": [
    {
      "timestamp": "7:06",
      "title": "Accessibility custom actions",
      "language": "swift",
      "code": "// Accessibility custom actions\n\nlet addAction = UIAccessibilityCustomAction(\n    name: gameLocString(\"add\"), image: UIImage(systemName: \"plus.square\")) { _ in\n            self.addCard()\n            return true\n        }\n        \nlet pinAction = UIAccessibilityCustomAction(\n    name: gameLocString(\"pin\"), image: UIImage(systemName: \"pin.fill\")) { _ in\n            self.pinCard()\n            return true\n        }\n        \ncardView.accessibilityCustomActions = [addAction, pinAction]"
    },
    {
      "timestamp": "8:39",
      "title": "Keyboard shortcuts: buildMenu",
      "language": "swift",
      "code": "// Keyboard shortcuts\n\n// In AppDelegate.swift\noverride func buildMenu(with builder: UIMenuBuilder) {\n    super.buildMenu(with: builder)\n    guard builder.system == .main else {\n        return\n    }\n        \n    let pinCommand = UIKeyCommand(title: gameLocString(\"pin\"), image: UIImage(systemName:\n        \"pin.fill\"), action:#selector(GameViewController.pinFocusedCard), input: \"P\",\n        discoverabilityTitle:gameLocString(\"pin.card\"))      \n    let addCommand = UIKeyCommand(title: gameLocString(\"add\"), image: UIImage(systemName: \n        \"plus.square\"), action: #selector(GameViewController.addFocusedCard), input: \"A\",\n        discoverabilityTitle: gameLocString(\"add.card\"))\n    let identifier = UIMenu.Identifier(\"gameplay_menu\")\n    let menu = UIMenu.init(title: gameLocString(\"gameplay\"), image:  UIImage(systemName\n        \"rectangle.grid.3x2\"), identifier: identifier, children: [addCommand, pinCommand]);\n        \n    builder.insertSibling(menu, afterMenu: .view)\n}"
    },
    {
      "timestamp": "9:22",
      "title": "Keyboard shortcuts: canPerformAction",
      "language": "swift",
      "code": "// Keyboard shortcuts\n\n// In GameViewController.swift\noverride func canPerformAction(_ action: Selector, withSender sender: Any?) -> Bool {\n    if action == #selector(addFocusedCard) || action == #selector(pinFocusedCard) {\n        return self.focusedCard != .none\n    }\n    return super.canPerformAction(action, withSender: sender)\n}"
    },
    {
      "timestamp": "10:35",
      "title": "Accessibility elements",
      "language": "swift",
      "code": "itemView.isAccessibilityElement = true\nitemView.accessibilityLabel = gameLocString(for: item)"
    },
    {
      "timestamp": "11:01",
      "title": "Responding to user interaction",
      "language": "swift",
      "code": "itemView.accessibilityRespondsToUserInteraction = false"
    },
    {
      "timestamp": "13:41",
      "title": "Supporting accessible input",
      "language": "swift",
      "code": "self.accessibilityUserInputLabels = [\n    gameLocString(\"settings\"),\n    gameLocString(\"prefs\"),\n    gameLocString(\"preferences\"),\n    gameLocString(\"gear\")];"
    },
    {
      "timestamp": "14:52",
      "title": "Accessibility path",
      "language": "swift",
      "code": "// Accessibility path\n\nlet rect = circleLevelButton.convert(levelButton.bounds, to: nil)\n\ncircleLevelButton.accessibilityPath = UIBezierPath(ovalIn: rect)\n\n\n// If your button is in a scroll view, it’s generally better to\n// override accessibilityPath and/or accessibilityFrame\nextension CircleButton {\n    open override var accessibilityPath: UIBezierPath? {\n        get {\n            let rect = self.convert(self.bounds, to: nil)\n            return UIBezierPath(ovalIn: rect)\n        }\n        set {\n            // no-op\n        }\n    }\n}"
    }
  ],
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10120/11/284E99F6-0E62-4027-AE02-86A26EEBEC07/downloads/wwdc2021-10120_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10120/11/284E99F6-0E62-4027-AE02-86A26EEBEC07/downloads/wwdc2021-10120_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10153",
      "year": "2022",
      "title": "What's new in web accessibility",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10153"
    },
    {
      "id": "10023",
      "year": "2021",
      "title": "Direct and reflect focus in SwiftUI",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10023"
    },
    {
      "id": "10260",
      "year": "2021",
      "title": "Focus on iPad keyboard navigation",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10260"
    }
  ],
  "extractedAt": "2025-07-18T09:08:47.777Z"
}