{
  "id": "103",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/103/",
  "title": "WWDC21 Apple Design Awards",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ Design is one of the most challenging things that you can do in software. You have to identify the problem really well. ♪ ♪ Oh! Design can be certainly how something looks, but we are really preoccupied with how something works. App and game design enables our device to be what it is and what it can become in your hands. ♪ ♪ Designing an app or a game is actually quite an intimate experience. I need to empathize. I need to have some-- try and understand what your experience might be like using that thing. The person on the other side really can feel the attention and care that's been put into it, but the challenge there is simplifying it so that somebody can look at something and just, like, you know, understand immediately. Developers, the ones that figure out a way to achieve these things in their design are the ones that usually stand out. ♪ ♪ For us to celebrate the best of the best, those apps that were designed in such a way that are deserving of an Apple Design Award, you know, nothing is bigger in this community, in our community. It's always easy to remember the really big moments in life, and winning an Apple Design Award was definitely one of those moments that I'll never forget. I mean, I had to pinch myself, like, really hard to be assured that I'm not dreaming. Pretty much everyone that win Apple Design Award is somebody who has made something that I would use or play. It really gave the team a chance to pause and reflect and acknowledge all that we'd accomplished. It's elevated it to this other level where we've just got a lot more users, and we get a ton of feedback from people in all different countries. I can't say it's more like a dream come true because I-- this was beyond my dream and really can't express those things. This year with the Apple Design Awards, we're bringing back categories. There are six categories for the Apple Design Awards this year. -They're inclusivity. - Delight and fun. - Interaction. - Social impact. - Visuals and graphics. - And innovation. The thing that I love about what we're doing this year is that we're able to really zero in on some particular qualities that are really important and to talk about them directly. ♪ ♪ Apps and games are hugely powerful because they can create environments where, you know, all are welcome. ♪ ♪ Design is inherently about understanding and catering towards people, so this idea of inclusivity, it's not anything new, but it is just making sure that the goal is always to support more people, to enable more people. Well, obviously ethnicity and age and gender are some of the big ones, but all the time, we're finding more things that are personally important to people. Being inclusive and being diverse is being accepting of those categories and making sure that they're represented in a way that's equitable to the user. Apps and games that excel at inclusivity include as many people as possible in the experience. This can be done through localization with a ton of languages. It can be done by supporting a wide variety of accessibility features like voiceover and dynamic type. It can be something as simple as turning on reduced motion in a game so people with motion sensitivities can still have fun and experience the game fully. ♪ ♪ The winning app in the Inclusivity category is Voice Dream Reader. Voice Dream Reader makes it so easy to bring text to speech. Mr. Bennet was so odd. A mixture of quick parts, sarcastic humor, reserve, and caprice... It has probably one of the best implementations of voiceover that we have ever seen. It has a lot of text customization settings, so it can increase contrast or decrease contrast, space out lines, words, and highlight certain phrases within a written material to make it easy for people who may have low vision or dyslexia, and it's also localized into 26 different languages.\n\nThis year's winner in Inclusivity in games is \"HoloVista.\" \"HoloVista\" is a mixed reality game where you use the gyroscope to photograph these really beautiful 3D spaces. \"HoloVista\" has a pretty thorough set of accessibility controls that make it so that you can control text legibility, color legibility, motion sensitivity, and the way that you want to control the camera as you're panning around or not. This app has got some really great visual warnings about potential sensory and cognitive needs. It's also very good at presenting those controls and those warnings upfront. ♪ ♪ It's easy to know what it feels like to be delighted and to have fun. Putting it into words is a lot more difficult.  It's an interesting one because you can feel delight having an experience with a more serious app or game, or you can have delight and fun with, obviously, a game that's just fun to play. Delight and fun is when you use all of the tools at your disposal in an unexpected way. I think the reason that it's important is because it's really memorable for people. People understand that using the app that time kind of brightened up your day. They're gonna return to it and use it again and again and again. For a game, what really stands out in terms of delight and fun a lot of the time are these moments in the game. Maybe it's something that catches you by surprise and just creates this little moment of, like, \"Oh, I love that.\" People are seeking experiences where they can escape a lot of the time, things that might make you laugh, make you smile, and just have fun.  The winner for Delight and Fun for games is \"Little Orpheus.\" My mission was clear, to find Little Orpheus. \"Little Orpheus\" is just such a delight to play. And deep below the Earth's surface, prehistoric monsters still roam freely. There's these little moments in the game that just have to get you. Everything from the music-- the character's story is wonderful. It's like a Jules Verne novel come to life.  Perhaps Little Orpheus was not lost at all. This year's winner in the Delight and Fun category for apps is \"Pok Pok.\"  It is just the definition of a joyful experience.  The first time I played with this app, I honestly spent over an hour just fiddling with all of the different little sandbox toys, and I know it's meant to be designed for children, but it definitely brings out kind of this childlike wonder. The thing that I really loved about it was that this app came from a mother and father, them just wanting to build something that was delightful for their children. It puts a smile on everyone's faces when they use it, and it's just the clear winner here. ♪ ♪ If I poke you, there is a reaction, right? There's an action and reaction, and that dance is where interaction stands. Ooh, look, parallax. Interaction is all about how an app or a game works, how the user relates to it, how they make their way through the application and experience it. In our world, nothing's more critical. Interaction always has a result to what you do even if the result is letting you know nothing happened. Apps that stand out in the Interaction category are extraordinarily easy to use. They are kind of using the right methods of input, so whether that's keyboard or jester or pencil. If design can almost-- can get out of the way of someone's intention of what they are trying to do, that's almost where it's best design. You don't think about the app, or you don't think about roadblocks in the app, and you don't think about anything else really. It becomes invisible. When you're interacting with a game, and you are just seamlessly moving, and you're not thinking, \"I'm moving my left thumb up. I am moving my right thumb down.\" It's just--it is intuitive. You just understand what you're gonna need to do. You feel like you're at one with the device that you're holding, and it just becomes second nature.\n\nThe winner in the Interaction category for apps is CARROT Weather. I think the real magic of it is in the way that it manifests in the other places in my life that I need. CARROT Weather allows me to put a widget on the home screen. I can also go in, add-- oh, there's four faces. To add any one of these four faces, and just add it to my watch, and there it is. Can you show us? Yeah. What I love about CARROT Weather is just how much its personality infuses every part of the experience. Depending on your outlook on life, it's either partly cloudy or partly sunny. So if you do like your forecasts snarky, you can set it for snarky. If you want them a bit more professional, you can dial it down a little bit. And now all the way up. Okay. Well, there may be unprintable words in there, but we'll see.\n\nThe winner in the games category for Interaction is \"Bird Alone.\"  \"Bird Alone\" won the interaction category because it is so easy to use. You instantly know what you're doing when you launch the game. You know where to tap. You know where to swipe. I really like the balance between a story that's being told and then engaging me and asking me to do a task. So I just drew a picture of something that makes me happy. You're able to explore a little bit, and if you touch onscreen, you're given visual feedback. What's really unique is that it only asks you to interact with the game a little bit at a time. So you can only play for a little bit per day, which is such a different spin on what games typically are asking you to do. ♪ ♪ I think being a developer and being a creator in general, we have the responsibility of making sure that the things that we create, the tools that we make are helping make the world a better place. Social impact to me represents an awareness that we have a responsibility to do things for others in our community. I mean, I think a lot of people, hopefully, share that sense, This is when, like, technology is at its best-- when it's used to amplify people's voices and voices that are not often heard. I think there's lots of ideas still out there about how technology can impact social change. A couple ways that we think about social impact is does it improve lives in meaningful ways? Does it have lasting value or impact on the community as a whole? The winning app in the Social Impact category is Be My Eyes. Be My Eyes won because it's so clear the benefit that's being provided, that you're there as a volunteer at least. to help someone who can't see identify objects around them. There's just countless stories of humans helping humans that I think it just resonates deeply with us. This year, we saw several games take a really active approach toward social impact, which is not something we've seen in previous years, at least to the degree we've seen this year. The winner of the Social Impact category for games is \"Alba: a Wildlife Adventure.\" ♪ ♪ \"Alba: a Wildlife Adventure\" is just a tremendously charming game with incredible personality. It follows a young girl who's 11 years old who's trying to save this natural preserve as the city is trying to build a resort on top of the natural preserve. She learns to pick up trash in the local community, start a petition to help out the area. She takes pictures of wildlife and then repairs the signs around the natural preserve so that people begin to take interest in the natural preserve again. All of these things contribute to this incredibly charming, terrific experience. ♪ ♪ The visuals and the graphics are the front door into an experience. ♪ ♪ Visuals and graphics are at the core of design and at the core of communication, so as developers and as we as designers want to communicate, we do it through visuals. ♪ ♪ You haven't read anything, done anything, really interacted with it, but just through colors that you're seeing, the style of the icons, the choice of typeface, if it's a game, the quality of the graphics, the 3D models, how they're rendered, what the frame rate is. All of these things tell you so much about the experience that you're about to have.\n\nThe winning app in the category of Visuals and Graphics is Loóna ♪ ♪ Start with its tail and slowly color the dragon's body. Loóna is a app that helps you slow down, calm down, forget about things that are stressing you out, and just focus on coloring in a model while hearing a really nice story told by a really talented voice actor, and it just helps to relax and maybe help you fall asleep. Wonderful.\n\nThe winner for visuals and graphics for games is \"Genshin Impact.\" There's just so many things to see in this game. These huge, beautiful vistas looking out over the terrain or inside temples and seeing the special effects for the magic and combat encounters. The look of the characters themselves and how they have this anime quality to them that really fits the style of the game. Huh? Look at that! ♪ ♪ I've always seen innovation as the association of remote ideas, and they come together into something that is both familiar because they were already existing ideas but also something new because the combination has never been here before. It's not new for new's sake. It's not technology for technology's sake. It's a new way of solving an old problem. If you can remove friction from something and make it just a little bit easier, that is really innovative. The trick to, I think, fostering good ideas is this state of openness. Apps are not a monolith. They keep evolving with the world and with people. When I use an innovative app, my first reaction is \"This can't be possible,\" or, \"Why hasn't it always worked like this?\" The winner in the innovation category for apps is NaadSadhana.  What really distinguished it-- it's not only a music practicing app, but it's also a music improvisation app, and it's for Indian classical singing. Giving me real-time feedback about whether I'm hitting the notes or not. ♪ This is NaadSadhana ♪ ♪ It is the winning app ♪ I'm currently not hitting the notes. ♪ Hey, yeah, yeah ♪ That's definitely not on pitch. But it's also using the tone of your voice and the intensity of your singing voice to adapt the rhythm, so as you sing more intensely, the rhythm gets more intense. ♪ ♪ The winner in the innovation category for games is \"League of Legends: Wild Rift.\" It's an incredible achievement to bring the full-fledged \"League of Legends\" experience to Apple's platforms.  Yeah, wow.  The motion is very, very fluid. I love it. MOBAs--multiplayer online battle arenas-- are incredibly complex, and \"League of Legends\" has a lot of nuance within that category, and to be able to bring that to iOS and not only fit it on iPhone and the iPad but also be able to thrive on that platform is a terrific achievement. Oh, I was slain. All right, let's do this again.\n\nOne of the really challenging things is bringing the controls of a multiplayer online battle arena like \"League of Legends\" to a touchscreen and a smaller form factor like an iPhone. But they do a terrific job with customized controls. Really interesting things like being able to swipe an ability up to the corner to cancel it mid-battle, and it allows you to have all the nuanced gameplay you would expect from \"League of Legends\" on a touchscreen, which is terrific. Victory.\n\nTo anyone that's interested in being a developer, I would encourage you to find the things you're passionate about. Find a thing that you want to create. Try things. Try again. Have the courage to go down a path and turn round if it's not right. Being wrong, I think, is most of the process. Just accepting that is kind of hard at first, but, like, super freeing once you know that. I wish that somebody would tell me that this is gonna be a life journey.  I just wanted to say congratulations to all of the winners and thank you. I just want to thank you so much. Thank you so much. You know, when I won many years ago, it had a huge impact on me and my career, so I hope it does the same for you. Thank you for being out there elevating the human experience. And we're so happy that you put your hard work into the world. I'm not sure what the future holds for great apps and great games, but I am positive there's a developer who's already building it. ♪ ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/103/11/E4F0C677-1137-4FBD-B02B-11F849D6D6FA/downloads/wwdc2021-103_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/103/11/E4F0C677-1137-4FBD-B02B-11F849D6D6FA/downloads/wwdc2021-103_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10324",
      "year": "2021",
      "title": "Thursday@WWDC21",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10324"
    },
    {
      "id": "10323",
      "year": "2021",
      "title": "Wednesday@WWDC21",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10323"
    },
    {
      "id": "113",
      "year": "2021",
      "title": "WWDC21 Apple Design Awards (ASL)",
      "url": "https://developer.apple.com/videos/play/wwdc2021/113"
    }
  ],
  "extractedAt": "2025-07-18T10:26:22.075Z"
}