{
  "id": "10297",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/10297/",
  "title": "Manage devices with Apple Configurator",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing",
    "Business & Education"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ Bass music playing ♪  ♪ Pradhap Natarajan: Hello, and welcome to \"Manage Devices with Apple Configurator.\" I am Pradhap Natarajan, an engineer on the Device Management team here at Apple.\n\nToday, I am going to walk you through some exciting updates to Apple Configurator.\n\nConfigurator makes it easy to deploy iPad, iPhone, and Apple TV devices in your school or business.\n\nIt features a flexible device-centric design that enables you to configure one or dozens of devices quickly and easily.\n\nYou can inspect any device to see details like the serial number and hardware addresses, installed apps, and profiles.\n\nIn addition to apps and profiles, Configurator can also install books and software updates.\n\nBlueprints provide a great way to apply the same configuration to large numbers of devices with a single click.\n\nConfigurator also provides a rich set of automation tools, including a command line tool, an AppleScript library, and a suite of Automator actions.\n\nInitially, Configurator supported iOS and tvOS devices.\n\nBut recently, it has learned some new tricks for managing Mac computers as well.\n\nWe introduced the ability to restore and revive a Mac, beginning with models with the Apple T2 Security Chip.\n\nAnd last year, we brought those features to each Mac with Apple silicon.\n\nThere are two ways to use Configurator with a Mac.\n\nFirst, Restore is a great way to return a Mac with Apple silicon to service by reinstalling the latest macOS version.\n\nOn a Mac with the T2 chip, this action restores the firmware, after which macOS can be reinstalled using internet recovery.\n\nThe second is Revive.\n\nRevive helps you recover a Mac while preserving user data.\n\nOccasionally, things can go wrong.\n\nFor example, a MacBook Pro could run out of battery during a software update.\n\nIn these situations, a Mac with Apple silicon or a T2 chip can be revived which updates the firmware while preserving user data.\n\nTo return this Mac to service, select it in Configurator and choose Revive from the Advanced Actions menu.\n\nThis will bring the Mac back to life.\n\nIt is important to use the correct port on your MacBook Air with Apple silicon, or a Mac Mini, or a MacBook Pro.\n\nAnd note that the port is different on your MacBook Pro with the T2 Chip.\n\nLet’s recap Restore and Revive.\n\nTo prepare a Mac for a new user, use Restore.\n\nThis action restores the firmware and updates recoveryOS to the latest version and erases all user data.\n\nOn Apple silicon, this also reinstalls the latest version of macOS.\n\nIf you have a Mac that is unable to boot, use Revive.\n\nRevive updates the firmware and the recoveryOS to the latest version while preserving user data.\n\nAnd remember, it’s essential to use the correct port on your Mac when restoring or reviving it.\n\nFor more information on restoring a Mac, please refer to the Configurator user guide.\n\nConfigurator has served us well in helping to erase and restore iPhone, iPad, and Apple TV devices quickly.\n\nNow it can do the same for a Mac with Apple silicon or T2 chip.\n\nLet’s look at another way Configurator can be a lifesaver for organizations that need to manage lots of Mac computers.\n\nA Mac purchased directly from Apple, participating Apple authorized resellers, and cellular carriers can be assigned to your organization in Apple Business Manager or Apple School Manager.\n\nAnd having the Mac assigned to your organization provides access to some key device management features.\n\nFor example, automated device enrollment enables your users to enroll in your organization’s MDM solution with the flow integrated right into Setup Assistant in macOS.\n\nAlso Automated Device Enrollment paired with AutoAdvance enables a completely touch-free configuration solution for Mac computers by just connecting to power and ethernet.\n\nThe Mac is enrolled in your MDM Server, automatically configured to your specifications, and left ready for use in your organization.\n\nBut if the Mac wasn’t purchased through one of Apple’s supported channels and not assigned to your organization, you cannot take advantage of these great features.\n\nConfigurator has long provided a way to assign iPhone, iPad, and Apple TV devices to your organization in Apple Business Manager or Apple School Manager, even if they were not purchased through an official channel.\n\nYet, Configurator hasn’t provided a way to assign a Mac purchased outside an official channel, until now.\n\nToday, I am very excited to introduce Apple Configurator for iPhone.\n\nThis new app makes it easy to assign a Mac to your organization.\n\nIt works like magic! Assign one Mac -- or 100 -- without a cable, using your iPhone’s camera.\n\nAll you need to do to perform this critical task is sign in with a Managed Apple ID and point your iPhone’s camera at an image in Setup Assistant on a Mac.\n\nThe Managed Apple ID must have at least the device enrollment manager role in your organization.\n\nLet me walk you through how it works.\n\nThe app has just two main buttons.\n\nThe first button is Settings.\n\nIt allows you to choose the network configuration the Mac should use to connect to Wi-Fi, if it is not already connected over Ethernet.\n\nThe easiest option is to share the current Wi-Fi network that your iPhone is connected to.\n\nHowever, not all networks are shareable.\n\nIf you need the Mac to connect to a network that is not shareable, you can choose a configuration profile with the Wi-Fi payload that the Mac should use.\n\nTo assign a Mac to your organization, simply start up the Mac and select the language.\n\nWhen the Mac asks you to select your country or region, bring the iPhone running Configurator near the Mac, wait for the animation to appear on the Mac, then center the animation in the viewfinder of iPhone’s camera.\n\nWait for the message that says “Paired Successfully”.\n\nBoom! That’s it.\n\nOnce paired, Configurator sends all the required information to the Mac to assign itself to your organization.\n\nThe other button allows you to view the status of each assigned Mac.\n\nStatus provides a report of nearby Mac computers that you can assign to your organization and the ones that have already been assigned.\n\nOnce the Mac is assigned to your organization, the next step is to configure automated device enrollment settings.\n\nTo do this, sign into Apple Business Manager or Apple School Manager, move the newly assigned Mac from the Apple Configurator 2 MDM server to the MDM server that will deliver the correct automated device enrollment settings.\n\nThe next time the Mac restarts, it will download its new enrollment settings and enroll itself into the selected MDM server, configuring itself according to the settings you specified.\n\nNow, it is ready for use by an employee or a student in your organization.\n\nNote that a Mac assigned using this feature will be released from your organization if the user unenrolls from MDM during a 30-day provisional period, just like iOS.\n\nConfigurator for iPhone makes it easy to assign any Mac to your organization in Apple Business Manager or Apple School Manager so that you can take advantage of all the great device management features that automated device enrollment enables.\n\nAs a program member, you'll be able to download the app at AppleSeed for IT.\n\nAlternatively, you will be able to request access via TestFlight on the Apple Developer website.\n\nApple Configurator for iPhone beta requires iOS 15 and can assign Mac computers running macOS Monterey.\n\nMake sure to file your feedback using Feedback Assistant.\n\nApple Configurator for iPhone will be available in the App Store this fall.\n\nEnjoy WWDC 2021.\n\nThank you.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10297/5/42EFFB92-E098-4A61-AC2C-F645C909C1EE/downloads/wwdc2021-10297_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10297/5/42EFFB92-E098-4A61-AC2C-F645C909C1EE/downloads/wwdc2021-10297_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10045",
      "year": "2022",
      "title": "What's new in managing Apple devices",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10045"
    },
    {
      "id": "10130",
      "year": "2021",
      "title": "What’s new in managing Apple devices",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10130"
    }
  ],
  "extractedAt": "2025-07-18T09:20:13.671Z"
}