{
  "id": "10316",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/10316/",
  "title": "Meditation for fidgety skeptics",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ My name is Dan Harris. I'm a longtime --that's my way of saying I'm old-- longtime correspondent and anchorman with \"ABC News.\" I've worked at \"ABC News\" for 21 years. And then about seven years ago, I wrote a book called \"Ten Percent Happier,\" which was about how a skeptical journalist came to embrace meditation. For me, the whole thing started with a panic attack, a very public panic attack on \"Good Morning America.\" Even more embarrassing than having a panic attack on national television was what caused the panic attack. I think at the root of that meltdown was something that everybody who is part of this conference has, which is ambition. I arrived at \"ABC News\" at the big leagues, the network, at the tender age of 28 years old, and I was really anxious about being so young and being so inexperienced, and I just threw myself into my work in a really, really sort of workaholic-style way. And shortly after I arrived at \"ABC News,\" there was a huge event in the news, and that was 9/11. And I kind of raised my hand after 9/11 to volunteer to go overseas to cover whatever was gonna happen next, and I spent many years in war zones like Afghanistan and Israel, the West Bank, Gaza, a lot of time in Iraq… six or seven long stays in Iraq. And I came home in the middle of this period, and I got depressed, although I didn't actually know I was depressed, and I did something extremely stupid at this point, which is I started to self-medicate with recreational drugs. And even though my drug use, primarily cocaine, was pretty limited and I was never high on the air, after I went to-- after the panic attack, I went to go see a doctor, and he asked me a bunch of questions. And one of the questions was, \"Do you do drugs?\" And I kind of sheepishly said, \"Yeah, I do.\" And he gave me a look that indicated, \"OK, moron. Mystery solved.\" And he pointed out that even though the drug use was somewhat unspectacular, it was enough to change my brain chemistry and make it more likely for me to freak out. So this was a huge ‘Aha!’ moment for me, and I decided to quit doing drugs and to go see this shrink once or twice a week indefinitely. I started to poke around and realized that there was a lot of evidence that suggested that meditation was really good for you, that it could lower your blood pressure, boost your immune system, literally rewire key parts of your brain. And there was at this time a not very well-publicized body of research that strongly suggested that meditation was really good for you, so I started to try it, and I started with, like, five or ten minutes a day. And I found that there were really three main benefits.\n\nThe first benefit is that it made me calmer. Now, I want to be careful about this word, \"calm.\" Because some people sit and meditate, and they expect to feel calm immediately and that if they don't, they feel like they're a failed meditator. That's not quite how it works. Just because you sit to meditate, you are not necessarily going to get calm lickety-split. But the cumulative effect of taking myself out of the traffic for five minutes every day just injected my overall life with a little bit more calm and sanity. The second benefit is that it helped me with focus.\n\nAs you'll see in a minute, meditation, the practice of meditation is generally where you just try to pick one thing to pay attention to, usually the feeling of your breath coming in or going out, and then every time you get distracted, you start again and again and again. And every time you do that, it's like a bicep curl for your brain. And this has been shown on brain scans to change the area of the brain associated with attention regulation, and I really found that in my hectic life where I actually have other people's voices piped directly into my head as a news anchor, it really helped me… meditation… it really helped me to stay on task. The third benefit is the most important one, and it's a word that is thrown around a lot these days. It's become somewhat of a buzz phrase, and it's mindfulness.\n\nMindfulness is, just to put it very simply, it's the skill that allows you to notice what's happening in your head at any given moment without getting carried away by it. I'm just going to--I'm just going to say that again because this is really the most important point. Mindfulness is the ability, the kind of self-awareness that allows you to notice what's happening in your body and in your mind without necessarily taking the bait and acting on it. So, for example, I would notice that I would be in a conversation with my wife, maybe things weren't going well. I would notice, \"Oh, yeah, I'm starting to get angry,\" but I don't have to say something that's gonna ruin the next 48 hours of my life. Or maybe I'm bored or lonely and I see a zombie arm reaching into the cabinet and aiming to scarf a sleeve of Oreos, but I would notice the urge and, instead of acting on it reflexively, I would be able to respond wisely. And that was really-- it doesn't work all the time, which is why I call my book \"Ten Percent Happier,\" but when it does work, it's a game changer, and it is a skill that you can improve over time.\n\nSo as advertised at the beginning of this talk, I want to bring in somebody who's a genuine meditation expert to talk a little bit more about how we can apply these skills now and how we can boot up a habit because habit change is often very, very tricky.\n\nMy friend's name is Jeff Warren. He's a meditation teacher based in Toronto. He and I wrote a book together a few years ago called \"Meditation for Fidgety Skeptics,” and as part of that book, we traveled all across the United States of America in a bus. So let me just show you a little clip of that and then I'll bring in Jeff on the backside. ♪ ♪ ♪ ♪ Good times. Jeffrey, are you there? Can you hear me? I'm here, Dan. It's good to see you. Always good for me to hear your story of public humiliation.  Yes, Jeff has meditated for many years to develop a highly valuable skill called schadenfreude, which I recommend to everybody. Apparently compassion is supposed to emerge spontaneously at some point. I'm still waiting for it.\n\nJeff, it's really great to see you. Let me just ask you. I'm assuming-- you know, we wrote a book called \"Meditation for Fidgety Skeptics.\" I'm assuming there are some fidgety skeptics in this audience, so, yes, I just said everything about all that meditation has done for me, but let me just hear from you. If somebody's watching this and thinking, \"Why should I do this? What's in it for me?\" How do you answer that question? How about emancipation? I would say that's probably-- for me, it's been sanity, and it's been a sense of more control in my life. More control over my-- how I respond to the world and not being a victim to every impulse and whim and emotion and mood that picks me up and takes me around, which they do a lot. So it's been--it's kind of, like, given me my life back. So--not all at once. It's kind of a progressive thing, but there's no question that's been the big effect, and then the roll-on effect from that is when you're more centered in your life, you're more available for everyone else. So my relationships, yeah, they've gotten better — my friendships, my family relationships — I mean, the roll-on effects are quite significant. So how's that for a start? You and I are meditation nerds. I mean, unreconstructed meditation nerds, and I think appropriately based on scientific evidence and the evidence of our own minds, we are focused on getting people thinking about meditation. And I do, though, want to say that I kind of put meditation in what I call a pantheon of no-brainers when it comes to taking care of yourself so that you can be maximally effective, and I think there are probably at least five other things I would put in this pantheon. So start with meditation, but I would also add sleep, which is incredibly important. Exercise, healthy eating-- without getting too obsessive about it, so I think it's important to eat healthy but not to the point where you're obsessing about what you're eating all the time. The fourth thing I would say is nature, access to nature. There's a ton of data that strongly indicate that if you are getting consistent access to nature that it's going to have all sorts of physiological and psychological benefits. And then finally, and I mentioned this a little bit earlier, but I think it bears repeating. The quality of your relationships-- now I'm stealing a quote from somebody else, so I'll own that in the middle of this quote. \"The quality of your relationships will dictate the quality of your life.\" That's a quote from Esther Perel who's a legendary couples counselor and podcaster. And, you know, it's so true as to be a truism in some ways, this notion that relationships matter. We are a social species. The reason why, for better or worse, humans took over the planet is not because we were the strongest. It was because we could work together to take down the mastodon or whatever it was, so this need for social connection is, you know, just baked into the motherboard for us, and that was my attempt to use some sort of vaguely technological language. I don't even know if that was appropriate, but, anyway, it's baked into our DNA and so-- but it's easily overlooked at a time-- especially in the West when there's such an emphasis on individual achievement and we tend to live away from our families — and the number of people who say they have close confidants has declined over time — and many of us have our nose in screens all the time — that there's a way in which we can deemphasize the value of relationships — and we have just run a global unregulated experiment in what happens when you deny social connection, and the results are really clear… massive spikes in anxiety, depression, addiction, and suicide. Oh, my God, absolutely. I think something that a lot of people are struggling with now after this long period of lockdown, which, for many of us, is not over — in some parts of the world, we're emerging from lockdown — in some parts of the world, we're really still in it — but social anxiety is a real issue. It was a real issue going into the pandemic and I would imagine even more so now. Do you have any thoughts about how to manage that? I would say a couple things. The first is a seated practice of five or ten minutes of just getting relaxed will center you and make you--and, you know, help you manage that anxiety a little bit more. I mean, that's just a kind of a no-brainer from my perspective. Another thing is to get clear about what is actually making you anxious and share that with the people that you need to hang out with. So this is, again, where the mindfulness thing can be useful. You know, we may have a specific anxiety 'cause, you know, you have some friends that want to suddenly abandon the masks and start hugging way sooner than you're ready to do it, or you're worried about the-- you have specific anxieties about travel or you're-- whatever it is, like, you have a specific anxiety, but until you actually look and notice what it is, that thing will own you in a kind of a vague, generalized way. You'll just know you don't really want to go outside around people. You won't really have a good excuse for what it is, or you can't really--you know, you're just--because you haven't brought clarity to what's actually going on in your experience. So taking the time to really identify, what is it that I'm worried about? Can I--what is the specific thing? And then, based on that, having conversations with the people in your life around--if there's any protocols you might be able to collectively agree on. I mean, that's--it may sound so common-sense, but I think this is, again, the great move of practice, the great move of mindfulness is to begin to actually clarify what's really going on in your experience, and we may hear that and think, \"Oh, yeah, that makes sense.\" But we don't realize that we're subject to this kind of unconscious thing all the time, that we're not actually doing that. We don't have a lot of clarity about what would actually help us. People may be wondering, \"OK, how do I do this? How do I start meditating?\" And often, the question people have is, \"What's the least amount I can do and get all of the advertised benefits?\" What's your recommendation for folks who are trying to boot up a habit? - Five minutes, ten minutes? I mean, what you want is to give your nervous system a taste. So I would say just start with five minutes a day. And just--and then, you know, let the practice inform you. If you do five minutes and, you know, you can play around with-- I mean, the basic strategy is just to sit and notice your breath, but you can play around with other objects, something else that's just whatever, for whatever reason, is interesting to you. But take five minutes and see if you can completely commit yourself in that way, and then notice--do you feel a little bit more settled after? If you do, then that's a good place to begin. And then, you know, I-- there's value to moving it up from there, but sometimes five minutes a day is all I get, but I'm gonna actually throw it back to you, Dan, 'cause I know you're, like, the expert at getting regular folks to meditate. So what's your advice around this? I'll lower the bar even further. Try to meditate for at least one minute on 25 out of 31 days. And this is actually backed by science. What we know about habit formation is that it is infernally difficult and that the best way to approach it is with a sense of humor, a sense of exploration, and a sense of humility, that it's hard for everybody, including you, and so if you set the bar low, you're more likely to succeed, and so we have these two little slogans that kind of govern our approach, and actually I came up with these slogans while working with you, Jeff, on our book, \"Meditation for Fidgety Skeptics.\" One slogan is \"One minute counts.\" Yes, I would love to see you do five to ten minutes, even more, but let's be honest, again, given what I said, what we all know about habit formation being difficult, one minute-- in one minute you can get a sense of how wild the mind is, and therefore you have a little bit of a leg up in dealing with all of the terrible ideas that the voice in your head is offering up to you on the regular. And then the other little slogan is \"daily-ish.\" Again, I would love to see you do this every day. I try to do it every day, but if you tell yourself, \"I am gonna do this every day,\" and then you miss a day, there is some reasonable likelihood that the voice in your head will swoop in and tell you, \"Well, you're a failed meditator now. Deuces, I'm out.\" And so \"daily-ish\" provides what the psychologists call psychological flexibility. It's a kind of elasticity that allows you to start over, and that resiliency, the capacity to start over, is so key in a meditation practice while you're actually meditating, and it is so key when it comes to starting any habit that you have to-- because it's so hard to do this, you have to be able to pick yourself up after three weeks of not meditating or three weeks of not exercising and say, \"OK, nothing's been lost. I can just start again.\" So I know I lowered the bar there, Jeff, from what you said. Does that give you-- does that give you hives? No, not at all. I mean, I use the same thing, so I think it's exactly-- I mean, do what works. Do whatever you can to start to kind of get into it, get a bit of a taste of it, and I think one minute is-- if that can give you a taste of it, perfect. So since we keep talking about meditation, Jeff, it may make sense to me-- if you're up for it, to--let's just do just a few minutes of it 'cause I think once people have a sense of how simple this is and how doable it is-- are you game for that? Oh, yes, I am.\n\nIn fact, I was thinking-- I'm gonna guide a dead-simple, five minute meditation, but I'm gonna do it with our audience in mind, knowing that we have a group of creatives and developers and programmers. I'm gonna use this metaphor that I'll thread into it that will hopefully speak to that audience and help actually dramatize what it is we're doing. So that's the five-minute meditation intro. So go ahead and close your eyes. Get yourself into, you know, whatever position just feels comfortable. Actually, you can even have them open if you like, looking at the ground in front of you. It's sort of user's choice.\n\nNow if you're closing your eyes or open, you start with a few deep breaths… stretching out the spine on the inhale… and then the exhale is kind of like your \"ahhhhh…” Super relaxing. Sending a wave of relaxation down through the body, meaning deliberately softening your forehead... and your shoulders... and your belly.\n\nWith each exhale, you can imagine you're, you know, settling a little more, landing a little more in your chair or wherever you're sitting.\n\nAnd the first thing I like to do at the very start of the meditation is--it's sort of tuning in with this internal adjustment, the equanimity adjustment, which just means the \"letting everything be here\" adjustment. So you're not gonna get uptight about sounds being imperfect in your environment or the fact that you might have lots of thoughts or very few thoughts or your body's uncomfortable. It's all--the idea is that you're just gonna let all this be there.\n\nWe're kind of embracing the imperfection of life, and that actually is palpable as an adjustment. It's sort of, like, this-- the other way of being is a kind of uptightness. Instead, just kind of melting everything. So sounds just pass through you. Body sensations and thoughts rise and fall. It's all good.\n\nAnd then we settle into this creaturely pose.\n\nMaybe feeling the breath.\n\nAnd what's happening here is-- it's like our experience has all these different layers.\n\nAnd there's sort of an \"into it\" quality in meditation. Sort of one of the secrets is you choose. You decide. Not only are you choosing which layer to pay attention to. You're kind of choosing to maybe a little bit enjoy this opportunity to take a break.\n\nSeeing if you can kind of get into the feeling of breathing like you're kind of into it.\n\nYou know, if we make it enjoyable, you're just gonna want to meditate more, as opposed to making it some grim endurance test.\n\nThe mind wanders. Totally natural. You notice 'cause you've got this awareness thing going on. You notice that layer that got activated that superimposed itself over top of the breath and kind of drifted away, and then you come back to the breath layer.\n\nAnd you let the thought just play out on its own. Now you're not feeding it.\n\nIt doesn't have to go away. You're not trying to get rid of thinking. That thinking process will just keep unspooling.\n\nSo just for fun here - we're working with our layers - we just select this item in the menu, in the drop-down menu, one of the tools — the good-naturedness tool. Make sure that's selected. It's kind of like you're kind of putting a warm glow over everything, so you're just kind of-- you're enjoying your experience.\n\nI'm going to risk a 20-second silence here before we wrap it up, then I'll come in at the end, but just seeing how fully you can commit yourself to this. Some sensation in the body.\n\nThe more we feel what's here in the body, things start to settle. Sensations get subtler. As we get more still, our experience often gets more still — and then a thought comes and takes us away. That layer gets activated. We notice. We come back. And that's the-- that's the movement of practice. The movement is committing, getting distracted, recommitting, and then suffusing the proceedings with a kind of equanimous good-naturedness.\n\nSo I'll just let us have a few more seconds here.\n\nAnd then as we prepare to move out of this extremely short meditation, just notice… Do you feel more settled? … More present? And that's the litmus test ultimately. How is it--how do you bring the practice back? Now when you're ready, open your eyes.\n\nThank you, Jeff.\n\nThere were two things you emphasized, at least, in that meditation that I want to kind of just reemphasize. One is the immense benefit of getting out of your head and into your body.\n\nIt's--this is sadly a bit of a cliché, you know, the body knows, et cetera, et cetera, but there's a reason why clichés become clichés, and that's because they're true. And I love this word you used where you get us to kind of get in touch with the creaturely feeling of having a body. Most of us, you know, we're like Macy's Day parade balloons. We're just all head floating through the world with a tiny little body just dragged beneath it, but actually there's enormous potential to getting out of the spinning stories, which are mostly past and future, and into your body. It can be really calming. The other thing you talked about is the fact that we are gonna be distracted in meditation. All sorts of crazy things are gonna go through your mind. What's for lunch? Do we need a haircut? Blah, blah, blah… And a lot of people feel or fear that when they get distracted in this way, when they sit and meditate and notice that working with the mind is a little bit like holding a live fish in your hand, a lot of people tell themselves a story that, \"Oh, I'm a failed meditator. I can never do this.\" And that's because there's this really pernicious misconception that correct meditation involves clearing your mind.\n\nAs I like to joke, clearing your mind isn't possible unless you're enlightened or you've died. The whole game in meditation is to notice when you've become distracted… again and again and again… and just start over, and this is the bicep curl for your brain, and this is what shows up on the brain scans of meditators.\n\nSo I just want to-- and by the way, it has this really important-- I shouldn't-- this isn't a \"by the way.\" This is a \"Here's the sales point.\" The value of seeing the cacophony and chaos of your own mind is that when you're ambushed by anger or random urges or random distracting thoughts off the cushion in your actual life, you're less likely to be owned by it. That's what we're doing here in meditation is getting more familiar with the workings of our own mind so that it's not yanking us around all the time, so that we can learn how to respond wisely to the things in our life instead of reacting blindly. So anyway, Jeff, I just said a bunch of stuff. Does any of that make sense to you? It doesn't just make sense. It's familiar to the benefits of how meditation have showed up in my life personally. Everything you just said there, I've found to be true for me. Beautiful. Let me ask you one last question, Jeff, before we let everybody go.\n\nEspecially for this crowd, I think an interesting question is, \"How do we manage what, for many of us, is a fraught relationship to technology?\" What do you do to make sure that you're using technology as a tool and not having it the other way around where the technology is owning you? Well, I mean, it's super hard because so many of our connections happen virtually now. I mean, that's how I stay connected to my parents, you know, and my friends all over the place.\n\nAll my work happens. I would say it's being smart about getting balance in the nervous system by not being so fixated on a single thing, and you get that feedback by beginning to pay attention to what's going on, you know? So you take a--you know, you take a pause in your work and you go, \"OK, let me check in. How am I doing over here?\" I mean, that's the-- the mind is very, very powerful. It's like a superpower, but it will completely take over with its obsessiveness. So I think that that's how I manage my technology use. I'm constantly stopping, stretching, going for a walk, come back. And I also make sure that I'm only, you know, doing X amount of screen time a day, and that amount of time is a lot lower now than it used to be.\n\nI just want to wrap up here with one final appeal.\n\nI think happiness is such a commonly- misunderstood concept. What the science around meditation is showing us, the neuroscience, the looking into people's brains and looking at what happens when they meditate - what this is showing us is that happiness is a skill - that the mind is trainable - that all the things we want can really be boiled down to mind states. We may think we want professional success, romantic success, to get that new car, to go on that big vacation, all of which are fine to have as goals, but what we really want are the mental states that accompany those goals. And as it turns out, all of these mental states-- calm, happiness, connection, compassion, love-- these are trainable skills, and meditation is one modality through which you can do it, so I really do encourage you to give it a shot. Before I close, I just want to say, Jeff, thank you. I love you. It's great to see you. Thanks for doing this with me. No, problem. I love you too, buddy. I know we are living through really difficult times, and I just want to wish you the best and hope that you can hang in there and also to thank you for watching this talk. ♪ ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10316/8/F3A4B359-293E-4760-A055-B8998AC4CE02/downloads/wwdc2021-10316_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10316/8/F3A4B359-293E-4760-A055-B8998AC4CE02/downloads/wwdc2021-10316_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10324",
      "year": "2021",
      "title": "Thursday@WWDC21",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10324"
    }
  ],
  "extractedAt": "2025-07-18T10:25:27.062Z"
}