{
  "id": "10171",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/10171/",
  "title": "Meet in-app events on the App Store",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ Hello, and welcome to \"Meet In-App Events on the App Store.\" My name is Will Averill, and I'm an engineering manager on the App Store Connect team. The App Store is more than a store. It's a daily destination designed to help users discover all the rich experiences that apps have to offer. So they can find their next favorite app or get the most out of the ones they already have. This fall, we're taking this even further with In-App Events. In-App Events are timely events within your apps and games, such as a game competition, a fitness challenge, a movie premiere, and more. In fact, some of you may already be running events inside your apps. For those of you who aren't, now is a great time to consider doing so. That's because this fall, In-App Events will be discoverable right on the App Store. This a whole new way to showcase your app's events and expand their reach. In this session, I'll show you how In-App Events work on the App Store and how to create them in App Store Connect.\n\nIn-App Events appear on the App Store in the new event card. The design is focused on letting your content come front and center and supports either an image or a video. The event card also displays your event name, a short description, and a time indicator, which automatically updates as the event approaches and once it starts. Users who have your app installed will be able to jump right into the event by tapping Open. This event card is discoverable across the App Store, beginning with your product page. Here, on your app's product page, events are listed in order of their start and priority. Their location on the product page varies, with events appearing above screenshots for users who have downloaded your app, and below screenshots for those who haven't. Tapping the event card brings up the event details page. The event details page, with its longer description and larger media asset, gives users additional context around your event. You can also link directly to your event details page by appending the unique event ID to your app's App Store URL.\n\nIn order to build anticipation for events, you'll be able to promote them up to two weeks before they start. And users will be able to easily request a notification for when your event begins. These notifications come from the App Store and will launch users directly into the event inside your app. If the user doesn't have your app installed, they will be directed to the event details page.\n\nIn-App Events are also discoverable through search. Users who search for your app will see the event card along with the app if they've downloaded it before. For those users who haven't downloaded your app, they will instead see screenshots alongside your app. When users search directly for your In-App Event, the event card always appears next to your app. On the Games and Apps tabs, users will see personalized event recommendations that can help them stay informed about the apps and games they already have, find something new, or rediscover an old favorite. And lastly, our editorial team will be curating the most exciting and innovative events on the Today, Games, and Apps tabs. In-App Events will be available on iOS and iPadOS. Now that you've seen what In-App Events look like on the App Store, let me show you how to create an event in App Store Connect.\n\nStart by logging in and navigating to the app you wanna create an event for. Then click the new In-App Events option under Features on the left. This takes you to a high-level overview of your app's events. Since you're creating your first event, there's not much here at the moment. So click the \"Create In-App Event\" to begin the process.\n\nYou're then asked to provide a Reference Name for your new event. Your event's reference name is only visible within App Store Connect. Pick a reference name up to 64 characters long and click Create. With your event now created, you land on the event page. Here, you'll provide all the information necessary to publish your In-App Event to the App Store. You'll start by filling in some of the most fundamental metadata about your event under the Event Information section. All fields under Event Information are localized. Click the current language for a drop-down of all available localizations. You should consider broadening your event's audience by localizing for as many languages as possible. Once you've selected your intended language, you'll need to pick an event name. This name has a limit of 30 characters and will appear throughout the App Store. I'll also point out that as you fill in the fields on the left, those values are rendered in the preview window on the right. The preview window shows both the event card and event details page as they will appear on the App Store. From looking at the preview window, you can see that the event name is shown on both.\n\nThe short description is used on the event card and is used to briefly summarize your event with up to 50 characters.\n\nAs the name suggests, the event card media is the image or video that appears on your event card. While the long description is used on the event details page. This has a 120-character limit, so you can include additional details, like potential rewards, for example.\n\nNext, you'll add either an image or video for the event details page. Videos you use on both the card and details page will loop and are limited to 30 seconds.\n\nLastly, pick from the badge options to define the type of event you're running. This badge is displayed on the card and details views on the App Store. With your Event Information now finished, let's continue down the page. Just like Apps and In-App Purchases, you'll need to define availability for your In-App Event on a per Country or Region basis. Click the Edit button to open the Country and Region selector, something that should be familiar to most of you. The only difference here is that your In-App Event can only be made available in Countries where your parent app is available. After deciding availability, you need to schedule your event, which means defining its start, end, and publish date and times.\n\nEvent start represents when your event begins inside your app. You'll also need to define when the event ends inside your app. Together, the start and end represent the total duration of your In-App Event. Your event can run as long as 31 days or as short as 15 minutes. The next thing you'll need to consider is when you want your event to first appear on the App Store. This is controlled by your event's publish date, which can be up to 14 days from your event's start.\n\nWhen your event is published to the App Store, it will be discoverable through all of the ways we discussed earlier, like on your product page and in search. Once your event reaches its end, it is no longer discoverable on the App Store by browsing or searching.\n\nHowever, users will still be able to see your event details page via the App Store URL for another 30 days, after which point, it is then archived. This ensures links you've shared through marketing channels will still work for a while after the event ends. This 30-day period happens automatically and is not configurable. If you want to archive your In-App Event sooner, you're able to do so by editing its availability in App Store Connect.\n\nNow that you've set up your event's default scheduling, you're given the ability to set custom scheduling per Country or Region. This is completely optional, but to do so, click the \"Customize Dates and Times\" link. First, select the Countries or Regions you want to add custom scheduling for, and then click Next. Now, choose one or more new scheduling dates to apply to these specific Countries. The custom dates need to be within 48 hours of your default selections. In this example, I've bumped my start and end date in Europe to account for the time difference. Lock in your custom scheduling by clicking Done.\n\nAnd with that, you've just finished configuring your event's availability and scheduling. There's only a few more pieces of metadata to provide. This is done in the final section of the page, Additional Information. First, you can edit the Reference Name that you chose earlier. Next, you need to provide an Event Deep Link. This link makes it possible for users with your app installed to quickly jump from the App Store into your In-App Event. Your event deep link can either be a universal link or a custom URL that opens directly to a particular place in your app. In order for your link to function correctly, avoid using URL shorteners or other services that add unnecessary redirects.\n\nWith the Event Purpose field, you can indicate whether your event is meant to attract new users, keep your active users informed, or bring lapsed users back to your app. Many events are equally suited for all these purposes, so that's the default selection. Your selection here is one of the factors that the App Store uses to offer personalized recommendations. To help your event reach the people it's intended for, the App Store incorporates app-usage information. That data is processed on the device to minimize data collection and enhance user privacy. Note that regardless of which purpose you select, your event will be discoverable by all App Store users.\n\nHere you can indicate your event's priority level, which affects how it's ordered on your app's product page. High-priority events are shown in front of normal ones, and events are sorted by their start time within these respective groups. Next, you'll indicate whether your event requires an In-App Purchase or a Subscription.\n\nThis information is displayed on your event card and event details page. Make sure your selection here is accurate to set proper expectation with users and to ensure a seamless review process.\n\nAnd finally, you can update your event's Primary Language. By default, this is set to your app's primary language. With that, you've now fully configured your In-App Event.\n\nMake sure you click the Save button to persist everything you just filled out.\n\nAfter saving, you'll notice your In-App Event is listed in the \"draft\" state. Draft events are simply any event that you've started, but haven't yet added for review. To publish your event to the App Store, it must first be reviewed. To add your event for review, navigate back to the event page and click the button in the top right. You'll be able to add an event for review anytime after you've filled in all the required metadata. There's no need to create a new version of your app or upload a new binary. As you just saw, events begin in the draft state and can be reviewed once fully configured.\n\nAfter they pass through review, events enter the approved state. Once approved, events automatically publish to the App Store according to their scheduling. Approved events with a future publish date are labeled \"Set to Publish,\" while those with past publish dates are marked \"Published.\" After an event's end date is reached, the event moves to the \"Past\" state. While no longer published to the App Store, remember that your event details page is still link accessible on the App Store for an additional 30 days.\n\nAnd finally, after 30 days in the \"Past\" state, your In-App event moves to its final state, Archived, and is no longer accessible via link.\n\nNow that you understand the event state life cycle, let's discuss two important limits. First, your app can have ten events in the approved state. And second, your app can have five events published to the App Store at a time. You won't be able to add an event for review if its scheduling would cause either limit to be exceeded.\n\nAfter your events have been published to the App Store, it's important to measure how they're performing. So there's a robust new set of capabilities to do this in App Analytics. Your event page in App Store Connect will link directly to your event in App Analytics. From there, you'll find many important metrics allowing you to measure your event's effectiveness.\n\nFirst, you'll be able to track your impressions, which shows how many people saw your event on the App Store. You'll also be able to drill down further, to figure out where users saw your event, like on your product page, in search, or other locations.\n\nNext, you'll see metrics around how many users opened your app or opened the event details page. In addition, you'll see how many users downloaded or redownloaded your app as a result of your event. And lastly, you'll see how many users enabled notifications for your In-App Event.\n\nThere's additional insights available in App Analytics that I didn't cover, so if you're interested in learning more, be sure to check out the What's new in App Analytics session. And finally, we know how important it is for you as developers to automate as much of your app workflow process as possible. That's why I'm pleased to announce, all the In-App Event functionality I just discussed will be supported by the App Store Connect API. The full spec will be provided later this year. I've covered a lot of new information in this session. First, I showed you how users will discover In-App Events on the App Store. Next, I walked you through how to set up your In-App Events in App Store Connect. And finally, we covered how you'll be able to measure their performance in App Analytics. I can't wait to see all of the exciting events within your apps, now discoverable on the App Store. And I hope you start thinking about how you can bring In-App Events to your own apps if you haven't already. In-App Events launch later this fall. Thanks for watching this session, and please enjoy the rest of your conference! [upbeat music]",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "App Store Connect API",
        "url": "https://developer.apple.com/documentation/AppStoreConnectAPI"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10171/4/70981448-BDD3-40FE-8EE5-7B1F60FCAFB9/downloads/wwdc2021-10171_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10171/4/70981448-BDD3-40FE-8EE5-7B1F60FCAFB9/downloads/wwdc2021-10171_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10295",
      "year": "2021",
      "title": "Get ready to optimize your App Store product page",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10295"
    },
    {
      "id": "10115",
      "year": "2021",
      "title": "What's new in App Analytics",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10115"
    },
    {
      "id": "10004",
      "year": "2020",
      "title": "Expanding automation with the App Store Connect API",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10004"
    },
    {
      "id": "10651",
      "year": "2020",
      "title": "What's new in App Store Connect",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10651"
    }
  ],
  "extractedAt": "2025-07-18T09:20:10.969Z"
}