{
  "id": "10261",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/10261/",
  "title": "Faster and simpler notarization for Mac apps",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing",
    "Developer Tools"
  ],
  "hasTranscript": true,
  "hasCode": true,
  "transcript": {
    "fullText": "♪ Bass music playing ♪  ♪ Olivia Hillman: Hi, I'm Olivia Hillman, and I'm a security engineer working on Apple's Notary service.\n\nI'm going to talk to you about some exciting work we've been doing to make notarizing Mac apps faster and simpler.\n\nI'll start with a brief overview of what the Notary service is.\n\nThen I'll dive into our new tool and I'll share how you can get started using it.\n\nSo, let's begin! Notarization is for Mac developers that distribute their software outside of the App Store, and this talk specifically is for those of you that use the existing command-line tool, altool to interact with Notary.\n\nIf you're notarizing with Xcode only, your workflow isn't changing.\n\nMac developers submit their software to be notarized before it's distributed, so it can run on a user's Mac.\n\nThis notarization process gives users confidence that software running on their machines has been checked by Apple for malicious components.\n\nNotarization has been helping to protect customers since macOS 10.14.\n\nAnd now, we've made it faster and simpler to use.\n\nFor more background about Notary, check out our in-depth 2019 talk \"All about Notarization\".\n\nLet's take a look at the Notary workflow.\n\nDevelopers build their software and send it to us for notarization.\n\nThe Notary service runs automated analysis that scans the software for malicious content and checks for code signing issues.\n\nIf there are no issues, Notary publishes a ticket to be retrieved by users’ Macs when they launch the software.\n\nAnd then we return the result to your developer team.\n\nWe're committed to completing this process within 15 minutes for 98 percent of Notary submissions, and most complete in under five.\n\nYou can then provide your app for users to download, and macOS checks the software before it can run on a user's machine.\n\nWe care about protecting customers from malware and making it easier for developers to submit to Notary and even faster for users to get access to new software.\n\nAnd with that mission in mind, I'm thrilled to share with you the new way to notarize.\n\nIntroducing notarytool.\n\nnotarytool provides a one-line command for submitting your software and waiting for your result.\n\nWe've introduced targeted enhancements focused specifically on the needs of Mac developers that are notarizing software independently without the need for altool's App Store support.\n\nThese improvements make notarization faster and easier, all while we continue to protect customers from malware.\n\nDevelopers depend on the Notary service, so we want it to be as reliable as possible and available whenever developers need it.\n\nIn addition to the changes to the client software, we've also streamlined the service.\n\nIn fact, we've built a new dedicated service backend that's focused on reliability just for Notary.\n\nThe new service is designed to bring you improvements in end-to-end processing speed, and we're excited for you to try it out.\n\nWe know you may be waiting as your submission uploads, so we've worked hard to make upload speed up to four times faster for most developers.\n\nTo take advantage of these incredible performance and reliability gains, be sure to transition from altool to notarytool.\n\nnotarytool is easy to use and carefully designed with your notarization workflow in mind.\n\nWe've heard your feedback and we wanted to improve the developer interaction with a simpler client and a single line to get things done.\n\nSo let's say I'm a developer and I've just finished building the latest bug fix to my app.\n\nI want to get this published as soon as possible.\n\nThe quickest way for me to accomplish this with altool on the command line is with a polling loop, like this.\n\nI first submit my application, and when that's done, I start to continuously poll for status until processing is complete.\n\nNow, with notarytool, we've added a wait flag to the client that allows you to submit and wait for your notarization result all in one command.\n\nAs soon as your job completes, the program will display the results of your submission.\n\nOnce you receive your submission result, you're only one command away from viewing your Notary log using the new client.\n\nYou'll be able to view details about your result directly from notarytool, including any reasons why your application may not be notarized.\n\nWe've also added a brand-new feature that's accessible to you when you submit to Notary: webhook notifications.\n\nThis feature allows you to specify a URL for a server callback as soon as we finish processing your software.\n\nBy specifying a webhook URL when you submit, you can seamlessly add notarization into your continuous integration workflows by automatically retrieving your result and your Notary log when you receive a notification.\n\nWe can't wait for you to start using this powerful new tool, and we look forward to receiving your feedback about notarytool and this new developer experience.\n\nnotarytool is the new client for interacting with the Notary service and is distributed with Xcode.\n\naltool isn't going away, but is now deprecated for use with Notary.\n\nnotarytool makes your workflow faster and simpler with a client that's dedicated to the Notary service.\n\nYou'll be able to find more details about the latest features and performance improvements in the documentation linked to this talk in the coming weeks.\n\nAccess to the tool is available with the latest Xcode build, with information to help you get started in the tool's man pages.\n\nSo make the switch today to start distributing software more quickly and seamlessly than ever before.\n\nThank you.\n\n♪",
    "segments": []
  },
  "codeExamples": [
    {
      "timestamp": "4:10",
      "title": "altool example",
      "language": "swift",
      "code": "// with altool\nxcrun altool --notarize-app -f path/to/submission.zip \n    --primary-bundle-id \"$BUNDLE_ID\"\n    --apiKey \"$KEY_ID\" --apiIssuer \"$ISSUER\"\nwhile true; do\n  INFO_OUT=$(2>&1 xcrun altool --notarization-info \"$SUBMISSION_ID\" -u \"$USER\" \n      --apiKey \"$KEY_ID\" --apiIssuer \"$ISSUER\")\n  STATUS=$(echo \"$INFO_OUT\" | grep \"Status:\" | sed -Ee \"s|.*: (.*)$|\\1|\" )\n  if [[ \"$STATUS\" != \"in progress\" ]]; then \n    break\n  fi\n  sleep 30\ndone"
    },
    {
      "timestamp": "4:19",
      "title": "notarytool example",
      "language": "swift",
      "code": "// with notarytool\nnotarytool submit path/to/submission.zip --wait\n    --key \"$KEY_PATH\" --key-id \"$KEY_ID\" --issuer \"$ISSUER\""
    }
  ],
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10261/7/1C2BA450-20C2-43D2-985E-BA26B13060B2/downloads/wwdc2021-10261_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10261/7/1C2BA450-20C2-43D2-985E-BA26B13060B2/downloads/wwdc2021-10261_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10109",
      "year": "2022",
      "title": "What’s new in notarization for Mac apps",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10109"
    },
    {
      "id": "10204",
      "year": "2021",
      "title": "Distribute apps in Xcode with cloud signing",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10204"
    },
    {
      "id": "703",
      "year": "2019",
      "title": "All About Notarization",
      "url": "https://developer.apple.com/videos/play/wwdc2019/703"
    }
  ],
  "extractedAt": "2025-07-18T09:20:22.534Z"
}