{
  "id": "10317",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/10317/",
  "title": "Out of this world... on to Mars",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design",
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ Six, five, four, three, two, one, zero. All engines running.   ♪ ♪ I had the passion of designing, building. I really, really loved math. So at the age of 11, I decided to become an aerospace engineer, and ever since that moment, I've been stuck on that dream. My name is Tiera Fletcher. I'm a rocket scientist working on NASA's Space Launch System, and I'm working to get us to Mars.\n\nI was born and raised in a small town outside of Atlanta called Mableton, Georgia. Fortunately, I grew up with both of my parents and two older siblings. My father, he was a construction worker, and he would show me how to take measurements or how to build small-scale houses. And he didn't realize it, but he was introducing me to engineering. And my mom, when we would go to the grocery store, she would challenge me to calculate the total of the groceries, including tax, minus the coupons, without a calculator. So she did those exercises because she understood that I had a passion for mathematics. So at the age of 11, I decided to become an aerospace engineer. I joined a program that taught students about robotics. So being able to design and build was already a passion that I had acquired prior to the program, but being able to program that structure that I create and make it move, that just brought it all to life for me, literally. Being able to see something go from paper to product to movement put it all together for me. To continue towards my dream, I decided to attend the Massachusetts Institute of Technology. While at MIT, I had the opportunity to define antigravity rotations for astronauts. And I also had the opportunity to define the outer protective layer for the space suit of the future. Since our very first breath, humankind has just had this passion to explore and discover the unknown, to determine the new frontiers. And really that hunger to produce all of this innovation and technological breakthroughs has caused us to create fantastic innovations from personal computers to global positioning systems or, as you know it, GPS, and even the Internet. But even before all of those innovations, we've had the passion to go to Mars.\n\nSending 24 humans into space, completing 13 launches, weighing over 6 million pounds and standing taller than the Statue of Liberty was the Saturn V, the largest rocket ever created in history. Some may even argue that the Saturn V was created to take humanity to Mars. So from 1969 to 1973, the Saturn V served as the launcher for the Apollo program. So it was literally facilitating human footprints to the Moon. This rocket did not merely just launch into the air and break through the atmosphere. It was controlled by groundbreaking avionics of the time and notably the Launch Vehicle Digital Computer. With increased computer use on board, it caused an increase of computer use off board as well. So thankfully, software-enabled processes caused our manual processes to then become completely automated.\n\nWe are voyagers collecting data beyond our solar system. Space probes Voyager 1 and Voyager 2 have been traveling through space since the '70s. At more than 14 billion miles away from Earth's surface, these spacecraft are literally in the interstellar medium, breaking barriers of our solar system.\n\nProgrammed spacecraft are traveling throughout space collecting asteroid samples to bring back to Earth. OSIRIS-REx literally collected a sample of a near-Earth asteroid called Bennu and is bringing it back to Earth so that we can do more research in our labs.\n\nKnowledge expands billions of miles away, as we are on a mission to explore new horizons. Known as the fastest human-made object launched from Earth, New Horizons has been able to tell us more about our former planet, known as Pluto, and also traveling through the Kuiper belt to tell us more about the formation of our solar system.\n\nTrips to the International Space Station are now second nature. Crew-1 just returned from their mission and Crew-2 went off to the International Space Station back in April. so yeah, one mission down, one mission underway, four more missions to go as part of the commercial Crew program.\n\nOur Perseverance has led us to see and hear Mars more clearly than ever before. The Perseverance Mars Rover has been able to send back data detailing the visuals and the audio of Mars and also deploy the Ingenuity helicopter so that we can have that first powered flight on the Martian surface.\n\nHumans are now returning to the Moon in preparation to pursue deep space missions, including Mars. And we have a vehicle to propel us there: NASA Space Launch System.\n\nI began working on the Space Launch System program at the age of 22 as a structural design and analysis engineer, and what that means is that I would design different parts of the rocket and verify the structural integrity of those same parts. And then I wanted to see the rocket, so I decided to go to the Michoud Assembly Facility in New Orleans, Louisiana, and I worked as an engine section task lead. So those same parts that I just designed, I had to spearhead the installation of those parts and work with the technicians to verify that all of the assemblies were correct. Moving on from there, I became a structural engineer, and what that means is that my role was very multifaceted. So I did manufacturing engineering work, structural design engineering work, anything and everything to make sure that the rocket was complete. And then I became fully a structural design engineer, where I had to create drawings and verify all of the different intricacies of the designs for the vehicle. And now I'm a configuration management and product integration engineer, or you can say a product life cycle engineer. What that means is that I have to verify that all of the engineering designs for the parts align with the installations of the parts.  ♪ ♪ Being able to not only design components with multiple types of software on the computer screen but also see those components in my face and touch them, it's--it's mind-blowing. I literally would get to the point of tears just thinking about all of the different days and hours that I worked designing different components of the rocket, seeing them in 3D modeling for computer-aided design software and then seeing it up front in person actually manufactured and fabricated and assembled on the rocket.\n\nTowering 322 feet tall, the Space Launch System consists of a few major components. Four RS25 engines. And then you have the core stage, the upper stage, or also known as the interim cryogenic propulsion stage, and then you have solid rocket boosters on either side, and of course you have a crew capsule called Orion that sits at the top of this massive rocket. The Space Launch System is the most powerful rocket ever created in history. Producing over 8 million pounds of thrust, that's actually 15% more thrust than the Saturn V.\n\nMost recently, the Space Launch System core stage underwent green run testing. What green run testing means is that the engines are all fired up at the same time as a whole structure, and let's just say that anyone who is near the Stennis Space Center can feel the rumbling and the growl of the propulsive system of the Space Launch System. This was a significant test because we had a chance to have multiple and multiple test cases play a role all within 8 to 9 minutes, so it was a very short time frame but super monumental for our process to get the Space Launch System on the launch stand at the Kennedy Space Center. The interesting part is that we had to move this massive structure all the way from New Orleans, Louisiana, to the Kennedy Space Center. And that's where the historical Pegasus barge had to come into play. We were able to load the core stage and carefully bring it over to the Kennedy Space Center. Although it can undergo millions of pounds of force, we want to make sure that the structural integrity is maintained throughout the whole transportation process. And now we are stacking up multiple components of the rocket in the vertical assembly building so that we can then shift it over to the launch stand so that we can launch at the end of this year. ♪ ♪ So now let's talk about the missions of how we get back to the Moon and on to Mars. This is through the Artemis program, and it consists of three different missions. The first mission takes place this year in 2021.\n\nThe Artemis 1 Space Launch System will pair along with the Orion crew capsule for an uncrewed flight. And the significance of this flight is that it is the initial flight for the Space Launch System, so it is a mission that will be proving ground for the structure before we allow astronauts to come on. And the Orion will travel 40,000 miles away from the Moon, which is about 280,000 miles away from the Earth's surface. In total, Orion will undergo about 1.4 million miles of travel from Earth and all the way back. This journey is going to prove very significant because we are going to be able to collect data that will fuel the next Artemis mission, but also it will fuel the whole future of space travel. Orion is going to undergo an entry at about 24,500 miles per hour. And that's going to cause the capsule to reach about 5,000 degrees Fahrenheit. All of the data that we will collect from this mission will definitely teach us what to do before we allow astronauts on board.\n\nIn 2022, the Artemis 2 Space Launch System in conjunction with the Orion will carry four astronauts back to the lunar environment for the first time in over 50 years. This is extremely significant for the future of human space travel. The astronauts will undergo a ten-day mission where the capsule will make two orbits around the Earth and then head over to the Moon. The Orion will begin by reaching an initial insertion orbit. After the first orbit, the interim cryogenic propulsion stage will then propel Orion to high-Earth orbit. The Orion will then be separated from the interim cryogenic propulsion stage so that the astronauts can verify valuable performance and operational capabilities so that that data can carry forward for the next Artemis mission. In 2024, Artemis 3 Space Launch System and Orion will carry astronauts back into the space environment. But this time, the first woman and the first person of color will step foot on the Moon. ♪ ♪ I knew that I needed a role model to serve as my guiding light throughout my journey, and in that search, I discovered Mae Jemison, the first Black female astronaut. Being able to see someone who looks like me allowed me to see myself becoming an aerospace engineer. Representation is such a vital component of being able to bring your dreams into reality. I had many moments where I felt that I couldn't speak up in meetings or that I couldn't contribute because of the way that I look or just because I was the youngest on the team or the only female on the team or the only African American on the team. But I had to overcome those barriers and set myself on the challenge of not only contributing but giving 150% at all times, because I understood that I did not have only the responsibility of contributing as an engineer but also the responsibility of widening the pipeline in order to encourage the youth, the upcoming generations, to pursue this field as well, even though there aren't many of us or a large representation of minorities at this time. So in order to do that, I created an organization alongside my husband, who’s also a rocket scientist, called Rocket with the Fletchers. So through Rocket with the Fletchers, we do many different outreach opportunities for students to motivate them to follow their dreams. So we teach about aerospace engineering… we mentor… and that's not only the fact of talking about how cool aerospace engineering is - it’s about the importance of diversity and inclusion when it comes to innovation for humanity. Diversity of mind is at the center, at the forefront, at the root of successful innovation for the space industry. By actually playing an active role in getting the first woman and the first person of color on the Moon, I feel very proud, very proud of the work that I do.\n\nBut truly in order for us to continue to power innovation within the space industry, we have to look at the critical components of innovation: passion, data, and diversity of mind. And you know what? Maybe I'll see you on Mars someday. Three, two, one. ♪ ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10317/8/3E1F4F09-7847-40F9-8D2A-0355456D569E/downloads/wwdc2021-10317_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10317/8/3E1F4F09-7847-40F9-8D2A-0355456D569E/downloads/wwdc2021-10317_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10322",
      "year": "2021",
      "title": "Tuesday@WWDC21",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10322"
    }
  ],
  "extractedAt": "2025-07-18T09:37:21.368Z"
}