{
  "id": "10318",
  "year": "2021",
  "url": "https://developer.apple.com/videos/play/wwdc2021/10318/",
  "title": "Developer spotlight: Accessibility",
  "speakers": [],
  "duration": "",
  "topics": [
    "Accessibility & Inclusion"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Accessibility is more about including all people because everyone has a different way of accessing the world.\n\n♪ ♪  In 2009, I lost my eyesight and became suddenly and instantaneously interested in accessibility. Since I first started at Avid, we were trying to improve accessibility into our products and services. I was born deaf. I’ve been deaf my whole life. My world experience, my lived experience has been deaf all the way. So my world is visual.\n\nThere’s no audio in my life. The way that influences my work is that it forces me to look at how apps run and consider the experience of running them without audio. I’m blind, and, day-to-day, I develop code just like anyone else would, using the same tools plus a screen reader.  Each day I’m motivated by the power of technology to improve people’s lives, and for people with disabilities, you can really close the gap between what someone is capable of doing and what their current environment and situation allows them to do. When you’re developing and driving accessibility into products, attention to accessibility has more impact and reach than any of us can imagine. And with a billion people in the world with some form of disability, it’s not a niche audience. And you want them all to walk up to the app and use it the same way. You don’t want the blind version of Pro Tools for these other guys. You want to have one universally accessible version of the tool that everyone can walk up and use. The biggest misconception that people have about making apps accessible is thinking that it’s a lot of work and it’s really difficult, but it’s not. Yeah, I remember once there was an app that was completely inaccessible because there weren’t labels on any of the graphical buttons. And I got in touch with the developer, and I pointed them to some resources and explained why this was a problem. And with, you know, just a day’s work, he was able to add those labels, and the app became mostly accessible. It’s a long-term investment in good design for usability and accessibility. Takes a lot of input from all over the company and from external beta testers. It’s really important to have your teams be reflective of all the different types of people in the world because if you have that diversity on your team, you’re going to solve problems in better ways and create better products. One thing I’d like to emphasize is that the tools themselves need to be accessible. I can give you an example.\n\nI received a bug report regarding a problem with the VoiceOver feature on our app. It happened to be the first bug assigned to me on this job, and I wondered for a moment-- how can I test this if I can’t hear it? So I checked the settings on the phone and found that VoiceOver provides a caption bar.\n\nTweets and replies, Button. Media, Button. Likes, Button. My point is that someone at Apple recognized this and made a decision to add that caption bar, which allows me to do my work, and, in turn, improve the experience for more people. The Seeing AI project, in many ways, was born out of that personal need. It describes the world around you including reading text and identifying people and objects around you. Chair, laptop, table. Plant, cup, chair, chair, plant. Early on we realized that we needed to provide more audio guidance on how to point the camera, and so, one of our team members came up with the idea, when scanning a barcode, to use a kid’s game of “hot or cold” so that the beeps get faster the closer you are.  Processing. Smucker’s seedless blackberry jam. Back when I was taking cabs from wherever I was to return home, I’d use the Notes app to communicate to the driver, but the text was so tiny, and the drivers had a hard time reading it, and I thought, \"I really need something that can enlarge the text and make it easy to read and speed up our communication.\" So I developed an app called Cardzilla.\n\nThe thing that makes me excited is people using our tools that have disabilities but they’re using them with the same facility and energy and proficiency as sighted people. So, let’s make some music! Okay, so here we have the interface.  A really nice note we received is from a father who took his son to the zoo, and they were having a nice day, but the father said it really became magical when he could use Seeing AI to read the signs, and therefore he was listening to information about the orangutans, and now he could tell his son about that, and they could share that experience together. Or from parents who used it to recognize their children’s handwritten homework. And I love this. It’s one of the most favorite parts of my job is hearing from users. We had a family gathering, and my grandmother was there. I had just finished developing the app at the time and I showed it to her, and she was really excited about it. She said, \"Finally, I can really talk to you.\" She could just hit the dictate button and speak, and we could have an interactive conversation. By making tools more accessible, developers are making the world a more inclusive and loving place. [upbeat music]",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10318/12/ACAF8CC7-BEA9-44B2-A056-557CDC67692C/downloads/wwdc2021-10318_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2021/10318/12/ACAF8CC7-BEA9-44B2-A056-557CDC67692C/downloads/wwdc2021-10318_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:08:50.222Z"
}