{
  "id": "10043",
  "year": "2022",
  "url": "https://developer.apple.com/videos/play/wwdc2022/10043/",
  "title": "What's new in App Store Connect",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing",
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ Mellow instrumental hip-hip music ♪ ♪ Hello, and welcome to \"What's New in App Store Connect.\" My name's Will Averill, and I'm an engineering manager on the App Store Connect team.\n\nApp Store Connect has grown considerably over the years.\n\nYou use it to create, manage, and grow your apps on the App Store across all of our platforms.\n\nAnd we continue to bring new features to App Store Connect on web, our iOS and iPadOS app, and the App Store Connect API.\n\nJust last year, we launched a bunch of great new features.\n\nYou've probably heard all about things like in-app events, custom product pages, and TestFlight for Mac.\n\nSo instead, let me quickly highlight a couple recent updates you might have missed.\n\nIn TestFlight, we made managing your build's associated tester groups easier.\n\nWith just one click, you can now quickly add or remove a tester group to a build directly from the Versions or Build Groups tab.\n\nWe also heard your feedback loud and clear, so we made an update allowing you to transfer apps that use Apple Wallet.\n\nAnd finally, to facilitate the submission process for in-app events, custom product pages, and product page optimization, we launched the enhanced App Store submission experience.\n\nThis is one the biggest enhancements we've made to the submission workflow, so let's explore this together in a bit more detail.\n\nFirst, you're now able to group multiple items into a single submission.\n\nAdditionally -- in most cases -- you can choose to submit without a new app version.\n\nAnd we introduced a dedicated App Review page where you can manage in-progress submissions, communicate with App Review, and even view recently completed submissions.\n\nLet's start by talking about what it means to group items in a review submission.\n\nSay we have a number of custom product pages or any other review items we want to publish to the store.\n\nSince review items can only be submitted as part of a review submission, the first step is to add them to one.\n\nThink of a review submission as the vehicle that carries review items to and from App Review.\n\nNow, a review submission only needs one item to be submitted, but the advantage to grouping several items is they are all reviewed in context together.\n\nThis helps ensure a consistent and efficient review.\n\nIn fact, all review submissions are typically reviewed within 24 hours, regardless of the number or type of review items.\n\nAfter review, each item in the submission will be marked as accepted or rejected.\n\nIt's very important to understand that no review items are approved until all items in the review submission are accepted.\n\nSo let's look at two ways to move forward with a review submission that has rejected items.\n\nThe first option is to edit any of these rejected review items and then resubmit.\n\nIf those items now come back accepted, the review submission is complete and every item is approved and able to be published to the App Store.\n\nThe other option is to simply remove any rejected items from the submission.\n\nThis leaves the review submission with only approved items, once again completing the review process.\n\nHowever, keep in mind that any removed items will need to be resubmitted as a part of a new submission in order to become approved.\n\nAnd before I move on, let me specify that review submission items can be app versions, in-app events, custom product pages, or product page optimization tests.\n\nNow, let's take a look at how you're able to submit without a new app version.\n\nTo understand how this works, let's discuss a few more specifics about review submissions.\n\nFirst, each submission has an associated platform.\n\nIn addition, each platform supports a specific set of review items.\n\nAlthough, as you can see, most items are reviewed and grouped as part of an iOS submission.\n\nAnd lastly, you can have one in-progress review submission per platform.\n\nIn this example, you can see we're working towards submitting all three versions of our app.\n\nBut, let's go ahead and take a closer look at the iOS review submission.\n\nApp Review reviews all items in a submission against an app version to ensure everything is consistent.\n\nIf there's an app version in the submission, that becomes the version used for review.\n\nBut like I mentioned earlier, you can submit without adding a new version to your submission.\n\nTo do this requires a previously approved version of your app.\n\nOf course, once submitted, items will be reviewed against this version.\n\nThis means you're able to submit in-app events, custom product pages and product page optimization tests anytime after your first iOS version is approved, without needing a new app binary.\n\nSo now that I've explained how this experience works, let me show you where the dedicated App Review submission page lives in App Store Connect.\n\nOnce you've logged in and selected an app, click the App Review link on the left nav menu.\n\nThis is the App Review page where you can manage your entire review workflow.\n\nHere, you can see an overview of your submissions and click into any of them for a more detailed look.\n\nNow obviously, using the web UI is great, but wouldn't it be nice to submit and track submission status on the go? That's why we're excited to share that we've brought the enhanced submission experience to App Store Connect on iPadOS and iOS with this week's update.\n\nYou'll now be able to submit any of your Ready for Review submissions to App Review from anywhere, with just one tap.\n\nOnce submitted, you can track the progress of your review submissions.\n\nAnd you can opt in to receive timely notifications about status updates as well as manage your submission by removing items, viewing rejection reasons, and replying to App Review.\n\nSo that's the enhanced App Store submission experience, available now on App Store Connect for iPadOS and iOS.\n\nLet's shift gears a bit and focus on the App Store Connect API which represents a great way for you to customize and automate your app workflows.\n\nBest of all, we're always working to add new capabilities to the API.\n\nLast year, we added support for App Clips, Xcode Cloud, in-app events, custom product pages, product page optimization, and even the enhanced App Store submission experience I just described.\n\nAnd this year is no different.\n\nWith our huge 2.0 release coming this summer, we're expanding the number of resources in the API by 60 percent.\n\nIn this summer's release, we're adding some great new functionality that has been heavily requested.\n\nBeginning with a comprehensive set of APIs to manage your entire in-app purchase and subscription lifecycle.\n\nWe started by breaking subscriptions into their own resource and giving you full control to create, edit, or delete any of your in-app purchases or subscriptions.\n\nYou'll also be able to manage pricing, submit for review, and create special offers and promo codes.\n\nWe can't wait to see how you take advantage of this new opportunity to automate your in-app purchase and subscription workflows.\n\nWe're also adding the ability to fetch and respond to your app's customer reviews.\n\nThe goal here is to allow you to build some great custom workflows around customer interaction.\n\nAnd lastly, we're adding additional reporting data to the power and performance metrics and diagnostics APIs for app hangs.\n\nIdentifying and eliminating hangs in your app is a great way to increase performance and improve user experience.\n\nBut until now, you could only view metrics like your app's hang rate through the API.\n\nThat changes this summer as we're adding a new diagnostic type for app hangs.\n\nYou'll be able use this type with the existing diagnostic signatures resource to discover the places in your app that contribute most to hangs.\n\nNot only that, but you'll also be able to see detailed stack traces for these hang signatures through the diagnostic logs relationship.\n\nI've just barely scratched the surface here, so if you'd like to learn more about how these APIs work or how to use this data to discover additional insights into your app's behavior, definitely check out these two related sessions.\n\nOverall, the App Store Connect API 2.0 release represents a major milestone.\n\nAfter four years of development, we've fully embraced REST APIs as the future of App Store Connect automation.\n\nAs a result, we'll begin to decommission the XML feed this fall.\n\nTherefore, we highly encourage you to align your integration with the App Store Connect API moving forward.\n\nIn summary, we recommend taking full advantage of the enhanced App Store submission experience in order streamline your review process.\n\nAlso, be sure to download the latest release of App Store Connect for iOS and iPadOS, which adds support for the enhanced submission experience and several other updates.\n\nAnd finally, we're adding a bunch of new capabilities to the App Store Connect API with the 2.0 release this summer.\n\nWe strongly suggest working to integrate with our API, especially as we begin to decommission the XML feed later this fall.\n\nAs always, we look forward to hearing your feedback and hope you have a great WWDC! Thanks for watching.\n\n♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "App Store Connect API",
        "url": "https://developer.apple.com/documentation/AppStoreConnectAPI"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/10043/3/F1797DDF-C678-4B65-9571-42C3B99B40B8/downloads/wwdc2022-10043_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/10043/3/F1797DDF-C678-4B65-9571-42C3B99B40B8/downloads/wwdc2022-10043_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:19:20.731Z"
}