{
  "id": "113",
  "year": "2022",
  "url": "https://developer.apple.com/videos/play/wwdc2022/113/",
  "title": "Apple Design Awards (ASL)",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ Mellow instrumental hip-hop music ♪ ♪ ♪ Sparse upbeat electronic music ♪ ♪ - Design, for me, is like a way to express myself, just like writing a song or write a book, but I don't know music, and I can't write good languages.\n\nBut I can code.\n\n- Design is like an opportunity where you can create things that are not only beautiful, but that also serve a purpose.\n\n- Design is in every aspect of life.\n\n- Design influences people's lives on all levels.\n\n- Design can be the difference between having a great experience or having a bad one.\n\n- If no design, there will be no surprise.\n\n- It's not just how things look, it's how things work.\n\n- It's one of the most effective forms of storytelling.\n\n- To design something, I think we often have to kind of reduce it down to a simplified version of it.\n\n- It's like, yeah, climbing a mountain, step by step.\n\n- You get to start with, like, a blank piece of paper and then you get to turn it into something hopefully really cool.\n\n- When you actually make it work and then you show it to someone, and they actually can use it in a simple way, when it used to be this really complex thing, I think that's just really cool to do.\n\n- When we first met on our first date, he said that he's a UX designer.\n\nAnd I thought, will I be stupid if I say, \"What does it mean?\" ♪ - Real design is far more functional.\n\n- Delightful.\n\n- Cute.\n\n- Soothing. - It's cozy.\n\n- Powerful. - Intriguing.\n\n- Flashy. - Tactile.\n\n- Simple and joyful.\n\n- Playful.\n\n- And pretty! ♪ - Let me think, do I love design?  - Sometimes I hate it.\n\nBut yeah, it will not last for a long time.\n\nSo basically, I think I love the design.\n\n- In some ways, I can't escape designing.\n\n- I can't imagine a life without designing stuff.\n\n- How could anyone hate design? - It's kind of like magic.\n\n- I couldn't do anything else.\n\n- I know my user can feel how I'm thinking in my app through my design.\n\n- I think design really does change the way we approach life itself.\n\n♪ Whimsical music ♪ - I mainly get inspiration from walking in nature.\n\nEvery time I do that, I have ideas that come to my mind.\n\n- The inspiration could be from anywhere.\n\nIt doesn't need to be in the museum or gallery.\n\nIt's in the nature. It's in the city.\n\n- When it's nighttime, when I know everybody's sleeping, when I know the world is at rest, it kind of makes it easier for me to get into the zone.\n\n- If I just spend time away from technology, away from my computer, away from my phone, that's the time when I can really do deep thought.\n\n- I just want to make everything we cannot see in the real life.\n\n- I was living in Bangkok. There's a lot of cars.\n\nThere's a lot of traffic.\n\nSo also creating the game pretty much designed a way for you to escape a little bit.\n\n- Biggest challenges for designing things is that your assumptions are usually wrong. - I kind of had the idea to focus on witchcraft when the election was happening in the United Kingdom and there was a group of individuals who had decided they were going to hex the government.\n\nI think they were pagans.\n\n♪ Piano lounge music ♪ - What's my biggest failure? Just in general? - Well, that's actually a great question.\n\n- Oh, greatest failure? There's a lot of them.\n\nOK, hold on.\n\n- As a person or in my career life? - Uh...\n\n- Let me -- I want to think and really...\n\n- It's kind of hard to answer without making somebody mad.\n\n- Everything. - Failing is part of any creation process.\n\n- We spent, like, months and months trying to iterate and to do something great.\n\n- Our biggest fail in the game was actually at launch that we didn't have enough levels in the game.\n\n- We had gotten rid of the main feature of the app.\n\nYou know, overnight we lost, I think, 20 percent of our users.\n\nInteresting, you know, experience.\n\n- We got some good feedback from some customers, and none of us really wanted to admit that it kind of sucked.\n\n- We're always happy that we did change it.\n\n- My adage was always, if I came up with 50 ideas in a day and 49 were absolutely useless and one was really good, that's a very good day.\n\n- I think it was mostly just staying too long in situations that were not where I wanted to be.\n\nManagement, economics, and law seemed like this super logical way to go.\n\nBut as soon as basically the iPhone was announced in 2007, that was all I was just thinking about.\n\nI think in hindsight, my biggest failure was actually a really good thing because it led me to where I am right now.\n\n♪ Earlier last year, I was working on an app that helped people who are mute to speak on the phone.\n\nAnd then when I had made that, I actually wanted to make something similar but the other way around, so that if you're deaf, and you're listening to a phone call that you can actually see what's being said.\n\n- It started for me just simply trying to solve my own problem, which is not drinking enough water.\n\nI could sit for hours working until I feel like I'm in the middle of the desert.\n\n- Drinking water, it becomes an exciting moment in your day.\n\n- My kids will just -- they'll do something as long as it's on a list and they can strike it off later.\n\nAnd so we wanted that moment when you strike off that habit for the day to really just feel gratifying.\n\n- I was walking around and saw a broken neon sign and that sparked the idea.\n\n- We want to make the best clock app in the world.\n\nSo to do that, we visit many furniture shops to see how the clock feels like when you hold it in your hand.\n\n- In the very first beginning, we wanted to help ourselves.\n\nBecause we were in a meeting, and we can't even take proper notes and at the same time, be really engaged in the meeting; talking to people.\n\nSo we want to do this app to help ourselves.\n\n- After really diving deep into what inclusivity means, it really changes the way we build.\n\n- I was riding up a gondola and this family -- they were pointing out that they really wanted to be able to compare how they were doing versus last year.\n\nSo I went home and wrote it, and a week later it was in the App Store.\n\n- Don't pick up the phone when you're focused and don't open the lid off the pot when cooking noodles.\n\nThese concepts run through the Focus Noodles app.\n\nA user can get into the headspace of covering their phones and start to focus.\n\n- If you love something, you always find a way to learn better.\n\nAnd I want people to love learning Chinese, and I want to make it more playful, more fun, and people will enjoy learning.\n\n- People see this as a game.\n\nWe can be a lot more intentional to create a game using our technology to track your body.\n\nGet you to move your arms, move your body, and basically get you into the rhythm and usually the game is always like this.\n\nThat's where we took the inspiration to create Active Arcade.\n\nJust like choreography; just like teaching you how to dance.\n\n- We were in the middle of quite a long project.\n\nWe realized it would be really good fun to just do a really fast project and we could never lose motivation for it.\n\n- So the concept of the game is you've murdered your husband, and your goal is to make sure other people don't find out.\n\n- The character of Rebel Girls app is like your feminist aunt who is very kind and who's full of stories.\n\nAnd her goal is to make sure that some of the best values are instilled in you.\n\nEmpowering girls to become the most confident generation of girls.\n\n- It's an app that is really the friend you wish you had when you lose a loved one.\n\nIt's the smart checklist to telling you all the things you need to do, but at the same time, only the things you need to do right now and what can wait, but also allowing us to do it for you.\n\n- For Behind the Frame, it's basically an escape room game.\n\nHas that Ghibli kind of feel to feel like playable anime.\n\nWe look at the color scheme of Ghibli and also Renaissance paintings.\n\n- The idea behind Townscaper is you just build beautiful houses.\n\nThat's all there is to it.\n\n- The whole concept is that you're finally able to touch the artwork, something that you're not able to do in real life.\n\n♪ - One of the biggest challenges of designing tools for creative people is that a lot of the tasks that artists want to create, they're quite complex tasks.\n\nSo the challenge is how do we take all that power and make it really usable and simple? - It has to be easy for someone who's jumping straight in and hasn't really done this kind of work before, but it also has to be effortless for professionals as well.\n\nMaking something simple is quite complex.\n\n- There are so many tiny details that go into creating an experience.\n\nThere was no way for it not to feel really clunky.\n\nThe next four and a half years of development was a lot of kind of stripping those things away.\n\nAnd how do we get rid of the things that might otherwise distract people so that they can actually focus on this moment that we're trying to create? - It was incredibly hard.\n\nGraphic design, as we know it, is kind of coming from the desktop-world era, and didn't really have a lot of innovation in the last decades.\n\n- I'd approached it similarly to designing a building -- both you need to navigate through.\n\nWith a website, or even with an app, you have different views.\n\nYou have an entrance.\n\nAt a certain point you have an exit; you have different rooms, and the experience needs to be good.\n\n- My watercolor skills are horrible.\n\nMy code development is at the HTML levels.\n\nSo I also need to convince other people, through my journey, to build these things with me.\n\nWhen we put it out, there was no other watercolor game like it or even watercolor app.\n\nSo I really worked heavily with getting in all the small details, getting the water to flow correctly and getting it to just feel really nice.\n\n- Pushing the limits has never been the problem.\n\nThe whole team loves to do that, loves to see how far they can take a character or how much story we can get into this scene.\n\nThe challenge is to keep limits on that so we can actually get it done.\n\n- If you can create something that people cannot see in the real life, then sometimes they will feel \"wow\" at that moment and we will feel so satisfied.\n\nYeah, so this is why we choose optical illusions.\n\nFor most people, when you see some optical illusion, you are just wowed.\n\n- It was quite a tricky problem to solve of just making sure that you could be playing on a bus, but you don't notice that you're on the bus anymore.\n\nIt's all of the little things that build up the immersion, not the big, obvious ones.\n\nSo the scuttling noises, steam vents, things like that.\n\n- We had huge geometries and landscapes and things that we wanted to make really quick and custom.\n\nWe would just use our tool that we designed, and it would automatically Lego-ify it.\n\n- Our goal was to design a very focused experience for touch devices.\n\nThe player can interact with this world without having to think about.\n\nThat might sound simple, but it's actually one of the hardest things to pull off.\n\n- Marvel Future Revolution is an open-world, superhero, action MMO RPG on mobile.\n\nSo it's got all your favorite Marvel superheroes saving the world with all your buddies and friends.\n\nThe fact that you could actually have the true superhero experience and you could actually take it everywhere with you.\n\n- I think that from the very beginning we knew we wanted to make a game that was a mix between music and story.\n\nI mean, everything is in the name of the game, you know.\n\nSo there's this character, Gabrielle, who's in a coma.\n\nYou have to play music to unlock memories.\n\nTo make this whole game, it was a gigantic process, but I mean, it was a fantastic one.\n\n- I thought, \"Cameras are so delightful; maybe we can bring, like, a semblance of that delight to an iPhone camera.\" I get emails every month -- every week, sometimes -- of people saying, like, \"I really enjoyed that.\n\nIt really helped a lot.\" And that's so cool. - This app that we had created actually convinced people to get rid of their vehicle and made riding public transit fun.\n\nAnd from that point on, I think the motivation became that transit can have an impact on people's transportation choices.\n\n- Mental health was one of those glowing beacons of need where the skillset of a designer and a product thinker are deeply needed, directing a lot of our attention toward traditionally underrepresented populations and showing up in a way that, we like to say, opens a front door to care.\n\n- Apps and games have to tackle social change.\n\n- An inclusive game or app is something that everyone feels at home.\n\nEveryone can...\n\n- ...have fun, yet still connect with people.\n\n- That authenticity allows us not to just have kind of symbolic diversity, but actual diversity.\n\n- I think if we want to see social change, then we need to exhibit it, especially in entertainment because it shows people where we can go.\n\n- I think I really started to think, \"Hey, I can now make things that help people and solve the world a little bit.\" - I think over the last two years, especially, like, we're seeing where we're going, where we're going to spend more and more of our lives digitally in this world.\n\nAnd how do we, as people, shape those everyday experiences? - A tip I could give to the young developers is stick to your original idea.\n\n- If you're only getting inspiration from all the other games that you love, it's just going to be another game.\n\n- Try, fail, and try again. And fail. And try again.\n\n- Make as much as you can.\n\nThey don't have to be huge.\n\nThey don't have to be exciting.\n\nBut the more you make, the more you learn how to make.\n\n- When to leave it alone and stop tinkering on it.\n\n- Really figure out what the game is before bringing people on.\n\n- Don't get frustrated.\n\n- Let go of some of your assumptions.\n\n- Trying to decide what the market wants doesn't really make sense.\n\nIt's like, do something that you're going to be motivated to keep working on, that you actually want to exist in the world.\n\n- You can steal, but steal from the best and always add your own kind of magic fairy dust.\n\n- Get inspired.\n\nGet inspired by what's out there and what's adjacent.\n\nAnd look at what techniques are in there and how you can approach it from a totally fresh start with the things and the biases that you have.\n\n- The Apple Design Award, it is like the Oscar. - I couldn't believe it. I was like, in tears, basically.\n\n- I didn't know who I can tell. It's like, oh my God.\n\nI think something -- the most amazing thing happened and there was no one in the room I could share it with.\n\n- I remember seeing some tears in his eyes.\n\nIt means a lot to me as well, because I was the one that asked him to quit his job.\n\n- Are they still asleep? I mean, come on.\n\nIt's the Apple Design Awards happening over here.\n\n- Very first reaction when I received the email.\n\nOK, it's probably a spam.\n\nThen I was like, hmm, it's a good spam.\n\nAnd then I started talking about it with the team, and, like, everyone was like, \"What?!\" - Well, what would I want to say to my fellow finalists? Best of luck.\n\nYou've built something that's amazing, whether it gets an award or not.\n\n- And now we become the Apple Design Awards finalists.\n\nIt's like every day I'm in the highest point in my life.\n\n- We made it! - I remember the moment when I first heard it, it was quite emotional for me.\n\nSo I hope they're also looking back at their progress and their work over the last year or more.\n\n- Great job and congratulations.\n\n- Congratulations to everybody.\n\n- Congratulations.\n\n- Congratulations! - It's an honor to be amongst you.\n\n- Great job.\n\nAnd let's keep on building it.\n\n- Your continuous work and creation and your effort will make a difference.\n\n♪ Upbeat electronic music ♪ ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/113/1/62CF83FA-0B10-4D25-A188-368E2557F674/downloads/wwdc2022-113_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/113/1/62CF83FA-0B10-4D25-A188-368E2557F674/downloads/wwdc2022-113_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:36:32.476Z"
}