{
  "id": "10167",
  "year": "2022",
  "url": "https://developer.apple.com/videos/play/wwdc2022/10167/",
  "title": "Create your Privacy Nutrition Label",
  "speakers": [],
  "duration": "",
  "topics": [
    "Privacy & Security",
    "System Services"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi, I'm Ben, from Privacy Engineering, and welcome to Create your Privacy Nutrition Label. At WWDC 2020, we announced privacy nutrition labels to provide people with an easily glanceable and understandable summary about how the apps they use collect and use data. In this talk, we'll discuss strategies for creating an accurate label and highlight some definitions and examples to keep in mind as you build your label.\n\nNutrition labels are one of many ways you can communicate your app's privacy practices, in addition to a privacy policy and App Privacy Report. Labels can help you explain to people how you use the data your app collects. Additionally, sharing a label is a requirement for all apps in the App Store. On an app's nutrition label, you can see data the app collects that is used for tracking, data that is linked to identity, or associated with an account or profile, and data that is not linked to identity.\n\nIn each section, the categories of data collected are shown.\n\nAlternatively, if data is not collected, an alternate label is shown.\n\nFrom an app's product page in the App Store, you can also view a more detailed version of the nutrition label that includes the specific types of data the app collects and how that data is used.\n\nToday we'll be looking at nutrition labels in more detail. We'll walk through the process for how to create your label in App Store Connect, and I'll share some resources along the way.\n\nAdditionally, we'll provide some more detailed definitions and examples to help you answer privacy questions for your app.\n\nLet's begin with label creation process. To create your label, you'll be asked about what data your app collects, use cases for each type of data, and how that data is stored. You might want to start with creating an inventory of your app's features and data collection. An inventory can be a helpful resource for the next step, where you'll enter information about your app's privacy practices into App Store Connect. After you submit your label, and as you update your data practices, you should keep your label updated as appropriate.\n\nLets dive right in and look at how you can go about crafting an inventory for your app.\n\nWhen you submit your label to App Store Connect, you'll answer some questions about how your app uses data. You'll be asked about the categories of data collected by your app, the use cases for the data, whether the data is linked to identity, and whether the data is used for tracking.\n\nHowever, as a developer, you might not be thinking about data categories in your app. You're probably thinking about features, and if you're not sure where to start on building the nutrition label, list out your app's features.\n\nThen consider what data powers each feature, including what data is retained and how that data is used. You can then keep this list as a reference for when you're asked to enter specific details into App Store Connect. We recommend finding a framework to document this information that works for your app, and you may have many strategies to build an inventory or other documentation.\n\nWhen creating this inventory, there are a number of resources that you can use along the way. Make sure to reach out to the stakeholders working on your app. For example, you can check with your marketing team to understand what data they use and work with legal counsel to ensure you document all data uses described in your app's privacy policy.\n\nWe also recommend consulting internal documentation in this process.\n\nConsider looking at your app's network traffic using App Privacy Report or a network proxy tool. You can use this information to learn what domains your app is contacting and follow up with the owners of those endpoints to understand how data is being used. Keep in mind that while a network audit may be helpful in discovering where your app sends data, it is not comprehensive, and you should use it in combination with other strategies.\n\nYou should also audit any data you retain on a server, such as by reviewing database schemas and checking what systems have access to data.\n\nAdditionally, make sure to check with any partners that may be processing your app's data, as you are responsible for declaring the collection practices of all data collected from your app, including data collected by third-party SDKs, analytics tools, advertising networks, or other external vendors.\n\nMany SDKs provide documentation of their privacy practices, and some provide specific guidance for nutrition labels which you can use to ensure your label is comprehensive.\n\nWhen building this inventory, you might also discover that there is data that you're collecting that you don't need. Inventorying your privacy practices can be a way to identify opportunities to make changes to your app's practices by minimizing data collection, processing data on device, and storing data not linked to identity.\n\nFor some new technologies you can use, see What's New In Privacy. Once you've built up an inventory or documented your data practices through your preferred process, you'll work though responding to the questions in App Store Connect.\n\nIn App Store Connect, account holders, admins, and app mangers can enter your app's privacy label. From your app's page, open the App Privacy section.\n\nFirst, you'll be asked about whether your app collects data. Data is considered collected when it is transmitted off device in a way that is accessible for longer than to service the request in real time. So if you or any of your partners retain data about interaction with the app on a server, such as server logs, a user profile, or analytics, your app likely collects data.\n\nWe designed labels to describe all data apps collect. You should declare all data collected by your app, even if people agree elsewhere to the data collection or use.\n\nLabels are a supplement to a privacy policy and any requirements for user transparency or consent for data collection.\n\nWe recommend working with legal counsel to evaluate those requirements. If you do collect data, you'll be asked to declare the categories of data collected from your app, such as email address, phone number, or payment info.\n\nYou'll then be able to preview your label in progress and provide more detail for each data category.\n\nLet's work on phone number. For each category of data, you'll be asked to declare what use cases the data collection supports, such as analytics or product personalization.\n\nYou'll then be asked to disclose whether data is linked to a user's identity.\n\nData is considered linked to identity if it is associated with an account, device, or user profile. This can be an opportunity for you to evaluate whether you need to store data linked to identity, and whether you can store data in a way that isn't linkable to any account or profile.\n\nFinally, you'll be asked whether each data type is used for tracking purposes.\n\n\"Tracking\" refers to linking data collected from your app about a particular end user or device, such as a user identifier, device identifier, or profile, with third-party data for targeted advertising or advertising measurement purposes, or sharing data collected from your app about a particular end user or device with a data broker.\n\nAs mentioned earlier, nutrition labels are intended to reflect all data your app may collect, even for features where people using your app agree separately to data collection or use. Ensure you disclose any data categories used for tracking on your nutrition label. Additionally, as all tracking must be with permission, adopt App Tracking Transparency if appropriate for your app.\n\nFor more information about tracking, see Explore App Tracking Transparency.\n\nOnce you've submitted this information for all data your app collects, you'll be able to preview and publish your label. Your label will be published immediately, independent from any updates to your app.\n\nNow that you've created your label, let's consider when you'll need to update it. You can update your label at any time, and aren't required to release a new version of your app. We recommend re-evaluating your app's label when releasing new features and on an ongoing basis.\n\nAs you change how your app uses data, ensure your label remains up to date. If you're adding new features to your app, implementing new or updated integrations with third-party partners or SDKs, or using already-collected data in new ways, make sure to evaluate whether any label changes are needed. Now that we've worked through the process of building your privacy nutrition label, we'll discuss some additional guidance around policy definitions and examples. All of this information is available in the Apple Developer documentation. Today I'll be highlighting a few examples based on our experience at Apple building nutrition labels for our own apps, and from some questions we have heard from developers.\n\nYou might wonder how to disclose use of IP address. IP addresses can be used for multiple purposes, including as an identifier or to infer approximate location. Our guidance is to declare the collection categories based on what the IP address is used for. For example, if you use IP address to show local content or for location analytics, declare location.\n\nAnother area to note is the categories including product interaction.\n\nProduct Interaction covers data collected about the user's interactions inside the app, such as information about which screens people open.\n\nBrowsing history refers to collection of activity that is not part of the app, such as an in-app browser. Search History is searches performed within the app for any content, both in the app or in in-app browsers.\n\nLabels are intended to comprehensively describe the app's primary functionality and features encountered by all of your app's users.\n\nHowever, there are certain types of collection that are optional to disclose. Collection that is infrequent, optional, and independent from the app's primary functionality, clearly discloses all collection at submission time, and has limited use purposes, for example, not used for tracking or advertising, may be optional to disclose.\n\nFeedback forms and report-a-problem flows are some features that may meet these requirements.\n\nFull details and requirements for the optional disclosure policy are available on the \"App privacy details on the App Store\" page in Apple Developer documentation. And that's a wrap! Here are four things to keep in mind while building your label. Make sure to reach out to all stakeholders working on your app to inventory your collection and ensure your label is accurate.\n\nRemember to include all collection from your app, including from SDKs and other partners.\n\nIf applicable to your app, ensure you request permission for tracking, in addition to disclosing any use on your nutrition label.\n\nFinally, when you update your app or change how you use data, ensure your label is updated.\n\nThanks for joining me today. Privacy Nutrition Labels are a way to build trust with people who use your app and help people understand how you use data. The Apple Developer Documentation and App Store Connect have even more information to reference throughout the process of building and updating your label.\n\n♪ instrumental hip hop music ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Protecting the User’s Privacy",
        "url": "https://developer.apple.com/documentation/UIKit/protecting-the-user-s-privacy"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/10167/5/043ACD7F-3BC9-4AA1-A5BC-7DCCF91098EA/downloads/wwdc2022-10167_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/10167/5/043ACD7F-3BC9-4AA1-A5BC-7DCCF91098EA/downloads/wwdc2022-10167_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10060",
      "year": "2023",
      "title": "Get started with privacy manifests",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10060"
    },
    {
      "id": "10166",
      "year": "2022",
      "title": "Explore App Tracking Transparency",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10166"
    },
    {
      "id": "10096",
      "year": "2022",
      "title": "What’s new in privacy",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10096"
    }
  ],
  "extractedAt": "2025-07-18T10:42:47.725Z"
}