{
  "id": "10044",
  "year": "2022",
  "url": "https://developer.apple.com/videos/play/wwdc2022/10044/",
  "title": "Discover Benchmarks in App Analytics",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ Mahesh Molakalapalli: My name is Mahesh Molakalapalli. I am an engineering manager on the App Store and App Analytics team. Our goal with App Analytics is to help you grow your business by providing you with the unique insights about your app. Today, I am going to introduce you to an exciting new feature called App Benchmarking that will help you get better insights than ever before. We will begin with an overview of benchmarking. Then we'll talk about the metrics for which you can see benchmarking data. Next, we'll show you how we create relevant benchmarks while protecting the privacy of all apps. And we will wrap up by showing you how you can take action on insights gained from benchmarking. Let's get started. Many of you may already use App Analytics. In this tool, we share data with you about your app's acquisition, usage, and monetization. Let's say that you are a developer of an app called Mountain Climber, which is a travel app offering subscriptions. The overview page shows how Mountain Climber is performing over time, across key performance metrics that allows you to monitor results in each stage of the customer lifecycle, from awareness to conversion and on to retention. Since you're focused on growth, let's say that one of your top business priorities for your app has been to improve your conversion rate. Looking at the data, you have been making steady improvement, with a 5.5% increase over the last 90 days. But what is unclear is how much more improvement you might be able to achieve with continued effort. Do you have more opportunity to grow, or should you focus your efforts somewhere else? That's where peer group benchmarking comes in. You can learn about the performance of apps that are similar to your app in a privacy-friendly way, and check how you are performing relative to them. Like your Mountain Climber app, all the apps on the right hand side are travel apps, with a subscription business model. Let's take a look at how your App is doing compared to this group.\n\nYou can see the same apps, arranged left to right, from lowest to highest conversion rates. So how does your app stack up against all the others? Although your conversion rate has been improving over time, you are still in the bottom half of your peer group. There's plenty of room for improvement. Benchmarking provides insights like this without revealing the performance of any individual app in your peer group.\n\nWe do this by including enough apps to provide meaningful results in the aggregate so that it doesn't reveal any individual app's performance. And in order to show your relative position, we show you what the distribution of your peer group looks like such as the 25th, 50th, and 75th percentiles of your group.\n\nYou will then be able to see how you are performing relative to your peer group, and understand whether you have growth opportunity, or whether you're already beating the competition. Now that you have an idea of what peer group benchmarking is and why it is so important, let us talk about the metrics that you will be able to use in this feature.\n\nOne of our goals with benchmarking is to give you insight into how your app is performing throughout the customer lifecycle. That's why we will be offering benchmarks for metrics related to acquisition, usage, and monetization. To help you measure your acquisition efforts, we will provide you with conversion rate benchmarks. Conversion rate helps you understand how often people download or redownload your app after seeing it on the App Store. The higher your conversion rate, the more efficiently you are acquiring your customers.\n\nTo help you measure usage, you will be able to see Day 1, Day 7, and Day 28 retention. Retention helps you understand what percentage of people return to your app one day after download, seven days after download, and 28 days after download, and is a good indicator of how engaging your app is for your customers.\n\nYou will also be able to see how your crash rate stacks up against your peers. If your app is prone to crashing more often than normal, it may negatively impact your engagement and monetization metrics, so it's good to keep this as low as possible.\n\nFinally, to help you evaluate your monetization strategy, you will be able to see benchmarks around average proceeds per paying user. This will allow you to see how much money your peers take home from each of their paying customers, so you can see how you compare. Now that you know what metrics you will be able to see, let us talk about relevancy and privacy. Throughout the development of this feature, we have strived to create peer groups that are highly relevant to you and your business, while also protecting the privacy of each app within that group. This helps us meet our goals of providing you with helpful insights, without revealing the performance of any individual app. Let us discuss two examples of how we will make the peer groups relevant to you, no matter what kind of app that you have on the App Store. First, we will use a number of attributes that we have on the App Store to create your peer groups, including the app's App Store category. For example, if you have put your app in the travel category, we will group you with other apps that also put themselves in the travel category. Second, we will also look at how your app monetizes on the store. For example, is it a free app, freemium, paid, paidmium, or subscription? Since apps with different business models have different expectations about user behavior, this is also a very important factor for creating relevant peer groups. Each attribute that we use to create your peer groups has been tested to ensure it allows for meaningful comparisons over time between your app and its peer group. Next, let's talk about privacy. At Apple, we have significant experience with building great products that also have great privacy, and we used that experience here. In order to accomplish our privacy goals, we use a technique called differential privacy, which is the gold standard for ensuring that aggregated data can remain both helpful and private at the same time. When we calculate your peer group's overall conversion rate, we add small amounts of noise to each data point we share about your peer group. We also ensure that enough apps are in your peer group so that it is not possible to know whether a particular app is in or out of your peer group, because the noise added to the data set is large enough to obscure the exact makeup of the peer group, while still providing useful information about your peer group in the aggregate. This protects the privacy of your app and all the other apps in the peer group. Let us end by taking a look at how you can use other tools to take action on this information.\n\nThe App Store provides a number of developer features that enable you to optimize and improve your performance across the customer lifecycle. For example, to have a great conversion rate, you need to have a great App Store product page, and the App Store offers you tools to help. With product page optimization, you can test different app icons, screenshots, and app previews to find out which combination of features works best with your customers. And with custom product pages, you can create unique product pages for different audience that focus on their specific interests, rather than having one product page for all customers. Both of these features can help you boost your conversion rate. In order to improve your usage metrics, you can utilize in-app events and App Clips. In-app events are timely events within apps and games– such as game competitions, movie premieres, or livestreamed experiences– that you can showcase on the App Store to engage new customers and re-engage existing customers. And an App Clip is a small part of your app that is discoverable in relevant public places so your customers can complete a quick task from your app. For example, whether ordering take-out from a restaurant, renting a scooter, or setting up a new connected appliance for the first time, people can launch the App Clip to easily start and finish the task. And finally, to improve your monetization, you can try out different pricing tiers so that users can customize their experiences based on their preferences and the amount they want to pay. Or you can create a promoted in-app purchase, which lets users browse the items for sale directly on the App Store, even before they download your app. To conclude, by combining peer group benchmarking with other App Store tools, you can make meaningful progress in the areas where your app needs it the most. We invite you to go to developer.apple.com/app-store to learn more. Here is a quick summary of what you've seen today. Peer Group Benchmarking is an exciting tool that will let you compare your App Store performance against a group of similar apps on the store. We have designed Peer Group Benchmarking using differential privacy to provide relevant insights without revealing the information about any individual app. By using Peer Group Benchmarking in combination with other developer features on the App Store, you will have the ability to boost your app's performance on the App Store. You will be able to start using Peer Group Benchmarking early next year. Thank you.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/10044/4/A6EC2B38-5E5C-44B0-8CB4-F4B0118ADE6E/downloads/wwdc2022-10044_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/10044/4/A6EC2B38-5E5C-44B0-8CB4-F4B0118ADE6E/downloads/wwdc2022-10044_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:19:26.648Z"
}