{
  "id": "101",
  "year": "2022",
  "url": "https://developer.apple.com/videos/play/wwdc2022/101/",
  "title": "Keynote",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ ♪ ♪ ♪ ♪ ♪ ♪ Tim Cook: Good morning, and welcome to WWDC. We have a big day of announcements about our latest technologies and platforms. These platforms, and the products they drive, deliver amazing experiences for our users and provide developers with incredible opportunities so they can use their superpowers to innovate, create, and collaborate, making apps that continue to change the world. And WWDC is designed to give this community what they need to do their very best work. We love to support our developers beyond WWDC with comprehensive world-class support and other important initiatives. We just opened our brand-new Developers Center across from Apple Park where developers can engage with our engineers. And to reach our global community, this past fall we introduced our first online Tech Talks for developers to learn more about our new technologies and directly connect with Apple engineers in live sessions and one-on-one office hours.\n\nWe are also committed to cultivating the next generation of developers, including efforts to reach underrepresented communities. So our developer academies teach students the fundamentals of coding as well as the other necessary skills to find and create jobs in the app economy. There are 17 around the world including the academy in Detroit we founded in October as a part of Apple's Racial Equity and Justice Initiative. And in Saudi Arabia, we launched our first developer academy for women in February. Our Entrepreneur Camps provide developers from underrepresented communities with mentorship, inspiration, and insights from Apple. The first camps were for female founders, and this past year, we expanded the camps to reach Black and Latin founders. Alumni have gone on to secure major funding and see great success on the App Store.\n\nThese ongoing efforts empower all developers with the tools, technologies, and inspiration to change the world for the better.\n\nLast year, many millions of developers engaged in WWDC, and we expect millions more to join us again this year. In fact, we're excited to say we've grown our developer community to over 34 million Apple developers. We have a huge week ahead of us, with an amazing online experience, including sessions, labs, and digital lounges, which will all be available for free to our developers. Today, we're going to push our platforms further than ever for our developers and our users. So let's get started by sending it over to Craig. ♪ ♪ Craig Federighi: I'm really excited about what we have to show you today. But first, let's head downstairs. ♪ ♪ ♪ ♪ Now, let's talk about iOS. Together with iPhone, iOS helps you get so much done, whether you're at home or on the move. And the next release, iOS 16, offers new intelligence, sharing, and communication features that are going to enhance so much of what you do with your iPhone. And those come together with an incredible set of new personalization features that will make your experience feel fresh and completely you. Let's get started with the all-new Lock Screen. The Lock Screen is the first thing you see every time you pick up your iPhone. It's a place where you can check the date and time, look out for key messages, and launch the camera to quickly capture the moment. And it's just as much a place for personalization, where so many of you put a photo that makes iPhone uniquely yours. In iOS 16, we're bringing the biggest update ever to the Lock Screen, completely reimagining how it looks and works for you. Let's take a look.\n\n♪ ♪ ♪ ♪ ♪ ♪ Craig: The new Lock Screen remains undeniably iPhone, while also giving you new ways to make it more personal, beautiful, and helpful than ever. Let me show you. Here's my Lock Screen. You'll notice the subtle depth effect with my daughters appearing in front of the time. I really love it. Now, if I just press and hold, I can personalize it further. I'll just tap Customize, and now I'm in the editor. Now, check this out. I can simply swipe to try out different styles that automatically change the color filter, the background, and the font for the time, all to complement each other. These look really beautiful. So let's go with this one. Now, of course, if I want to change anything, it's easy to dial it in further to get it just the way I want it. All I need to do is tap on any element of the Lock Screen to start editing. So let's customize the font. I can audition different typefaces and choose from different colors. And I like this color. I'll just adjust the shade a little bit. I think this looks awesome now. Now, I can also make my Lock Screen more helpful by putting widgets right on the Lock Screen. So let me move the girls down here and tap in to bring up the widget gallery. And these are really useful for getting information at a glance, like upcoming calendar events. So I'll add the temperature, my Activity rings, and let's drag in the calendar widget. Now, this is great. And what's even better is, I'm not limited to just one. Let's create another. I can bring up our brand-new wallpaper gallery, which showcases a bunch of options for inspiration. And there are plenty to choose from here. So much room for personalization, with millions of combinations. With Photo Shuffle, I can choose a set of photos to shuffle throughout the day, And we also have Suggested Photos, intelligently curated from my personal library, like the best shots of family that look great on the Lock Screen. Now, this is an awesome one to add to my collection. Now, I've created a bunch of other Lock Screens, and by simply swiping, I can switch between them. It's amazing the range you can create. Here's Weather, which shows live weather conditions like a downpour and lightning. I just love this animation. Here's a really cool emoji wallpaper and our Pride wallpaper. And here's one from our Astronomy collection. Watch how it animates fluidly as I swipe into the Home Screen. So cool. So that's a quick look at the all-new Lock Screen. And for developers, WidgetKit makes it quick and easy to put glanceable information from their app here as well.\n\nThe new Lock Screen is so beautiful, we wanted to make sure that you can always enjoy it, even if you get a lot of notifications.\n\nSometimes, notifications can cover up your personal photo. So we've rethought how they appear. Notifications now roll in from the bottom of the Lock Screen as you receive them, and you can choose to hide them throughout the day. Now, sometimes you get a bunch of notifications from an app, like when you're following the score of a basketball game. Well, now there's a better way to keep tabs with something called Live Activities. Live Activities make it easier to stay on top of things that are happening in real time right from your Lock Screen. And for developers, starting in an update to iOS 16 later this year, they can use the Live Activities API to create these compact and glanceable experiences. This will make it really easy to follow that NBA game, track the progress of an Uber ride, see how you're doing on your workout, and more, all while letting the other elements on the Lock Screen shine. One of the most popular activities for many of us is listening to music. And now with Live Activities, the Now Playing controls can expand to a full screen view that celebrates album art while you listen along. So that's the all-new Lock Screen. There are some really powerful ways these updates tie together and build upon what we introduced last year with Focus. Focus has helped people reduce distractions and stay in the moment. And this year, we're taking it further, starting with extending Focus to your Lock Screen. This means your choice of a photo and widgets can all be tied to a particular Focus. And now that you can have multiple Lock Screens, you can match them to the appropriate Focus throughout your day. You can have a dedicated one for when you're in a Work Focus, with widgets showing your upcoming meeting or to-do list. Or, with just a swipe, you can activate your Personal Focus. All of your corresponding notification settings apply, and it extends to your Home Screen too. So now you can elevate your favorite apps or widgets for keeping up with friends and family. And now, your Focus can also carry into the apps themselves, with Focus filters, which let you filter out distracting content. Let's take Safari, for example. Instead of seeing all of your websites, you can turn on the Work Focus filter and see only the tabs that relate to work. And you can filter not just tab groups in Safari, but also conversations in Messages, accounts in Mail, and events in Calendar. And for developers, we have a new API so they can help you focus in their apps as well. These updates to Focus can help you draw boundaries and find balance throughout all of the moments in your life. Now, let's talk about what's in store for Messages. Hundreds of millions of people rely on Messages every single day. It's integral to how we communicate with the people who matter most. And now, we're adding three of the most highly-requested features to Messages.\n\nFirst, have you ever sent a Message only to immediately realize you didn't quite say what you intended? Well, no worries. Because now you can edit any message you just sent so embarrassing typos can be a thing of the past. Second, have you ever wished you'd never sent that message at all? Well, good news–now you have undo send, so you can immediately recall a recent misfire. And finally, you can now mark any thread as unread, a perfect tool if you don't have time to respond in the moment and want to be sure to come back to a message later. These three features are going to make a big difference in how you use Messages every single day. Messages makes texting easy and efficient, and it's also a great way to share. Last year, we introduced Shared with You, which takes things like photos, links, and music that your friends share with you in Messages and highlights them right in the app where you'd like to enjoy them later. And for developers, we're really excited to make Shared with You available with a new API. So when someone sends you a funny video, a worthwhile article, or a recipe that you don't have time to check out in the moment, it'll be there waiting for you the next time you open that app.\n\nAnd when it comes to sharing in real time with others, people are loving SharePlay. It's stellar for enjoying shared experiences while connecting over FaceTime. Like watching TV shows, listening to music, or breaking a sweat to a synced up workout. So many of your favorite apps are using SharePlay to create shared experiences, like listening to bedtime stories together with Better Sleep or playing a rowdy game of Heads Up, no matter how far apart you are. And this year, we're making it easier to discover all of these awesome SharePlay experiences from within your FaceTime call. With just a tap, you can jump into SharePlay-supported apps that you already have on your phone, or discover new experiences that you can share with your friends. And to give you more opportunities to enjoy shared experiences, we're extending SharePlay beyond FaceTime and bringing it to Messages. This was the number one request from developers. Now when you find something you want to share, like a movie on Disney+, you can kick off SharePlay right there and enjoy it together while chatting in Messages. You can watch in sync, and you've got the same instantaneous shared playback controls that make SharePlay magical. So whether you're using SharePlay for your weekly movie night or marking a message unread so you can respond later, Messages has everything you need to connect with ease. And we're making it that much easier to compose Messages with some updates to Dictation. To tell you more, here's Robby.\n\nRobby Walker: Dictation lets you type just by speaking and can be much faster than typing with the Keyboard. This is why it's so popular for taking notes, sending messages, and more. In fact, Dictation is used over 18 billion times each month. And it's designed to protect your privacy. Thanks to the Neural Engine, Dictation can happen entirely on-device. Today, we're excited to introduce an all-new on-device Dictation experience that lets you fluidly move between voice and touch. Let's take a look. We'll use our new dictation experience to send an email. Now, when I start dictating, the keyboard stays open, so I can switch between using voice and touch.\n\nI can even select text using touch and replace it with my voice.\n\nJust by speaking. Are you sending a longer message? Dictation automatically adds punctuation to the text.\n\n\"That's so cool! Mind blown emoji!\" Automatic punctuation and emoji dictation also work when you send messages with Siri. And this year, we're making it easier to use Siri with apps. There are over 15,000 apps that work with Siri using SiriKit and Siri Shortcuts. And today, these require manual setup. So we're introducing a new developer API built using the Swift programming language called App Intents. Now shortcuts work with zero setup so you can use Siri to get things done with supported apps. Now let's talk about another feature powered by intelligence: Live Text. Live Text is so useful because it's deeply integrated across the entire OS, letting you interact with text in images across the system, from Camera and Safari to Notes and Screenshots. And this year, we're excited to take this integration further by bringing Live Text to video. Now you can pause a video on any frame and interact with text just like you can today with photos. It's great for copying code samples. We're also accelerating the things you do with Live Text with quick actions. So now you're just a tap away from converting currency and translating a foreign language. And for an even richer translation experience, you'll be able to use Live Text while in the Translate app, with our new camera view. This will be great for when you have lots of text to translate. And for developers, we're also excited to announce a Live Text API. Soon you will be able to grab text straight from photos and videos in apps like Vimeo. And photos are about more than just text. That's why last year we introduced Visual Look Up, a feature that recognizes objects like pets, landmarks, plants, and more, and gives you rich information about what's in your images. And this year we have a new feature that takes image understanding further.\n\nNow when you touch and hold on the subject of an image, you can lift it away from the background and place it in apps like Messages. It feels like magic. It's actually the product of an advanced machine learning model which is accelerated by CoreML and the Neural Engine to perform 40 billion operations in just milliseconds. Together, Live Text and Visual Look Up continue to unlock rich and useful information from your photos and videos across iOS, iPadOS, and macOS. Back to you, Craig.\n\nCraig: These intelligence features help you get things done with ease. And another app that makes life easier is Wallet. To tell you about what's new in Wallet, I'll hand it over to Corey.\n\nCorey Fugman: With Apple Wallet, we're working hard on our goal to replace your physical wallet. Take what we're doing with driver's licenses and ID cards. We're excited to have launched Maryland and Arizona, with 11 additional states actively working on deployments. And the first locations now accepting Wallet IDs are select TSA security checkpoints. You'll also be able to securely present your ID to apps requiring identity and age verification. To protect your privacy, only the necessary information will be shared. So rather than providing your exact birthday, you can simply share that you are over 21. Now, let's talk about Keys. Our growing suite of keys in Wallet makes it easy to access everyday places like your home, car, hotel, and office, all with just your iPhone. And now we're making sharing keys even easier with your favorite messaging apps like Mail, Messages, or WhatsApp. When your friend receives the key, they can add it to their Wallet with a single tap. And to let you share keys with people who don't have an iPhone, we're working with the IETF to make sharing keys an industry standard that is free for others to adopt. We are seeing tremendous enthusiasm from our partners, with more of them signing on to support keys for all of the places you visit. Now let's talk about Apple Pay, one of the most important areas of Wallet. We've made a lot of progress with Apple Pay acceptance in stores and online, and now we're expanding even further. Starting this month with Tap to Pay on iPhone, millions of merchants across the U.S. can accept contactless payments directly on iPhone with no additional hardware or payment terminal needed. Beginning with apps from these payment providers, Tap to Pay on iPhone enables small merchants and large retailers to use iPhone to securely accept payments. In addition to expanded acceptance, we're also enhancing Apple Pay to support new types of payments. So we are thrilled to announce Apple Pay Later. Apple Pay Later lets you split the cost of an Apple Pay purchase into four equal payments spread over six weeks with zero interest and no fees of any kind. And Apple Pay Later is available everywhere Apple Pay is accepted in apps and online. You can now get that espresso machine you've wanted and pay for it over time with no additional cost. For developers and merchants, Apple Pay Later requires no integration. It just works using their standard Apple Pay implementation. Upcoming payments are managed through Wallet, making it easy to keep track of what's due when and to stay within a budget. And after you've placed your order, we have another brand-new feature that helps you track it. Apple Pay Order Tracking enables merchants to deliver detailed receipt and tracking information directly to Wallet, making it easy to get the latest information on all of your Apple Pay orders delivered securely and privately to your device. Apple Pay Order Tracking will be offered at millions of merchants through eCommerce platforms starting with Shopify. So that's our Wallet update. Back to you, Craig.\n\nCraig: With ID cards available in more locations, new ways to use and share keys, Apple Pay Later, and Apple Pay Order Tracking, Wallet makes life so much easier, no matter where you go. And the best way to get wherever you're going is with Maps. So let's get out of here to talk about what's new. ♪ ♪ We're building the best map to help you navigate and explore the world. We've launched our redesigned map in ten countries and regions, and we're excited to announce that later this year, we'll bring the new map to 11 more, including France, Switzerland, and New Zealand. Our new map includes great features like cycling, Look Around, and so many more. And with the new city experience, we pushed it even further with unprecedented detail for landcover, roads, and elevation, as well as improved driving and transit navigation. And we're adding Las Vegas, which looks stunning. And before the end of the year, we'll add six more cities including Miami, Chicago, and Sydney. To tell you more about what's new in Maps, here's Meg.\n\nMeg Frost: With iOS 16, we're introducing great updates for Maps users and developers. Let's start with one of our most requested features: multistop routing. You can now plan up to 15 stops in advance. Maps will now store previous routes in Recents so they're easy to get back to and you can plan multi-stop routes on the Mac and send them to iPhone when you're ready to go. And, of course, when you're driving, you can ask Siri to add additional stops to your route while safely keeping your eyes on the road. Next, let's talk about getting around with transit. We're making it easy for riders to see fares for how much their journey will cost along with the ability to add transit cards to Wallet. And if a transit card balance is running low , you'll receive an alert so you can reload it without having to leave Maps. And for developers, we're making big improvements to MapKit, starting with our revolutionary new city experience which includes rich details for landcover, roads, landmarks, and more. Developers like Bird can now integrate this detailed map so users can more easily locate bikes and scooters to get around town. And it looks stunning in both Light and Dark Mode. And there's more. We're also bringing Look Around to MapKit, making it easy to integrate high resolution imagery from Maps into apps like Zillow, helping users get an immersive ground-level view while browsing homes. And finally, we're excited to announce that later this year, developers will have faster and more flexible ways to build incredible Maps experiences with brand-new server-side APIs. And that's a quick look at Maps. Back to you, Craig! Craig: Now, let's talk about sports. Sports can bring people together in meaningful ways, whether a heated rivalry among friends or a whole town rooting for their team. And at Apple, we want to create great experiences for sports fans everywhere. To tell you more, here's Rubie. ♪ ♪ Rubie Edmondson: Today, there are many ways to keep up with your favorite sports, like being able to ask Siri about players or teams or see live games, no matter where they're streaming. And now with Live Activities, the Apple TV app brings you scores and play-by-play action right on your Lock Screen. We also recently premiered Friday Night Baseball on Apple TV+ where you can stream two great games every Friday. And today, we have another major update for sports in Apple News. Apple News is the number one news app everywhere it's available, and it's about to become amazing for sports fans. You can now follow your favorite teams and leagues to get stories from hundreds of the best publishers in an all-new section called My Sports. You'll also find scores, schedules, and standings for the top professional and college sports leagues, and highlights too. Now you can catch the best plays from your favorite teams right in your news feed. And your favorites are seamlessly synced with the Apple TV app and across all your Apple devices. This new sports experience is free. It'll be available in the U.S., UK, Canada, and Australia. And when you subscribe to Apple News+, you'll get premium sports coverage from many local newspapers. That's Sports. Back to you, Craig. Craig: iOS and the entire Apple ecosystem are amazing for families, and we have some great new features to talk about, starting with some updates to Family Sharing. With Family Sharing, you can share your favorite purchases and subscriptions with up to five of your family members, including Apple Music, iCloud+, Apple One, and much more. Everyone gets personalized access to their favorite content without having to buy their own subscriptions or share an account. And for households with kids, you can create accounts just for them with built-in parental controls to help you monitor their screen time or approve their purchases. And this year, we're making it even easier to create accounts for kids and make sure the right parental controls are in place right from the start. We're adding a new, easy way to set age-appropriate restrictions for apps, movies, books, and music. Along with quick setup of other important parental controls. We're also making setting up a new device for your child– like an iPad–really simple. Just turn on the device they'll be using, bring your iPhone nearby, and choose to set up with Quick Start. With just a few taps, the new device will be set up for their use with all the parental controls you've selected already configured. And when your child asks for more screen time, you won't have to navigate to Settings to approve or deny their request. You can now respond right in Messages. Finally, we've added a new Family Checklist with helpful tips like updating a child's settings as they get older, turning on location sharing, or just reminding you that you can share your iCloud+ subscription with everyone. So those are some of the helpful updates to Family Sharing this year. Now, as we all know, one of the things everyone enjoys sharing with their family is photos. So this year, we're introducing a better way to share photos with your family. Our precious memories are often captured by several people and in between personal photos of hobbies, house projects, and homework, we have photos on our device that everyone in the family would like to have. But no one has all of them, so the family's memories are never complete. Until now. We're introducing iCloud Shared Photo Library to help you share photos seamlessly and even automatically. It's easy to set up. It's a separate iCloud library that everyone can contribute to, collaborate on, and enjoy. You can participate in one shared library that's shared with up to five other people. We've made it simple to share just the photos you want from your library. You can share everything already in your library, or choose what to include based on a start date or the people in the photos. For example, you can choose to include just the photos where you were together with your partner and the kids. Once the Shared Library is set up, you can manually move over new photos after you take them. But we wanted to make it even easier with a new switch right in Camera that sends shots straight to the Shared Library as you take them. This is great when you're on a vacation and you want to make sure the photos are shared right away. And if you take a photo of something personal, like a gift, you can easily turn it off. You can also choose to have the sharing switch enabled automatically whenever you take shots with other members of the Shared Library nearby. So if you take photos on a camping trip, you don't have to remember to share them later. You'll also receive intelligent sharing suggestions in the For You tab. Everyone has equal permissions for adding, editing, and deleting photos in the Shared Library. So if one member of the group is a talented photo editor, everyone gets to enjoy their edits to the shared photos. Deletions, captions, and keywords sync too. Content in the Shared Library will appear in everyone's Memories, Featured Photos, and in the Photos widget. So you can relive your family's adventures that include all the photos. That's iCloud Shared Photo Library: the best way to share photos with your family. And last, let's talk about privacy. We're always working hard to protect our users and their privacy, with features like App Privacy Report, Mail Privacy Protection, App Tracking Transparency, Privacy Nutrition Labels, and so many more. Another critically important area is protecting our users' personal safety. One way we're doing that is by adding a new tool to help people quickly turn off others' access, for example, disabling location sharing if they're escaping an abusive relationship. It's called Safety Check. To tell you about it, here's Katie.\n\nKatie Skinner: Many people share passwords and access to their devices with their partner. However, in abusive relationships, this can threaten personal safety and make it harder for victims to get help. We've been working closely with organizations that support victims of domestic and intimate partner violence. And the result of those conversations is Safety Check, a new section in Settings where you can quickly review and reset the access you've granted others. This lets people in abusive situations quickly revoke an abuser's access to their data and location, enabling them to cut ties and get to safety. Safety Check stops sharing your location with others via FindMy and resets the system privacy permissions for all apps. It also protects access to your messages by helping you sign out of iCloud on all your other devices and restricts Messages and FaceTime to the device in your hand.\n\nSafety Check also helps you manage who you've given access to. And you can audit which permissions you've granted to certain apps. We've received some really positive feedback on our approach, including from the National Center for Victims of Crime who said: \"In times of crisis, for many survivors, \"it's important to know who has their information and location. Safety Check helps give control back to survivors.\" This is important work, expanding the ways iOS helps you stay safe. Now, back to you, Craig. Craig: Protecting you and your privacy is and will always be at the center of what we do. iOS 16 offers so many updates that will change the way you experience iPhone. iOS also extends that experience beyond the phone, to enhance how you interact with the world around you. Whether helping you through your morning routine or keeping you connected on your next road trip, iOS has you covered. This year we're bringing exciting updates to your home and your car. To tell you what's new in the home, here's Corey. ♪ ♪ Corey Wang: Our home is perhaps the most important place in our lives, and there's a lot to manage. Smart home accessories can make it easier and more convenient to control your home right from your iPhone. You can do things like see who's at the door while working at your desk, or turn off the lights downstairs without getting out of bed. And when you're away from home, you can double-check if the front door is locked or adjust the temperature so it's just right when you get back. And your smart home is all the more powerful when your accessories work together, reacting to changes automatically. Now, the smart home is still in its early days, and we want to help bring these powerful experiences to as many homes as possible.\n\nIn order to build a connected ecosystem at home, it's important that you have the most choice so you don't have to worry about what works with what. With that in mind, we joined forces with other industry leaders to create a new smart home connectivity standard. It's called Matter. Matter enables smart home accessories to work together across platforms. And to ensure we stayed true to our values, we contributed HomeKit, our smart home framework, as a foundation of this new standard, so it's built on the same core principles and maintains the highest level of security. Industry-leading brands have already committed to supporting Matter, with over 130 products in the pipeline, and that's just the beginning. The Matter standard provides the underlying foundation to connect smart home accessories, and it allows us to innovate on top of it. We take privacy further, ensuring that data about how you use your accessories is processed and stored by default in a way that even Apple can't see. With Matter, we can continue to create amazing experiences in the Home app while also making sure all your different accessories are consistently simple to set up and easy to use. And now that you’ll have more accessory options to choose from, let's check out how we made the experience even better with an all-new Home app. We reimagined it from the ground up starting with the underlying architecture so it's more efficient and reliable, especially for homes with many accessories. We also completely redesigned how you navigate, organize, and view accessories to make it easier to control your smart home. We've integrated your rooms and favorites into the main tab of the app. So you can see your entire home in a single view. And we made sure it looks great, whether you're just getting started or have built out an advanced connected home. We added new categories for climate, lights, security, and more and an overview of what's happening in each category right at the top of the screen. And categories are a great way to navigate within the app. When you tap on a specific category, you see all the relevant accessories organized by room and more detailed status information. A multi-camera view displays up to four cameras at once front and center, and you can scroll to the right to see any additional cameras. We also redesigned tiles so that different accessories are more visually recognizable through shape and color. And with the new widgets on the Lock Screen, it's easier than ever to see how your home is doing. So that's the all-new Home app, and it's coming to iPhone, iPad, and Mac. Now that you have what you need to keep tabs on your home, you're ready to hit the road. Let's hand it off to Emily to talk about CarPlay.\n\nEmily Schubert: CarPlay is the smarter, safer way to use your iPhone in the car and has fundamentally changed the way people interact with their vehicles. It's available on over 98% of cars in the U.S. What's more, 79% of U.S. buyers would only consider a car that works with CarPlay. It's a must-have feature when shopping for a new vehicle. Our users love CarPlay. It gives them an easy way to use apps in the car, using the familiar UI from their iPhone. But cars have changed a lot, with larger-sized screens and more of them throughout the car. There's an opportunity for iPhone to play an even more important role. We've been working with automakers to reinvent the in-car experience across all of the driver's screens. Let's take a sneak peek at this next generation of CarPlay.\n\n♪ ♪ ♪ ♪ There's so much to explore here. Let's take a closer look. This next generation of CarPlay provides content for all the driver's screens, giving an experience that is unified and consistent. It's the very best of both your car and your iPhone. And it goes beyond what you can do with CarPlay today. Deep integration with the car's hardware lets you tune your car's radio or change your temperature without ever leaving the CarPlay experience. It also includes widgets, powered by your iPhone, that fit your screens perfectly. They can live front and center in the gauge cluster as well, giving you information at a glance. In fact, this next generation of CarPlay powers your entire instrument cluster. To do this, your iPhone communicates with your vehicle's real-time systems in an on-device, privacy-friendly way, showing all of your driving information like speed, RPMs, fuel level, temperature, and more. And no matter what type of unique screen shapes or layouts you may have, this next generation of CarPlay feels like it was made specifically for your car. We're also excited to give you the ability to make the core of the driving experience unique to you. We carefully crafted instrument cluster options ranging from the modern to the traditional, that use different colors, dial treatments, backgrounds, and layouts to provide various looks and feels. You can choose different curated themes and styles for your gauges. And automakers from around the world are excited to bring this new vision of CarPlay to customers. This is just a taste of what the next generation of CarPlay will bring. Vehicles will start to be announced late next year, and we can't wait to show you more further down the road. And now, I'll hand it back to Craig. Craig: And that's iOS 16, a mighty release that gives you entirely new ways to make iOS your own. It also helps you stay in touch with ease, engage with the world around you, and seamlessly share experiences and memories with your family and friends. And that's just the beginning. We've also made a big advancement in Spatial Audio with AirPods. Now, Spatial Audio works by understanding how sound interacts with the geometry of your head and ears. And now, in iOS 16, you can use the True Depth camera on iPhone to create a personalized Spatial Audio profile, enabling an even more precise and immersive listening experience, tuned just for you. Plus, Quick Note is coming to iOS so you can capture ideas instantly. A new rapid security response mechanism gets important improvements to iPhone faster, and you've got more Memoji customizations to choose from. And there's so many more features to meet your needs no matter where you are. Now, I’ll hand it over to Kevin to tell you about the big new advancements coming to Apple Watch. ♪ ♪ Kevin Lynch: Let's talk about watchOS. Apple Watch continues to be the most loved watch in the world, because it helps you stay connected, active, and healthy. In watchOS 9 we're bringing great new features to each of these three areas. First, you can stay connected to what matters to you most just by glancing at your wrist, whether you use the popular Photos watch face, or a face with rich complications. And we're adding four new watch faces for you to choose from. The Astronomy face has been remastered to take advantage of the expansive display, and shows current cloud coverage around the world. The Lunar calendar is used to observe traditional holidays and special events in many cultures. The Lunar watch face celebrates this thousand-year-old practice with support for Chinese, Islamic, and Hebrew calendars.\n\nPlay Time, designed by artist Joi Fulton, features whimsical animated numbers. You can tap the display to send them bouncing around, and when you lower your wrist, they take a nap. Finally, Metropolitan highlights watch typography with a new font that dynamically stretches when you rotate the digital crown, and features many lovely color combinations. Rich complications enable you to see more information in a small space, and we're bringing these to more of our watch faces.\n\nwatchOS 9 also introduces a refreshed Siri UI and new banner notifications. And active apps will be pinned to the top of the Dock for quick access. Another way to stay connected is by listening to the latest stories, or sharing your favorite content. With watchOS 9, the Podcast app allows you to discover and follow new podcasts using Search and Listen Now. And the app is now available to kids using Family Setup. For developers, sharing content and selected images from apps like Outcast and WeChat is easier with the new Share Sheet and Photos Picker APIs. And with CallKit, you can start, end, or mute VoIP calls from apps like Webex directly on Apple Watch. That's some of what's coming in watchOS 9 to keep you connected. And now to Craig to tell you what's coming to keep you active.\n\nCraig Bolton: The Workout app is one of the most popular apps, so in watchOS 9, we're bringing new easy-to-use metrics, views, and training experiences inspired by high-performing athletes, starting with running. It's a sport that, no matter what your level, you can use metrics to better understand your performance. And switching up your training can reduce the chance of getting injured. The first thing we're doing is adding three new running form metrics to track how efficiently you run. Measuring these from the wrist isn't easy. Take vertical oscillation for example, which is a measure of how much you move up and down. If it's too high, your energy might be wasted going up versus propelling you forward. In order to capture this from the wrist, we need to extrapolate your torso movement from the distinctive style of your arm swing. We use machine learning and sensor fusion– a combination of accelerometer and gyroscope– to isolate your torso movement, and then measure how much vertical oscillation is produced. We use a similar approach to measure the two other Running Form metrics– stride length and ground contact time. These metrics can be added to new easy-to-read Workout views. Each Workout view lets you see more at a glance. Scroll the digital crown to see new views for familiar metrics like segments, splits, and elevation. And we're introducing heart rate zones so you can quickly see what zone you're in and get a sense of your intensity level at any point during your workout. There's also a new custom workout that you can use to add structure into your run. For example, if you are trying to improve your speed or endurance, you can create a workout using distance and time intervals that include sets of work and recovery which you can repeat as needed. You can also add one of the new alerts to a specific part of your workout– like one to monitor which heart rate zone you want to train in to help keep you on track. During your run, these alerts will guide you with both haptics and voice feedback, letting you know when to switch between work and recovery and when to pick up the pace if your heart rate falls below the target zone that you set. During your run, you can use the Digital Crown for additional workout views like this new power metric. Running with a power target can help you go the distance by keeping your effort in a range that you can reasonably sustain. You can even see how this workout is contributing to your Activity rings. And if it's a route you do often, it will be automatically saved in the Workout app for you to race against your last or best time. That way, you can see if all the training you're doing is paying off. You can use many of these new features not just when you're running, but for many workout types like Hiking, HIIT, and Functional Strength Training. And for our triathletes, there's a new multi-sport workout type that uses sensor fusion to detect when you finish one leg of your race and are transitioning to the next. So it can automatically switch between swimming, cycling, and running. That's just some of what's coming to the Workout app in watchOS 9. Since the first Apple Watch, we've been inspired by the stories we hear from users who stay motivated by closing their Activity rings each day. We also know there are many iPhone users who want to meet their fitness goals but don't yet have an Apple Watch. So in iOS 16, the Fitness app will be available to all iPhone users. Using the iPhone motion sensors, you can track steps, distance, flights climbed, and workouts from your favorite apps, which can be converted to an estimation of your active calories to contribute to your daily Move goal. You'll also be able to share your Move ring with friends and receive coaching tips. While Apple Watch gives you a picture of your all-day activity, we're excited to bring some of the Fitness app benefits to iPhone users to get them started on their fitness journey. Now, I'll hand it off to Sumbul to tell you what's coming in watchOS 9 to help keep you healthy.\n\nSumbul Ahmad Desai: The Sleep app has helped millions of you by providing insights into how much sleep you're getting along with metrics like heart rate, respiratory rate, and blood oxygen. In watchOS 9, you'll be able to learn more about your sleep with Sleep Stages. Apple Watch uses signals from the accelerometer and heart rate sensor to detect which stage of sleep you're in. Machine learning models were trained and validated against the clinical gold standard of polysomnography with the largest and most diverse population ever studied for a wearable. You can see how much time you spent in each stage, as well as when you might have woken up. You'll see more details in the Health app where you'll learn that each sleep stage– REM, Core, and Deep– perform an essential function. And as you sleep, you're likely to cycle through these stages multiple times. Researchers are still looking into what happens during sleep and how it impacts your health. We want to help push forward the science of sleep, so Apple Heart and Movement Study participants will now be able to contribute sleep stage data through the Research app. With the large scale of this study, we are excited about the potential discoveries. That's what's new with sleep. Another area where Apple Watch has an impact is heart health. We hear from so many of you who have received an Atrial Fibrillation alert and sought potentially-life saving care. So we also wanted to offer support once you've been diagnosed. When living with this condition, it's important to understand the time you spend in AFib because it may relate to your risk of serious complications, such as stroke. watchOS 9 can now track the amount of time your heart shows signs of this rhythm with AFib History. And in the Health app, you can manage lifestyle factors that may influence the amount of time you spend in AFib like exercise, sleep, and weight. AFib History even helps you identify the time of the day or week when your AFib is most frequent. You can also share a PDF with your doctor to facilitate richer conversations. AFib History is a first-of-its-kind feature that uniquely provides insights into your AFib over the long term. We expect to receive FDA clearance for AFib History soon. Apple Watch makes some of the more complicated aspects of your health more intuitive. And this year, we're tackling another integral aspect of health for so many of us–Medications. Over 50% of people take prescription medications, and we wanted to help make it easier to track, manage, and understand the medications that you take. So in watchOS 9, the Medications app makes it easy for you to discreetly and conveniently track your medications, vitamins, and supplements anytime.\n\nYou can log medications that you might take occasionally like Cetirizine for allergies. And you can receive notifications for medications that you need to take regularly. Rich complications on your watch face can help you stay on top of your schedule. And of course you can track and manage your medications in the Health app, even if you don't have an Apple Watch. To build your medications list, start typing the name, and you'll see suggestions. We wanted to make creating the list easier, especially if you take multiple medications. So you can just use your iPhone camera to scan the label of your medication. You can create a schedule to receive reminders and add custom visuals to make it easier to remember. Another important aspect of medications is drug-drug interactions, which can make them less effective or cause side effects. In the U.S. alone, drug interactions cause nearly a quarter of a million hospitalizations each year. To help you with this, you'll receive an alert when you add a new medication if there is a critical interaction. We've partnered with Elsevier, a leading medical publisher, to provide clinically accurate and evidence-based information across the Medications experience. You'll be able to review critical, serious, and moderate interactions as well as interaction factors like alcohol. Medications also works with Health Sharing, which is updated in iOS 16. You can now send a family member an invitation to share their health data with you. This is another way that you can support a loved one on their health journey and have peace of mind, too. Now back to Kevin.\n\nKevin: Your health data is some of your most personal information, and privacy is central to how we build and design features for Apple Watch. Health data is encrypted on device and is not shared without your explicit permission. You'll also now be periodically reminded of what health data you're sharing and who you're sharing it with. There's so much more in watchOS 9, including support for six new keyboard languages, a new way for developers to connect their watchOS apps to Apple TV, and with Family Setup, kids can now control home devices right from their wrist. watchOS is the world's most advanced wearable operating system, and watchOS 9 takes it further with new features to help you stay connected, active, and healthy. Back to Craig. Craig: I'm so excited for watchOS 9 and can't wait to get it into the hands of our users. Next, to show you what's new with Mac, here's John. ♪ ♪ John Ternus: We couldn't be more excited by how well the Mac transition to Apple Silicon is going. It all started with the launch of M1, which brought a whole new level of performance, capabilities, and battery life to the Mac. We've already transitioned nearly the entire Mac product line. Users have been blown away by the phenomenal capabilities of these new systems powered by the M1 family of chips. And the Mac business has never been stronger. Well, today we're excited to start the next generation of Apple Silicon for the Mac. Introducing...\n\nM2. It takes the breakthrough performance and capabilities of M1 even further. To tell you more, I'll pass it over to Johny.\n\nJohny Srouji: Today we begin our second generation of Apple Silicon designed specifically for the Mac. The M-Series chips deliver a scalable range of performance and capabilities. It began with M1's breakthrough set of features that transformed our most popular systems. M2 starts the second generation of M-Series chips, and goes beyond the remarkable features of M1. Unlike others in the industry who significantly increase power to gain performance, our approach is different. We continue to have a relentless focus on power efficient performance. In other words, maximizing performance while minimizing power consumption.\n\nCombined with our unified memory architecture and custom technologies, this focus on power efficiency allows M2 to bring even more performance and new capabilities to our most popular Macs. M2 is built using an enhanced, second-generation five nanometer technology, and features over 20 billion transistors: that's 25% more than M1. We use those transistors to enhance every feature of the chip, starting with the memory controller which delivers 100GB/s of unified memory bandwidth, which is 50% more than M1 for even greater performance. And because M1 is so capable, users run all sorts of demanding tasks. So for M2, we've enabled up to 24GB of unified memory to handle even larger and more complex workloads. M2 features our next-generation CPU, with advancements in both the performance and efficiency cores. The performance cores are faster and feature a larger cache, and the efficiency cores have been significantly enhanced for even greater performance gains. Together, they rip through CPU-intensive tasks using very little power. When we look at the multi-core CPU performance of M2 compared to M1, it delivers 18% greater performance. And compared to the latest 10-core PC laptop chip, the CPU in M2 delivers nearly two times faster performance at the same power level. And M2 delivers the peak performance of the PC chip while using a quarter of the power. Now let's compare M2 to the latest 12-core PC laptop chip, which needs dramatically more power to deliver an increase in performance. So it's in a thicker, hotter, more noisy system with less battery life. M2 delivers nearly 90% of the peak performance of the 12-core chip while using just a quarter of the power. This is what we mean by the power efficient performance of Apple Silicon. M2 also features our next generation GPU, which now has up to 10 cores– that's two more than M1. Combined with a larger cache and higher memory bandwidth, the 10-core GPU delivers a big boost in graphics performance. M2 delivers up to 25% higher graphics performance at the same power level as M1 and up to 35% higher performance at its max. And compared to the integrated graphics in the latest PC laptop chip, the GPU in M2 delivers 2.3 times faster performance at the same power level. And M2 delivers the peak performance of the PC chip using just one-fifth of the power. This much higher performance per watt from M2 enables systems to run cool and quiet with exceptional battery life. Now, one of the advantages of making our own silicon is that we can quickly bring our newest custom technologies across our SoCs. So M2 also features our next-generation Secure Enclave and Neural Engine. The Neural Engine in M2 can process up to 15.8 trillion operations per second. That's over 40% more than M1. It also has our next generation media engine, including a higher-bandwidth video decoder that supports 8K H.264 and HEVC video. And M2 features our powerful ProRes video engine for hardware accelerated encode and decode. So systems with M2 will be able to play back multiple streams of 4K and 8K video. So that's M2. It starts our next generation of M-Series chips, with an 18% faster CPU, 35% faster GPU, 40% faster Neural Engine, and 50% more memory bandwidth. It takes the amazing performance, capabilities, and efficiency of M1 even further. Now, back to John.\n\nJohn: The fact that we're already starting our next generation of Apple Silicon for the Mac is remarkable. So now let's talk about the first Mac to get the M2 chip. We're thrilled that it's our most loved Mac– the MacBook Air. Users love MacBook Air for its great performance, portability, and battery life. It defined the category of thin and light notebooks. And with M1, it redefined what a thin and light notebook could do. Today, it's more popular than ever. In fact, MacBook Air is the world's best-selling laptop. Apple Silicon enables us to design products we never could have imagined, which is why we're so excited to introduce an all-new MacBook Air, completely redesigned around M2. And here it is.\n\n♪ ♪ ♪ ♪ ♪ ♪ ♪ ♪ John: This is the new MacBook Air, powered by M2. And to tell you all about it, here's Kristin.\n\nKristin White: The new MacBook Air takes everything our users love about the Air to the next level. The wedge shape of the previous Air has evolved into a new design that's strikingly thin from every angle. The durable, all-aluminum unibody enclosure feels incredibly solid when you hold it and is built to last. And this remarkably thin design integrates its components so efficiently that it results in an astonishing 20% reduction in volume over the previous Air. The new Air is just 11.3mm thin, or under half an inch, and it's only 2.7 pounds. MacBook Air now comes in four finishes: Silver, Space Gray, a gorgeous Starlight, and a stunning Midnight. And yes, MagSafe is back for dedicated charging and peace of mind when you're plugged in. And it keeps the two Thunderbolt ports free for connecting to a variety of accessories. There's also an audio jack with support for high-impedance headphones. This all-new design is incredibly portable, and it's loaded with new features, starting with a brilliant Liquid Retina display. We expanded the display closer to the sides and up around the camera to make room for the menu bar. The result is a larger 13.6-inch display with much thinner borders, giving users more screen real estate to view their content in brilliant detail. At 500 nits, it's also 25% brighter than before. And MacBook Air now supports 1 billion colors, so photos and movies look incredibly vibrant. Next, let's talk about the camera. Having a great camera is more important than ever these days. So MacBook Air features a new 1080p camera with twice the resolution and twice the low-light performance of the previous Air. Combined with the processing power of M2's advanced image signal processor, you'll look great on video calls. Next up, audio. To fit inside such a thin design, the speakers and mics are completely integrated between the keyboard and display, all while delivering an even better audio experience. A three-mic array captures clean audio using advanced beam-forming algorithms. And there's a four-speaker sound system that produces amazing stereo separation and vocal clarity. There's also support for immersive Spatial Audio for music and movies with Dolby Atmos. The Magic Keyboard features a full-height function row with Touch ID. And, of course, the new Air has a spacious, industry-leading Force Touch trackpad. And when it comes to performance, M2 takes it even further. So applying filters and effects in apps like Photoshop is up to 20% faster than before and a massive five times faster for customers that haven't yet upgraded to Apple Silicon. And for intensive workloads like editing complex timelines in Final Cut Pro, performance is nearly 40% faster than the previous Air. Thanks to the power efficiency of M2, all these capabilities are built into a silent, fan-less design. And even with a larger display and increased performance, the Air delivers the same great all-day battery life with up to 18 hours of video playback. There's also some new charging options, including a compact power adapter with two USB-C ports so you can charge two devices at once. And for the first time, the Air supports fast charge with an available 67W adapter. So you can charge up to 50% in just 30 minutes. So that's the all-new, amazingly portable and powerful MacBook Air. It's thinner, lighter, and faster with a durable unibody design, bigger display, better camera, all-day battery life, and four beautiful finishes. It's everything you could want in a new MacBook Air. Now, before I hand it back to John, let's see it in action.\n\n♪ ♪ ♪ ♪ ♪ ♪ ♪ ♪ ♪ ♪ John: We're so excited to bring M2 to MacBook Air, the world's best-selling laptop. Only with Apple Silicon can you build such a thin and light notebook with a fan-less design and this combination of performance and capabilities. But that's not all we have for you today. M2 is coming to another Mac, which is actually the world's second-best-selling laptop: the 13-inch MacBook Pro. It's our most portable pro notebook, and users love the performance it delivers in its compact design. Now with M2, you get even more capabilities in the same great form factor. With a faster 8-core CPU and 10-core GPU, working with RAW images in apps like Affinity Photo is nearly 40% faster than the previous generation. And over three times faster if you're upgrading from a model without Apple Silicon. And playing graphics intensive games like Baldur's Gate III is also nearly 40% faster than the previous 13-inch Pro. With an active cooling system, the MacBook Pro is designed to sustain its pro performance. And thanks to M2, it also supports up to 24GB of unified memory. Along with 50% more memory bandwidth, multitasking and working with large assets is super fluid. With support for ProRes encode and decode in M2's media engine, you can convert your video projects to ProRes nearly three times faster than before. MacBook Pro also delivers phenomenal battery life, with up to 20 hours of video playback. So that's the powerful 13-inch MacBook Pro. With the incredible performance of M2, ProRes acceleration, up to 24GB of memory, and up to 20 hours of battery life, our most portable Pro notebook gets even better. Both the Air and the Pro also support our environmental goals. They use 100% recycled rare earth elements in many components, are free of numerous harmful substances, and meet Apple's high standards for energy efficiency. The all-new MacBook Air starts at $1199 and just $1099 for education. The powerful 13-inch MacBook Pro starts at $1299 and $1199 for education. And they'll be available next month. And the MacBook Air with M1 stays in the lineup at $999 and just $899 for education. We're thrilled to bring M2 to the world's two most popular laptops, the MacBook Air and 13-inch MacBook Pro. And they join the even more powerful 14 and 16-inch MacBook Pro with M1 Pro and M1 Max to round out the most amazing lineup of Macs we've ever offered, and continue our tremendous pace of innovation for the Mac. Now, back to Craig. Craig: We're really excited about these new Macs with the next generation of Apple Silicon. And the powerful software that drives the experience is macOS.\n\nSo let's talk about what's new.\n\nKyle: Jump! Sit! Craig? Craig: Sorry, Kyle. Wrong door. ♪ ♪ macOS plays a critical role in our lives as we work, collaborate with colleagues, family, and friends, create and organize what's important to us, and so much more. This year, we focused on making the core things you do with macOS even better, delivering new ways to be productive and take advantage of the capability of your other devices with Continuity. So what should we call it? Well, that brings us to the latest exploits of Apple's crack product marketing team. They've been absolutely riding high since their naming coup on M1 and M2, and needless to say, they were exhausted. But after their requisite three-month rejuvenation retreat in Monterey, with their chakras now in complete alignment, the team once again piled into their macOS naming microbus and wove their way down Highway 1. Chasing the vibrant display of colorful California wildflowers, they finally came to rest where stunning surf meets lush alluvial plains, in beautiful Ventura. macOS Ventura enriches so many of the ways we use our Macs. So let's jump in. A key part of the Mac experience is helping you be productive and creative, which can often mean having a lot of windows open at once. And the more you do, the more overwhelming this can become. We all want the perfect mix– to focus on our work without distractions and to easily move between tasks. This year, we have a new way to automatically keep everything organized and give you quick access to your windows. It's called Stage Manager. Let's see how it works.\n\nWhen you're working on the Mac, it's really easy to find yourself with lots of open windows. Now, the Mac has great tools like Mission Control to help you find the window that you're looking for, but with so many open windows, it can feel like you never really escape all the clutter. With Stage Manager, you can focus on the app you're using without the distractions, and it's easy to get started. Let's activate Stage Manager from Control Center. As you see, it automatically arranges all my windows for me off to the side and puts the app I'm currently working with front and center. When I bring forward a different app, like clicking on Mail here in the Dock, you'll see that it's brought to the stage and Safari gracefully moves over to the left with my other recent apps. When I click on Safari, it retakes the stage, and Mail moves back to the left. You'll notice that for an app with multiple open windows, like Pages here, Stage Manager gathers all the windows together in a single pile. When I click, I get the top one, and if I want a different window, I can cycle through them just by clicking. It's really convenient. Of course, just as you would expect on a Mac, I can have overlapping windows and multiple apps open at the same time too. It's really easy to group apps together. Here I'll just drag in Notes and pair it with my Pages window. This is so great when I'm working on projects that involve a specific group of windows like planning a trip with these three apps here. And if I go back to my previous group, Stage Manager keeps my windows arranged just as I left them. I love working this way. Of course, like many Mac users, I often want to get at files on my desktop, and with Stage Manager, we've made that easier than ever. I'm working on this Final Cut project, and I want to pull in a couple of files. With just a click on my desktop, my windows clear the stage and my files are revealed. Now I can grab these title graphics and drag them over to my Final Cut window. I'll just drop them in right here, and boom.\n\nSo that's a quick look at multitasking with Stage Manager, Another part of the Mac experience that helps you do more is Spotlight. This year we have a big update that delivers a more consistent and powerful experience across our platforms. Spotlight is great for doing all kinds of things, like quickly launching an app or starting a search. And now you can peek at a result in Quick Look with a tap on the space bar. Spotlight can now also find images from your photo library, across the system, and on the web. And using Live Text, you can search the text inside the image. You can also take actions like starting a timer or running a shortcut right from Spotlight. It's also a great way to get information, now leveraging the full window for richer results. For musicians, you'll see their albums, key facts, news, and more. It's also great for movies, TV shows, and actors, businesses, and sports. Rich results and the ability to take actions right from Spotlight are also coming to iOS and iPadOS. Now, speaking of iOS, we wanted to make Spotlight even easier to discover and access, so we added it right to the bottom of the Home Screen. With just a tap, you can use Spotlight to launch an app, find a contact, or start a search. These updates make Spotlight more productive, helping you find what you're looking for faster. Next, let's turn to an app that many of us use to communicate every day. To take you through it, here's Darin.\n\nDarin Adler: Of course, we're talking about Mail. Mail is central to how so many of us communicate. This year, we have great updates that will help you be more productive, starting with some highly-requested features. Undo send lets you pull an email back a few moments after hitting Send. Scheduled send, so your emails arrive at the perfect moment. Follow-up suggestions will automatically remind you to follow up if you haven't received a response. And Remind Me makes it easy to come back to a message at a particular date and time. Next, let's talk Search. This is the biggest overhaul of Search in Mail we've done in years, leveraging the latest state-of-the-art techniques to deliver more accurate and complete results. When you click Search, you'll see recently shared documents, links, and more. The moment you start typing, with each letter, you instantly see suggestions. If you make a typo, Search is one step ahead, only showing results for the correct spelling. And if Search knows a synonym, it'll look for that too. And all these new features are also coming to iPadOS and iOS. And that's Mail. Next up is another app most of us spend a ton of time in every day: Safari. With macOS Ventura, Safari is the world's fastest browser, rendering the most complex websites with incredible speed. Safari is the most power-efficient browser on Mac, letting you do more on a single charge than any other browser. And of course, Safari is a trailblazer in protecting your privacy on the web, with features like Intelligent Tracking Protection and Privacy Report. Safari has a legacy of introducing key web technologies that elevate the web experience for everyone. Safari's pioneering support for HTML5 transformed the video experience on the web, resulting in higher-quality playback and increased battery life. And Safari continues to deliver support for the latest web technologies and standards for web developers, including all of these added in just the last year, like more fluid web animations, new browser extension types, and support for the push notifications standards. These enable more immersive and engaging web content for our users. And now Safari has a new way to share your favorite content with others with Shared Tab Groups. Whether you're planning a trip with friends or shopping for a couch with your partner, you can share all the tabs in one place. And when they find something great, they can add tabs too. You can see which tabs your friends are looking at live, and using built-in collaboration, you can easily connect in real time over Messages or FaceTime. It's so easy to discover the web together. And next, we have a new way to make the web a safer place. We rely on passwords to protect our most private accounts. While Safari helps users create the strongest passwords possible, there are still ways accounts can be compromised. Hackers can use social engineering techniques like phishing to trick users into giving up passwords. They can also breach a website directly to get access to all the passwords stored on its server. That's why we've helped create a next generation credential that's more secure, easier to use, and aims to replace passwords for good. We call them passkeys. Passkeys use powerful cryptographic techniques and the biometrics built into your device to keep accounts safe. To create a passkey, just use TouchID or FaceID to authenticate, and you're done. When users create a passkey, a unique digital key is created that only works for the site it was created for. Passkeys can't be phished. Since the passkey never leaves your devices, hackers can't trick you into sharing it on a fake website. And passkeys can't be leaked because nothing secret is kept on a web server. We've designed passkeys to work in apps as easily as they do on the web. Passkeys are securely synced across Apple devices using iCloud Keychain and are instantly available on Mac, iPhone, iPad, and Apple TV. We've been working with industry leaders in the FIDO alliance including Google and Microsoft, to ensure that passkeys work seamlessly cross-platform. With a passkey, you'll be able to walk up to a non-Apple device and sign in to a website or app using just your iPhone. The transition away from passwords will be a journey, and we look forward to working with developers on the password-less future. And that's Safari. Now back over to you, Craig. Craig: We think these updates to Mail and Safari will help you be productive and browse the web in new and safer ways. Next, let's have some fun and talk about gaming. We're at a point where two things are really coming together. First, Apple Silicon has changed everything. It's taking the graphics performance of every new Mac to new heights, giving Macs the power to run the most demanding games, with ease. Second, the Mac is more popular than ever, and it's a huge and fast-growing opportunity for game developers. And since we have a unified silicon architecture spanning from iPhone and iPad all the way up to M1 Ultra, game developers can scale the quality and performance of their titles across the entire line. Another key part of a great gaming experience is the software that powers it. To tell you what's new, here's Jeremy.\n\nJeremy Sandmel: We continue to improve Metal. It's the software that powers hardware-accelerated graphics on all our platforms. And now, Metal 3 brings new features that will unleash the full potential of Apple Silicon for years to come. Gaming at maximum resolution and quality looks awesome. And to help game developers increase the performance of realistic and immersive graphics, we're introducing MetalFX Upscaling, which enables developers to render rich, visually complex scenes even faster. It works by rendering smaller, less compute-intensive frames and then applies high-quality spatial upscaling and temporal anti-aliasing. And it's so cool. No Man's Sky, coming to Mac later this year, will be one of the first games to use MetalFX Upscaling. The frame rate increases, giving you that responsive feel, and it looks beautiful. Another area we're improving is game loading. Games continue to push the boundaries and appear more realistic than ever before by using richer textures and more geometric detail, which can take a while to load. So Metal 3 adds a new fast resource loading API that minimizes wait time by providing a more direct path from storage to the unified memory system so the GPU can more quickly access high-quality textures and buffers without waiting. Metal 3 and Apple Silicon enable even more immersive visuals, faster performance, and quicker loading. This really is a new day for gaming on the Mac. But don't take our word for it. Let's hear from the team that has created the acclaimed Resident Evil Village. We are so excited it's coming to the Mac. To tell you more, we are delighted to introduce Ijuin-san, manager of Capcom's Advanced Technical Research Division. ♪ ♪ Craig: Thank you, Ijuin-san. Next, let's talk about Continuity. Continuity is all about giving you a seamless experience across devices. Features like Universal Control, AirPlay, and Handoff allow you to always use the right device for the moment. And today, we're extending Handoff to FaceTime. Now picture this: you answer a FaceTime call on your iPhone while you're away from your desk. When you get home and bring your iPhone up close to your Mac, your Mac automatically recognizes the call on your iPhone, and you can move it to your Mac seamlessly, giving you a bigger view to continue the conversation. You can handoff calls in any direction between your devices, so you'll always be able to join the call from the right one. We also have exciting news about another Continuity feature, which pairs the best camera you own with the large displays on Mac. We spend a lot of time in front of our Macs with our cameras on. Our webcams have become an integral part of work, school, and play. And now, with Continuity Camera, you can use iPhone as your webcam. It's powered by the advanced capabilities of the iPhone camera system, letting you do things that were never before possible with a webcam. Let me show you how it works. Now, I'm just gonna pop this stand on my iPhone, and attach it to my display. Let's launch FaceTime.\n\nYou can see my Mac automatically detects my iPhone and uses it as the camera. I don't even have to wake up my iPhone. This all works wirelessly so there's nothing to plug in. So to try this out, let's call a friend in the design studio.\n\nJohnnie Manzari: Hi, Craig! Craig: Hey, Johnnie! Are you up for helping me give a demo of Continuity Camera? Johnnie: Sure, I'm using it right now. with my iPhone and Pro Display XDR. You know, one thing I love about Continuity Camera is Center Stage. I can move around and Center Stage will keep me in the frame. I'll frequently pair that with Portrait Mode to blur the background with that beautiful boca. Craig: Yeah, I've loved having these features on my iPad, and it's great that we can now use them with any Mac. Johnnie: For sure. A new one people are gonna love is Studio Light. Check this out. It brightens my face and darkens the background. Craig: Hey, that looks great. It's almost like you have a ring-light. Johnnie: It is perfect for tough lighting conditions, like if I'm ever sitting in front of a window. Okay, now I wanna show my favorite new feature, Desk View. You can see the work that's on my desk, and it keeps me in the picture. It is amazing. Take a look. It looks like I have a dedicated overhead camera, but this is Desk View creating both of these views from the one ultra-wide camera on my iPhone using some very powerful image processing. I didn't even need to adjust my phone. Desk View's gonna be great for sharing new designs with my team. I can even use it to show my nephew a new card trick. Craig: This is gonna be so cool. Well, hey, Johnnie, thanks for helping us give the quick demo. Johnnie: No problem. I'll talk to you later.\n\nCraig: In addition to FaceTime, you can use Continuity Camera with any macOS videoconferencing app like Zoom, Teams, Webex, and more. And we're working with Belkin to offer beautiful stands to hold your iPhone at the perfect height and angle. These will be available later this year. And since so many of you with a Mac already have an iPhone, these great capabilities come with the devices you already own. That's the magic of Continuity. And that's macOS Ventura, a feature-packed release that brings new tools for managing windows, smart new features for Mail, Safari, and games, and magical new Continuity features. Now let's turn to iPadOS. ♪ ♪ Our vision for iPadOS is to create a distinct experience that's built on the best of iOS, like security, mobility, and an intuitive touch-first interface, with powerful capabilities from macOS, like multitasking and trackpad support, combined with features like Apple Pencil that are uniquely iPad. All of this comes together to deliver our most versatile device. This year in iPadOS 16, we have a big release that's going to take this versatility even further. Starting with a host of features that you heard about earlier in iOS and macOS that are going to be great on iPad, like Shared Photo Library, Shared Tab Groups and Passkeys in Safari, and a big update to Mail. We're also bringing Weather to iPad, taking full advantage of the stunning display with beautiful animations like these gently moving clouds, heavy snowfall, and driving rain. And all of these modules are tappable to access detailed information. And for developers, we're announcing WeatherKit so they can build weather into their apps. iPadOS 16 also includes new ways to collaborate with others, more capable apps, and new features for Pro users that take advantage of the power of the M1 chip. So let's start with collaboration, which often begins in Messages when you're asked to pass along a document. Of course, you could send a copy, but now you can also instantly kick off a collaboration when you send something with the Share Sheet. This makes initiating collaboration across the system as easy as sending a link, and means a conversation with your collaborators is always just a tap away. Let me show you how it works.\n\nSo let's tap in to Messages. I've been talking to the team about an upcoming offsite, and we've been using this conversation to figure out the details. Now, it looks like a message just came in from Lopp, and he wants to catch up on the latest. Over here in Pages, I've been collecting our ideas. I want to share this with the group. In the past, when I'd tap Share, I'd end up sharing a copy. But now, you'll notice I can start collaboration right here. And what's great is, I don't need to type in a bunch of names or email addresses. When I select a Messages group, everyone gets added automatically. Let's go ahead and send it.\n\nThis makes it way easier to collaborate with people you're already communicating with. Everyone can immediately join and start making edits, like the ones you see here. And back in the Messages conversation, I even get a notice of any changes I might have missed. When you collaborate this way, your document is connected to the conversation. The group appears in the toolbar, and I can kick off communication right from here. I can get back to the messages conversation or initiate a FaceTime call. Let's go ahead and call the group.\n\nHey, everyone! Michael Lopp: Hey, Craig. Craig: Hey, I saw that a few of you were in the document. Does anyone have any other ideas for the offsite? Lopp: Yeah, I've been thinking about it, and I've been collecting a few tabs. I'm gonna share them right now with you in Safari. Craig: Thanks, Lopp. This year, you can start collaborating with the group right in FaceTime. You can see that Lopp just invited me to collaborate on a set of tabs in Safari. I'm gonna go ahead and accept his invite, and now, I can get to them in Safari. Just like with the Pages document, everyone in the group automatically has access. I can see Anne and Mindy joining the tab group, and I can even see which tabs people are looking at right in the tab bar. Looks like Mindy is checking out kayaking. Lopp: Found a few more. Check these out. Craig: When Lopp adds tabs, they instantly appear so we can all check them out. Let's see, we already did this last year, but ziplining looks cool! All right, team, let's wrap this up and update our document with the latest ideas.\n\nLooks like Anne is updating the text, and Mindy just dropped in an image, so we're all set. So that's a quick look at some of the new ways you can work together with collaboration with iPadOS 16. In addition to Pages and Safari, these new collaboration features will work with a variety of apps, like Notes and Keynote. And for developers, there's a new API to integrate collaboration in their apps, and these features will also be coming to iOS and macOS. Of course, when you're collaborating live, sometimes you want a space where you can brainstorm and capture ideas as they strike. So today, we're giving you a sneak peek at a brand-new app called Freeform coming later this year. To tell you all about it, here's Elizabeth.\n\nElizabeth Reid: We have so many great ways to collaborate, but up until now, you didn't have a space to work in, a place for group sessions, project planning, home renovations, or school projects. Now, you can be on a FaceTime call, and with a tap, you're all collaborating live on a Freeform board. You can add almost anything to a board. It's perfect for brainstorming sessions, jotting down notes, sharing files, or even creating diagrams with others. It's flexible, limited only by your imagination. As others begin adding their thoughts, you can see their live cursors showing you right where they're working. And if someone is in another part of Freeform, you can just tap to jump straight to where they are on the board. And any time you need more space, move around simply using touch, or focus on what's really important with a pinch. Of course, with a full complement of drawing tools, you can sketch or write a note anywhere you'd like with Apple Pencil. And with all the powerful tools to create content on iPad, Freeform is a great place to pull it all together, including photos, video, audio, documents, PDFs, web links, pretty much anything you need to work with can be brought onto your board. And you can preview right in line, including multipage documents and high-resolution videos, giving you everything you need to bring your ideas to life right at your fingertips. And that's a sneak peek at Freeform. Back to you, Craig. Craig: Freeform is going to be a great way to brainstorm your ideas with others, and we're building it right into iPadOS, macOS, and iOS later this year. Of course, the versatility of iPad means you can seamlessly move from being productive to gaming. With its stunning display, built-in sensors, and support for your favorite game controller, iPad provides a great gaming experience. And the M1 chip delivers high-performance graphics, enabling immersive games like Divinity: Original Sin 2. In iPadOS 16, we have some great updates to gaming, starting with Metal 3, which brings the same MetalFX upscaling and fast resource loading API to iPad that we talked about earlier with macOS. There's also a new API that lets games download large assets in the background, enabling you to multitask while the download completes. Another important aspect to gaming on iPad is how it brings us together. Tens of thousands of games use Game Center to help us play with our friends or compete against each other. It's easy to jump right in and play without creating a new account, using your Game Center profile. You can find friends to play with, compare scores on leaderboards, and track progress through achievements. And now, we're bringing Activity to the Game Center dashboard. You can see what your friends are playing, highlights of their achievements, and even find out when they beat your high score, so you know when it's time to take your game to the next level and get back on top. And all of this activity appears on your Game Center profile. Game Center has always supported playing together in real time. Now, SharePlay makes it simple to join and play. In a multiplayer game using Game Center, just start a SharePlay session and bring your friends right in. These new Game Center features will be coming to an update to iPadOS 16 later this year, and we're also bringing them to iOS and macOS. The versatility of iPad makes it great for so many things, and a big part of that is apps. This year, we're continuing our work to make iPad apps more capable with desktop-class apps. While many iPad apps have their origins in iOS, over the years, they've taken on their own unique capabilities, optimized for the iPad's larger display. In iPadOS 16, we scoured the entire system, adding enhancements across the board, from system elements and interactions to new features you use on Mac and want on iPad. Let me highlight a few of them. Undo/redo across the system, availability view in Calendar, find and merge cards and create lists in Contacts, and we have a big update to Files, with some of the most requested features, such as the ability to change file extensions, view folder size, and more. We've also added system-wide features that deliver improvements across apps, starting with a redesigned find and replace experience that works in-line. A document menu in apps like Files, Pages, and Keynote that reveals common actions you may want to take, such as duplicate, rename, export, and print. And for the first time ever, customizable toolbars in iPadOS so you can add the tools that matter to you most. And for developers, we've created new APIs, so they can build these capabilities right into their own apps. These features will help you be more productive. And we have another feature for Mac that will be great for creative pros on iPad. And that is reference color. The Liquid Retina XDR display in our latest 12.9-inch iPad Pro is great for professional color workflows. And with iPadOS 16, we're introducing Reference Mode, which meets the color requirements in workflows like review and approve, color grading, and compositing, where accurate colors and consistent image quality are critical. So whether you prefer using iPad Pro as a standalone device or as a second display with Sidecar, Reference Mode provides a consistent reference workflow across your pro devices, making iPad Pro an indispensable tool for creative professionals. Now, I want to turn our attention to a set of features enabled by the performance of the M1 chip in our latest iPad Pro and iPad Air. Features for people who push the versatility of iPad to the limit. Pros are always wanting more space to work with, so we're adding a new display scaling setting, which allows you to increase the pixel density of the display so you can view more in your apps, which is particularly helpful when using Split View. We also want to enable you to do more in apps. Our latest iPad Air and iPad Pro come with a ton of ultra-fast memory and storage. iPadOS 16 adds support for virtual memory swap, meaning your iPad storage can be used to expand the available memory for all apps and delivers up to 16 GB of memory to the most demanding apps. With technologies like display scaling and virtual memory swap, we have the foundation for a big leap forward in user experience, one that can change how our Pro users get work done on iPad. So we're bringing Stage Manager, our latest windowing system that you just saw in macOS, to iPadOS. Stage Manager takes multitasking on iPad to a whole new level by making it more nimble and unlocking full external display support. I'd like to show it to you now.\n\nToday on iPad, when you use apps, you get the full screen experience that we're all familiar with, like in Photos here. With Stage Manager activated, I can now resize windows, exposing a powerful new way to work with apps on iPad. And the Dock is visible, so I can easily get to all my apps. Let's open Music. You'll notice that all my recently used apps appear on the left, so switching between them is really fast. And Stage Manager gives me powerful new layout capabilities to create my ideal workspace. For the first time on iPad, I can work with overlapping windows. I'm gonna drag Messages alongside Calendar here, and Stage Manager automatically moves Calendar gently off to the side as I bring it to the stage. And if I move Messages to the left, Stage Manager repositions Calendar for me automatically. And like you saw earlier, I can resize windows and arrange everything just the way I want. And it gets even better when I plug my iPad into an external display.\n\nMy wallpaper beautifully fills the entire display, and I can move my cursor to it from my iPad. I have the Dock here too, so let's go ahead and launch Keynote. When I do, I once again enter Stage Manager, now on an even bigger canvas. All of that additional screen real estate is so useful when working on a presentation in Keynote. And it's amazing when you're working with a set of apps. I can create groups of three and even four windows. This is just incredibly powerful. Between my iPad and my external display, I can have up to eight apps running onscreen simultaneously. And I can take advantage of the unique capabilities of each of these displays. For instance, I'm working on this Keynote document, and I want to add a drawing from Procreate here on my iPad. I can use Apple Pencil to add a finishing touch to my drawing.\n\nAnd now I can jump back into the gallery and then drag and drop across displays and into my deck. And that's a quick look at Stage Manager. It's an entirely new way to multitask with multiple overlapping windows, flexible window sets, fast app switching, and full external display support. And that's iPadOS 16, a big release with exciting updates to many of the built-in apps; Weather app comes to iPad, new ways to collaborate and be productive, great features for pro users, including Stage Manager, and so much more. Now, back to Tim. Tim: Thank you, Craig. And thanks to all of our presenters. What an exciting day of announcements! We introduced the all-new, redesigned MacBook Air, with its super-thin enclosure, Liquid Retina display, MagSafe, beautiful new finishes, and supercharged by M2, our next generation of Apple Silicon. Along with a powerful new 13-inch MacBook Pro, also supercharged by M2. And we pushed our software platforms forward in some incredible new ways. Introducing features and capabilities that will enable our developers to do amazing work and provide our users with exciting new experiences. Our OS releases will be available as developer betas today, and each of them will have a public beta next month. All of these OS releases will be available to our users this fall.\n\nI'm confident that our incredible products and innovative platforms will inspire developers to do the very best work of their lives, enabling all of us to do even more amazing things. We hope you enjoyed today's event, and we have a huge week ahead. We will be offering a comprehensive online experience, starting with a Platform State of the Union for those developers who want take a deeper dive into our announcements. And there will be more than 175 sessions, as well as one-on-one labs with Apple engineers and digital lounges. All of this is available for free to all our developers to help them get the most out of the conference. Thank you for joining us, and let's have a great WWDC! ♪ ♪ ♪ ♪ ♪ ♪ ♪ ♪ .\n\n.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ]
  },
  "extractedAt": "2025-07-18T10:22:45.041Z"
}