{
  "id": "110335",
  "year": "2022",
  "url": "https://developer.apple.com/videos/play/wwdc2022/110335/",
  "title": "Explore Apple Business Essentials",
  "speakers": [],
  "duration": "",
  "topics": [
    "Business & Education"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "- Hello, I'm Josh and I'm a software engineer on the Apple Business Essentials team. As a small business, you may find yourself managing an increasing number of devices as your team expands. The IT demands that come with this can be a lot to take on, taking time away from doing what you do best. Apple Business Essentials makes this easy with a subscription that seamlessly brings together device management, 24/7 support, and cloud storage so your small business can manage every employee's iPhone, iPad and Mac every step of the way. And for your employees, it's simple. All they need to do is sign in with a Managed Apple ID, and their devices are set up with Apple Business Essentials.\n\nOnce they're signed in, devices are automatically configured with the settings they need, including critical security settings like FileVault and passcode policies as well as all of the apps they need to be productive. Plus, the iCloud storage to store, collaborate on, and share documents in iCloud Drive. They can even use iCloud backups for their iPhones and iPads. When something goes wrong, AppleCare+ for Business Essentials is there to help. Repair credits are shared across the entire organization and can be used for any device under a plan with coverage. In fact, Apple Business Essentials helps you with every step of the device lifecycle. In this session, we'll explore the ways you can take advantage of everything the subscription has to offer. We'll review the first step: getting an account in Apple Business Manager. We'll start a new Apple Business Essentials subscription, add settings and apps, and explore how the experience looks for employees as they enroll their devices. Let's get started.\n\nApple Business Essentials exists inside of Apple Business Manager where you manage devices, add users, and purchase apps. To subscribe to Apple Business Essentials as your device management solution, you first need an Apple Business Manager account.\n\nSign up by visiting business.apple.com and entering your company name, DUNS number, and contact information.\n\nOnce you have an account, the next step is to add users. You add individual users by manually entering their information or sync an existing list of users from a Microsoft Azure Directory or Google Workspace.\n\nMany of your users share common needs, like a sales department or field workers, so you want them to get the same settings and apps. To prepare for this, make user groups with the users you just created.\n\nAnd save time using 'smart user groups' which automatically creates groups based on common attributes like division, location, and role. Now that I have my Apple Business Manager account and I've set up some users and groups, I'm ready to enroll in Apple Business Essentials. Let's go to the Mac; here's Apple Business Manager. I find Subscription in the sidebar and start a free trial . I need to choose whether this is an employee plan or a device plan. Employee plans are just that-- plans for devices used by my employees. Device plans are also available for things like conference room devices, kiosks, loaners, or other cases where the device is not assigned to a specific employee. Next is the number of devices per employee, either just 1 or up to 3. I'm setting up a plan for my sales team. I know they're on the road frequently and usually have a work MacBook as well as an iPhone and iPad, so I'll set them up with a three-device plan. Next, storage. With the subscription, my employees get an iCloud account dedicated for work so they can access their files and folders across their devices. I'll stick with 200 GB for now; this should be plenty to start with. But if my team's needs change in the future, I can update it at any time. Last, I select AppleCare+ for Business Essentials for repair, service and support; perfect for my sales staff who are out in the field.\n\nNext, I add user groups and individual users. Let's search for the sales team and add them to this plan.\n\nI've already entered my payment information.\n\nI review the pricing... and add the plan. As my business grows, having multiple plans lets me cover all the unique needs of my employees and devices, and when I make changes at any time, I'll only pay for what I use. My Apple Business Manager view updates to reflect that I'm subscribed to Apple Business Essentials and I now see Settings and Collections in the sidebar. Settings provides a list of configurations I automatically push to a managed device. Apps provides a list of apps to purchase for my users to download on their devices with the Essentials app. Collections are a group of Settings and Apps that I assign to users or groups. We'll get started by exploring the settings. The Essentials category brings together the settings I'm most likely to use. But I have a number of options here, so let's understand what they are and then add the ones I need.\n\nThe security tab brings together all your critical security settings to one place so they're easy to configure. For my iOS devices, I want a password setting. I'll do that shortly. For my macOS devices, I add the FileVault setting to ensure my employee's Macs encrypt their data. I turn on Application Layer Firewall to protect against threats from incoming network traffic to untrusted apps. I turn on Gatekeeper to prevent untrusted apps from running altogether.\n\nMoving on to the network category, I configure my devices with AirPrint to automatically connect to my printers and use the Wi-Fi setting to configure trusted networks so they're available automatically when the user signs in to their device.\n\nPersonalization provides additional settings that I can use to customize the experience for the devices in my fleet. For example, I use conference room display to restrict my apple TVs to airplay only. For my macOS devices, the login Window setting allows me to display a message on the login window, which is great for showing things like support email addresses or phone numbers. Let's go back to the essentials category to add a few of these settings.\n\nWe'll create a new configured setting and name it Password Policy.\n\nThe check boxes are on for both macOS and iOS, and let's leave on the switch on for \"password and security options\" to require my users to create a strong password. I select the \"no\" option for \"allow simple passwords\" to require my employees to choose at least one special character as part of their password, and 'yes' for \"require alpha numeric password\" requires at least one letter and number for their password. Let's save this setting.\n\nAnd here it is, added to my settings list. Next, I configure Wi-Fi passwords so my employees' devices automatically join a known Wi-Fi network. I'll name this setting BetterBag Secure Wi-Fi.\n\nI enter my company's Wi-Fi name... and password.\n\nI leave the \"network visibility\" as visible, leave \"auto join\" as \"yes\" and save.\n\nLet's move on to apps.\n\nThe Apps page is where I get apps, both paid and free, that my users then install with the Essentials app on their device. Here I have the apps and books available from the Apple App Store as well as any Custom Apps that have been made available specifically for me to purchase. I'd like all my users to have the Pages app for iOS available to install, so let's search for and get Pages.\n\nWhen my users install Pages from the Essentials app, the app is managed, which means updates happen automatically, and the app will be uninstalled if the user signs out of the device. I assign the app to my office.\n\nI need 4 licenses, and I confirm the price--free, in this case. Let's get the licenses for the app.\n\nNow that I have settings configured and apps purchased, let's group them together into a Collection. A Collection applies a combination of settings and apps to users and groups. This ensures that employees' devices are configured correctly and they have access to the apps that they need as soon as they sign in to their devices. I create a new Collection for my sales team and name it Sales.\n\nI add apps to my collection in the apps tab. Let's add Pages.\n\nSimilarly, I add settings to my collection in the settings tab.\n\nLet's search for and add the Wi-Fi and password policy settings.\n\nFinally, I add my Sales team to this collection in the User Groups tab.\n\nI just search for the Sales User group and add it.\n\nLet's save, and I can now see my newly created collection. Okay. I have apps and settings, and I've assigned them to my employees. Now, I need to give the employees a way to sign in to their devices. In the User list, let's find one of my employees, Eliza...\n\nAnd create a Managed Apple ID for her.\n\nEither I download a file with the user name and temporary password or send Eliza an email with her Managed Apple ID credentials directly.\n\nLet's explore what this looks like from Eliza's perspective. She has a company iPad and a personal iPhone. She uses her Managed Apple ID we created to enroll both devices. Let's start with the company-owned iPad.\n\nBecause this iPad was purchased specifically for my organization through Apple or an authorized reseller, Eliza gets the Work sign-in right when she sets up her device. She enters the username and password from the email I sent her.\n\nUpon completing setup, the device automatically joins the office Wi-Fi network that I've set up and the Essentials app is installed.\n\nNext, she sets up her personal iPhone. This device is already signed in with her personal Apple ID and has all of her personal apps and data. With Apple Business Essentials, Eliza can sign in to her work account separately. She goes to the settings app, selects general, VPN and Device Management, and sign in with a work or school account. Then she enters her username and password. Now her iPhone is signed into both her personal account and her Apple Business Essentials account. The best part is that these are crytographically separated, meaning her personal data stays private while her work data remains managed and secure.\n\nOnce enrolled, Eliza has all the settings automatically deployed to her device, and the Essentials app is downloaded.\n\nShe uses it to install all the apps I've assigned to her.\n\nOn the devices tab, she has all her devices and the Apple Support button. If something goes wrong with one of her devices, she initiates a repair request from inside the Essentials app with the \"Visit Apple Support\" button. Once approved, she requests a repair technician to come to her or she brings the device to an Apple Authorized Service Provider. I see the status in Service and Support, where I approve or deny the request.\n\nWith Apple Business Essentials, as your needs change, you go back and revisit your apps and settings. The changes you make are automatically pushed to your employees' devices.\n\nIf a device is lost or needs to be re-provisioned, you select the device, and either \"sign out user\", \"lock device\" or \"erase,\" and the action is taken on the device. And that employee replacing or upgrading their device just needs to sign in to a new device with their Managed Apple ID to access their apps, settings, and work data in iCloud.\n\nLet's wrap up. We reviewed how to get set up in Apple Business Manager. We subscribed to Apple Business Essentials, making a few key decisions along the way. We added settings and apps to collections which we assigned to a user group of employees and explored how the experience looks for employees on their devices. Apple Business Essentials, currently available to U.S.-based small businesses, lets you get back to doing what you do best, faster. It's simple to manage the entire life of your employees' devices with easy set up and onboarding, security and privacy, storage and backup, support and repair, and updates with one flexible subscription. To learn more about Apple Business Essentials, visit apple.com/business/essentials Have a great WWDC.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/110335/4/0F40B105-473E-42E2-A5BD-C33EE3C6B743/downloads/wwdc2022-110335_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/110335/4/0F40B105-473E-42E2-A5BD-C33EE3C6B743/downloads/wwdc2022-110335_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10045",
      "year": "2022",
      "title": "What's new in managing Apple devices",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10045"
    }
  ],
  "extractedAt": "2025-07-18T09:27:07.234Z"
}