{
  "id": "10009",
  "year": "2022",
  "url": "https://developer.apple.com/videos/play/wwdc2022/10009/",
  "title": "What’s new in iPad app design",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ instrumental hip hop music ♪ ♪ Hi, welcome to our session on iPad App design.\n\nI'm Bryant Jow.\n\nAnd I'm Grant Paul, and we're from the Apple Design Team.\n\nBryant: Today, we'll show you some of the new UIKit and SwiftUI updates in iPadOS 16, as well as some general tips for incorporating these into your app designs.\n\nWith iPadOS 16, people can take advantage of larger resolutions with extended display support and display zoom and work with their apps in a single view by using Stage Manager.\n\nSo what does this mean for iPad apps? Your app design should always embrace larger screens and different window sizes, as well as support all the different inputs of iPadOS.\n\nAnd now, your iPad apps should consider how to lean into more advanced use cases that come with using iPad like a desktop.\n\nSo that's why we're introducing a number of improvements to help apps become more powerful and easier to use.\n\nHere's a preview of the features we'll cover: toolbars and customization, document menu, editing menus, find and replace, navigation, search, tables, and selection.\n\nToday, we're going to show examples of how you can incorporate these updates in designing two kinds of experiences: document editing and content browsing.\n\nWe'll start with document editing and look at how these improvements can help people be more productive when using your app.\n\nLet's jump into toolbars.\n\nToolbars are a really important component in app design because they organize your app's functionality, and this impacts how easy it is for people to go about their workflows.\n\nHere's the previous toolbar in the Pages app in iPadOS 15.\n\nIn iPadOS 16, we're introducing a new toolbar layout that aligns titles to the left side and allows apps to offer more toolbar items in the center.\n\nLet's take a closer look.\n\nHere's the leading section of the toolbar.\n\nIt should contain items that help people navigate within and outside of the document, like the back and sidebar buttons.\n\nAnd it displays the new document title and menu, which I'll come back to later.\n\nWith more space in the toolbar, apps can elevate commonly used actions in the center.\n\nIn iPadOS 16, the Pages app shows actions for inserting content.\n\nYou should consider what are the most common workflows in your app where people could benefit from one-tap access.\n\nBut be careful not to pack your app's toolbar with too many items.\n\nLet's look at a couple more tools to consider if your app has a lot of functionality.\n\nIn iPadOS 16, you can enable customizable toolbars so people can curate the items that are most important for their workflow.\n\nIf your app has a lot of toolbar items or advanced features that not all people need, you should consider enabling customization.\n\nNote how items in the center section can be added, removed, or rearranged.\n\nItems outside of this section are not customizable because these may include navigation buttons or important features that need to be always accessible.\n\nToolbar items can also be grouped or collapsed.\n\nUse groups to keep related actions together in the toolbar or the overflow menu.\n\nIn the Pages app, similar actions like inserting tables, charts, shapes, and photos are grouped together.\n\nWhen there's not enough room in the toolbar, these actions collapse into a plus button.\n\nYou can also make wide toolbar items collapse into a compact glyph at smaller window sizes.\n\nNow, let's take a look at the trailing section of the toolbar.\n\nThis section may contain a variety of items: any button that invokes nearby inspectors, important items that should stay visible at any window size, and an optional overflow button for people to access hidden items as well as toolbar customization.\n\nWhen people resize your app, the toolbar items in the center will automatically hide into an overflow menu when there's not enough room.\n\nAnd when the window is resized even smaller, only the leading and trailing sections remain.\n\nSo make sure to arrange important items in the trailing section if you want them to be visible at most window sizes.\n\nSo here's a quick recap of toolbars.\n\nConsider if there are common workflows that you can elevate in the toolbar.\n\nArrange important toolbar items in the trailing section to avoid overflow in smaller window sizes.\n\nEnable customization if your app has many toolbar items and advanced use cases.\n\nAnd wherever possible, try to organize similar items into groups.\n\nNow let's take a look at the new document menu that we mentioned earlier.\n\nTo make it easier for people to find document-related actions in one place across apps, we're introducing a new title and menu in the toolbar.\n\nThis layout is intended for document viewers like Quick Look or document-editing apps like Keynote.\n\nNote, these apps may also have a browser view, which can appear as a back button near the document title.\n\nIf your app is primarily used for editing or viewing documents, you should consider using this new menu.\n\nLet's open Keynote's document menu by clicking the title.\n\nHere, you can see there is a combined set of standard document actions as well as app-specific ones.\n\nSo, what should go inside here? The menu should contain actions that affect the document as a whole.\n\nHere are some examples of standard actions that should go inside the document menu: Duplicate, Rename, Move, Export, and Print.\n\nYou can also add custom actions for your app.\n\nBut not everything should go inside in the document menu.\n\nActions that take content outside of your app should be placed under Share, and actions that directly affect content inside a document should support toolbar customization and appear in edit menus where appropriate.\n\nNext, I want to talk about a couple of features that can help users work more efficiently in your iPad app.\n\nLet's look at edit menus.\n\nThese menus may appear over selected text and contain edit options such as Copy and Paste.\n\nIn iPadOS 16, edit menus have a new look and are optimized for touch and pointer.\n\nWhen using touch, the menu appears horizontally and people can now scroll back and forth between the list of options like this.\n\nWhen using pointer, the edit menu shows a more comprehensive list of options in a vertical layout like this.\n\nYour app should support both styles for touch and pointer interactions.\n\nWhen you incorporate these edit menus into your app, here are a couple of things to remember.\n\nDon't remove the standard actions like Cut, Copy, and Paste.\n\nThese editing tools are important to many workflows and should be always available.\n\nAnd you should organize custom actions close to related system actions.\n\nIn iPadOS 16, the Notes app groups formatting options for checklists and text in the same section.\n\nEdit menus are not just limited to text fields.\n\nThey can also apply to objects on a document canvas.\n\nHere's an example of selecting layers in Keynote with touch.\n\nAnd that same menu when using pointer.\n\nTry to integrate these menus into any editable content so that people can be more productive when using your app.\n\nSo that's edit menus.\n\nNow, let's dive into find and replace.\n\nIn iPadOS 16, we're introducing find and replace into the system keyboard so people can quickly search for specific words, phrases, and more within a document.\n\nThis also supports advanced use cases like matching specific parts of a phrase or replacing all matches with a different word.\n\nAnd when iPad is attached to a hardware keyboard, the find and replace interface sits above the app in this compact appearance.\n\nTo make find and replace easy to access, consider adding an item inside the overflow menu as well as the system keyboard shortcuts.\n\nSo those are some of the new features we're introducing for document editing.\n\nNow I'm going to hand it off to Grant Paul, who will talk about some more improvements.\n\nGrant: Thanks, Bryant. Next up, I'm going to talk about improvements for content browsing, something that you do in a lot of different iPad apps.\n\nContent browsing experiences are everywhere on iPad, whether you're managing in your photo library in Photos, browsing Apple Music, or choosing a document in Pages.\n\niPadOS 16 has some great new features and patterns for content browsing.\n\nI'm going to focus on three areas that are important to this part of an app.\n\nThe first one is some updates to app navigation.\n\niPadOS 16 has a new style of navigation that we call \"browser-style\" navigation.\n\nFor example, the Files app uses back and forward buttons to let you easily browse between folders that might have come from different places in the sidebar.\n\nWith browser-style navigation, it's up to your app to choose the buttons that go to the left of the title.\n\nYou should make sure to keep to just those navigational buttons like back and forward, or maybe a sidebar button.\n\nBrowser-style navigation works well when your app has a complex hierarchy where people are often jumping between different levels; things like a file browser or a web browser.\n\nIf your app has a shallow or flat hierarchy, like Photos, you might not need browser-style navigation because all of the destinations in the app are already available with a single tap in the sidebar.\n\nIf you do use browser-style navigation, it goes great with another new feature in iPadOS 16: putting search in the top right of the navigation bar.\n\nSearch in the top right is great when your search bar is used to filter the content that you're looking at below on the same screen.\n\nAnd even though it's in the navigation bar, it supports suggestions.\n\nSuggestions show up right off the field as you're typing.\n\nYour app can suggest recent searches.\n\nIt can also suggest recommendations for what to search for.\n\nAnd it can suggest filters to narrow down your search.\n\nAgain, search in the top right is meant for searching the content that's showing below.\n\nIf you want to search your entire app at once, it's better to keep that in a search tab so that people can get to search from wherever they are in your app.\n\nThat's what's new for navigation.\n\nNext up, I want to talk about selection and menus.\n\niPadOS 15 introduced band selection, using the pointer to quickly select multiple notes at once.\n\nBut you still have to use the toolbar to act on the selection and to leave edit mode when you're done.\n\niPadOS 16 makes that much easier.\n\nIf you use band selection, iPadOS no longer enters editing mode automatically.\n\nYou can now use keyboard modifiers like Command and Shift to select and deselect, also without going into editing mode.\n\nAnd once you have the notes selected, it's just a secondary click to act on all of them together.\n\nWith touch, you can long press to get a context menu for those same actions.\n\nAnd these interactions work just as well with a list.\n\nYou can hold Command to select multiple notes, use drag-and-drop to move them into a folder, and bring up a context menu to act on multiple notes together.\n\nAlong with these multi-item context menus, iPadOS 16 also supports context menus in empty areas, which you can use to create something new.\n\nFor example, you can make a new folder in Files.\n\nOr, you can paste a copied event in Calendar.\n\nOK. That's a lot of things to keep in mind for selection.\n\nLet's go through the checklist.\n\nYour app should support keyboard focus to navigate around using the arrow keys and with tab.\n\nSupport band selection to quickly select multiple items in a grid by using the pointer.\n\nAllow multiple selection without entering editing mode when using the pointer or the keyboard.\n\nAdd context menus to act on multiple selected items together.\n\nAnd in the empty area, use a context menu to create new items.\n\nThe next thing I want to talk about is submenus.\n\nOn iPhone, submenus open vertically.\n\nSince space is limited and they're an extra tap away, it's best to use submenus on iPhone only when you really need one.\n\nBut on iPadOS 16, submenus open horizontally when they have space available.\n\nThis makes them much faster, especially with a pointer.\n\nFor example, Calendar uses a submenu to really quickly move an event into a different calendar.\n\nAnd Reminders uses submenus to quickly change the due date and the priority.\n\nSo on iPad, you should consider including submenus in your app's context menus to make quick changes just like these.\n\nAlong with submenus, iPadOS 16 also adds a new control for pop-up buttons in lists.\n\nJust like any other pop-up button, these show a menu to let you choose an option.\n\nLet's look at these in practice.\n\nIn the past, editing a reminder's priority meant pushing into the detail view, then popping back out.\n\nIt's a bunch of taps, and it also took you out of context.\n\nIn iPadOS 16, you change the priority right in place.\n\nIt's much faster, and you stay right where you are.\n\nSo as you've seen here, the main use for these pop-up buttons in lists is to replace navigation pushes in popovers and in modals.\n\nWhen you're using a pop-up button, choose places where you have a well-defined set of options to pick from.\n\nMake sure to only use a pop-up button if your options really do fit nicely into a menu.\n\nIf your option is better as a switch, use a switch.\n\nAnd if the options really need more controls, don't try and force it.\n\nBut if you only sometimes need more controls, a good choice can be to add a Custom option into the menu.\n\nWhen someone chooses Custom, your app can reveal the extra controls without getting in the way of the other choices.\n\nAnd if your options need an explanation, you can put that underneath the pop-up button in the list.\n\nAll right. That's what's new for selection and menus.\n\nLastly, I want to talk about tables.\n\nTables are a great new component in iPadOS 16 to make your lists of content more powerful.\n\nNow, in the past, you may have used a control called a table.\n\nBut that wasn't quite right; it's not much of a table if it only has a single column.\n\niPadOS 16 has a real table.\n\nTables in SwiftUI show multiple columns of information.\n\nAnd they let you sort just by tapping a header.\n\nNow, since iPad screens are relatively small, you'll only be able to show the most important columns.\n\nBut you can swap those columns out, like replacing Size with Kind, just by choosing a different sort option.\n\nAnd as makes sense for something that's all about having powerful access to your content, sortable tables also support all of the selection features I talked about earlier.\n\nSo tables are a really powerful control, but it's important to use them correctly.\n\nThese tables built into iOS 16 are built to show more information about a list of content, not to show a spreadsheet of data.\n\nYou can think of them as an extended version of the list views that you already have in your app.\n\nIn fact, when you resize an app to a compact width, tables will switch back into being single-column lists.\n\nAnd when they do, we recommend taking those details from the secondary columns and moving that information into a secondary line of text within each row so all of that information is still available.\n\nAnd for sorting, you can use a toolbar button to quickly reveal the sort options.\n\nSo those are the new components and features in iPadOS 16.\n\nLet's go back to Bryant to recap everything we talked about today.\n\nBryant: Thanks, Grant.\n\nA lot of the features we covered today are aimed around helping users be more productive with iPad.\n\nAs you think about how these relate to your iPad app, consider how you can make your app more powerful by offering more functionality, better organization, and make common editing and browsing tasks more efficient.\n\nEvaluate your app design in resizable windows and larger screens.\n\nAnd ensure your app works seamlessly with touch and pointer.\n\nGrant: And if you want an overview of what goes into designing a great iPad app, you should make sure to check out our previous talk, \"Designed for iPad.\" Bryant: Thanks for watching.\n\n♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/10009/5/22B7E083-47EE-4292-AD3E-6622DA2DF064/downloads/wwdc2022-10009_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2022/10009/5/22B7E083-47EE-4292-AD3E-6622DA2DF064/downloads/wwdc2022-10009_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10070",
      "year": "2022",
      "title": "Build a desktop-class iPad app",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10070"
    },
    {
      "id": "110343",
      "year": "2022",
      "title": "SwiftUI on iPad: Add toolbars, titles, and more",
      "url": "https://developer.apple.com/videos/play/wwdc2022/110343"
    },
    {
      "id": "10058",
      "year": "2022",
      "title": "SwiftUI on iPad: Organize your interface",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10058"
    },
    {
      "id": "10052",
      "year": "2022",
      "title": "What's new in SwiftUI",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10052"
    },
    {
      "id": "110930",
      "year": "2022",
      "title": "WWDC22 Day 2 recap",
      "url": "https://developer.apple.com/videos/play/wwdc2022/110930"
    }
  ],
  "extractedAt": "2025-07-18T09:36:45.519Z"
}