{
  "id": "10146",
  "year": "2023",
  "url": "https://developer.apple.com/videos/play/wwdc2023/10146/",
  "title": "Meet Core Location for spatial computing",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ Mellow instrumental hip-hop ♪ ♪ Hello there! I'm Ilya Veygman, an engineer with Core Location.\n\nI'm here today to talk to you about Core Location for spatial computing.\n\nWhether you're brand-new to Apple's ecosystem or a longtime App Store developer, you probably have lots of questions about the kinds of things this system can do.\n\nxrOS is great at showing you the fruits of your imagination, while Core Location is there to help you have an anchor in the real world.\n\nToday, I'm here to tell you all about how to do just that with Core Location.\n\nFor those of you who are brand-new to the Apple developer ecosystem, welcome! I'd like to start off with a simple example to show you just how straightforward it really is to add location to your app.\n\nFor experienced developers, it never hurts to review one's basics.\n\nSo let's start by looking at some sample code for this demo application associated with my colleague's session, \"Discover streamlined location updates.\" In this actor, we request live updates from CLLocationUpdate, and we'll get them asynchronously down here as they become available.\n\nFor more details on the location updates API, please refer to the session associated with this demo.\n\nApps must request the user's permission before accessing sensitive information such as location, so here, we invoke this API to do so.\n\nIn this simple example, we do it when the view inits.\n\nWe also have to ensure that we set this string in the app's info under Build Settings.\n\nAgain, apps must ask the user's permission before they can get sensitive information such as location, and this string is there to explain to the user why.\n\nIt will later be displayed in a prompt shown to the user requesting this access.\n\nSo let's see how this looks when we run it in the simulator.\n\nAgain, in this application, we ask for location access straightaway because it's a simple example.\n\nThis will not always be the case with your apps.\n\nYou can see that we get a prompt asking the user if they will grant access to their private information.\n\nNow before moving on, let's chat a little bit more about how Core Location treats user privacy on this system.\n\nEven if you are new to our developer ecosystem, you might already be aware that Apple is heavily focused on privacy in its user experience.\n\nLocation access is not an exception to this maxim.\n\nBefore you can get updates about geolocation, you must first ask the user for permission to access their location information.\n\nYou will not get location updates without user consent.\n\nYou can ask for consent on this system by creating a location manager and invoking requestWhenInUseAuthorization, along with setting the usage description string in your app's Info.plist.\n\nThis, again, tells the user why your app needs to know their location.\n\nFinally, you should only ask for this access in a context when your application actually needs it.\n\nNot only is this better from a privacy perspective, it also ensures the user is more likely to allow access at all.\n\nRecall that we did this in our sample code since it was a very simple example and starts asking for location updates immediately.\n\nSo what does this prompt look like and what does it show? Users will see a prompt from your application similar to the one here.\n\nThis may look familiar to those of you watching who already have experience with iOS development.\n\nA user can grant location access for just this session, while using the app, or deny it entirely.\n\nUsers may also choose to grant your application knowledge of either their precise or approximate location using the highlighted button, just like on iOS.\n\nFor more information on how exactly this precise versus approximate location works, please refer to \"What's new in location\" from WWDC20, hosted by a younger version of myself.\n\nSo back to the demo.\n\nAfter we grant this application access to precise location and authorize it while in use, we can now start getting location updates and see our app getting position updates.\n\nSo what exactly did I mean by \"precise location\"? That is, how accurately can the headset know a user's location? For a unit by itself, you should expect accuracy similar to that of a Mac, so that's about 100 meters.\n\nThis will be sufficient for applications like those used for finding nearby restaurants, parks, and other attractions.\n\nHowever, if your iPhone is nearby, this device can leverage existing connections between these two devices to improve the location accuracy you would get from the headset to be on the same level as that of an iPhone.\n\nYour device works even better when together with our other Apple hardware.\n\nThis opens up a whole new range of applications which can run on a spatial computing system like this one, such as precise weather updates, geotagging, and more.\n\nNow for both newcomers and experienced developers, you've also heard me say that an app is eligible to get location updates while a user is using it.\n\nWhat this means is fairly straightforward on iPhone or watch, but what does it mean for us? The user experience is, after all, very different from an iPhone or a watch.\n\nSo, let's talk about that.\n\nLet us call back to \"What's New In Core Location\" from 2019 where we discussed how and when foreground apps are considered to be in use on iOS.\n\nFor a platform like iPhone, this is fairly obvious.\n\nThere can only really be one app foregrounded at any given time.\n\nThere is also a short grace period after the app is backgrounded while it can still get location updates.\n\nSo what about here? Your application on this platform can be fully immersive, or you could have apps running in something like a window.\n\n\"How does Core Location treat this?\" you're probably wondering.\n\nFor a fully immersive experience, this is straightforward.\n\nAs long as the user is running your application, we consider it to be in use and eligible to get location updates, assuming that the user has granted consent for your app to get their location.\n\nOn this system, Core Location provides location information to your app, so long as the user has recently looked at the app.\n\nTo wit, on this platform, we consider apps running in a window to be eligible to get location updates if the user has consented to giving their location to them, and if the user has recently looked at the app.\n\nLet's examine this more concretely.\n\nImagine that both of these apps have been authorized to access the user's location while in use.\n\nSo long as the user is not interacting with or looking at either app, neither one will be able to get location updates.\n\nIf the user starts looking at -- that is, interacting with -- the app on the left, that app can now get location updates, while the right one still cannot, even if it happens to be in the user's peripheral vision.\n\nAnd this will remain true until the user looks somewhere else, such as at the app on the right, or moves the two apps together such that they can look at both of the apps at the same time.\n\nJust like in iOS, there is also a grace period before Core Location considers the app to no longer be in use.\n\nThis means that if the user were to look at an app on the left, then at the app on the right before looking somewhere else, there will be a short period of time -- a few seconds -- when both apps are still eligible to get location before Core Location considers these apps to be out of use.\n\nWe feel that such a model of location access provides a good experience on this platform while being respectful of user privacy, since a user would not have their location tracked without their permission or knowledge, particularly since this device is intended to be used interactively, rather than as something which runs stashed somewhere like in your backpack.\n\nAs such, apps will not be able to get location updates while they're not running.\n\nSimilarly, updates from our monitoring APIs would not be delivered.\n\nSo this brings me to something else which many developers who already have location-using apps for Apple platforms are probably wondering about: How will my app behave when running in compatibility mode? So what happens if I just run my iPhone or iPad app with no code changes for a device running xrOS? Let's talk about that a bit.\n\nAs already discussed, the \"in-useness\" of \"while in use\" derives from where the user has looked recently.\n\nAnd apps are eligible to get location only when the user is looking at them.\n\nSo what about apps which request Always authorization? Apps which prompt for Always will have their request redirected to request authorization while in use.\n\nYou will similarly see that Always is not an option for your application under Settings.\n\nLocation on this system works best for single-shot or continuous updates while your app is being used.\n\nIf your compatible iPhone or iPad app uses region monitoring or our new CLMonitor, it will not be delivered events.\n\nConsider if your iOS app is designed in such a way that assumes a particular API is always supported, and might behave in unexpected ways if, for example, monitoring APIs never deliver events.\n\nSimilarly, consider whether your app relies on getting location updates in the background while it's not running.\n\nTo learn more about our API in general, especially what's new this year, I would recommend that you watch these other two sessions from my colleagues, as well as any of our other sessions from previous years, especially if you're a newcomer to our ecosystem.\n\n\"Discover streamlined location updates\" discusses some new developments in our API, particularly around how we recommend getting location updates and ways in which we have made our API more compatible with Swift concurrency.\n\n\"Meet Core Location Monitor\" further discusses new developments in monitoring APIs, and how we've reimagined the ways an app can get notified about events such as geographic entries and exits.\n\nIf location is something you care about for your app, I am certain that you'll find these to be time well spent.\n\nxrOS provides a really cool experience that I'm sure many of you have been anticipating for quite some time.\n\nWe have been too, and we worked hard to ensure that you can provide the best possible user experience both for apps which were designed specifically for this device, and for those compatible iPhone or iPad apps.\n\nWe also want to make sure that user privacy is respected in the best ways possible, and that a transition to this platform is as seamless as possible for those of you who have existing apps in our store.\n\nNow that said, do consider how your compatible apps might behave in a scenario when they don't receive notifications about events like region changes or visits.\n\nI definitely encourage you to watch any of the other sessions, both specific to Core Location and to spatial computing in general, which might pique your interests.\n\nThank you and enjoy the rest of WWDC.\n\n♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Adopting live updates in Core Location",
        "url": "https://developer.apple.com/documentation/corelocation/adopting_live_updates_in_core_location"
      },
      {
        "title": "Core Location",
        "url": "https://developer.apple.com/documentation/CoreLocation"
      },
      {
        "title": "Monitoring location changes with Core Location",
        "url": "https://developer.apple.com/documentation/CoreLocation/monitoring-location-changes-with-core-location"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10146/4/17F61886-5FF3-42B0-969D-5B6FB86820B2/downloads/wwdc2023-10146_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10146/4/17F61886-5FF3-42B0-969D-5B6FB86820B2/downloads/wwdc2023-10146_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10180",
      "year": "2023",
      "title": "Discover streamlined location updates",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10180"
    },
    {
      "id": "10147",
      "year": "2023",
      "title": "Meet Core Location Monitor",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10147"
    },
    {
      "id": "10090",
      "year": "2023",
      "title": "Run your iPad and iPhone apps in the Shared Space",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10090"
    },
    {
      "id": "705",
      "year": "2019",
      "title": "What's New in Core Location",
      "url": "https://developer.apple.com/videos/play/wwdc2019/705"
    }
  ],
  "extractedAt": "2025-07-18T09:14:09.512Z"
}