{
  "id": "10094",
  "year": "2023",
  "url": "https://developer.apple.com/videos/play/wwdc2023/10094/",
  "title": "Enhance your iPad and iPhone apps for the Shared Space",
  "speakers": [],
  "duration": "",
  "topics": [
    "Developer Tools"
  ],
  "hasTranscript": true,
  "hasCode": true,
  "transcript": {
    "fullText": "â™ª Mellow instrumental hip-hop â™ª â™ª Mellow instrumental hip-hop â™ª Howdy! Welcome to \"Enhance your iPad and iPhone apps for the Shared Space.\" My name is John Marc. I'm a platform compatibility engineer. Most iPad and iPhone apps run great without any changes, taking advantage of the hard work you've already done and making it work on Apple's latest platform. If you're just getting started, watch \"Run your iPad and iPhone apps in the Shared Space\" first to learn about the system's built-in behaviors, functional differences, and testing setup. In this video, I'll go over how to enhance your iPad or iPhone app from a great app to one that feels at home on this new platform. I'll review the new interaction, visual-appearance changes, and media recording and playback functionality your app should expect. Interaction on this platform is fun and feels familiar. One of the key components is the new natural input technique. Tap allows people to look at a button, then tap their fingers together to interact. People can tap to toggle, tap, hold and swipe to interact with a slider, or tap a button.\n\nDirect touch requires reaching out to the app and touching the button in the space with one finger. Regardless of interaction method, the button provides continuous visual feedback to help with interaction accuracy. In this video, the cursor represents where a person is looking. When looking at a button, a highlight hover effect tints the control's color to help understand where focus is. Notice that each item highlights while looking through this list. That highlight follows focus to the left, or right so it's clear what's happening. Hover effects exist on controls to inform where people are looking. Controls that are inactive do not get hover effects. System controls take care of all these hover effects for you. If you're only using the standard controls, you're ready to rock and roll without any changes here. If you're building custom controls, your hover effects may need some tuning. Here's an example of an app with a card-based interface on iPad. Each card contains a photo, title, date, and menu button. Here is that same app running in Simulator. Because the menu button is a system control, it's already working as expected. However, each card is a simple VStack with a .onTap modifier, so it does not receive hover effects. That entire card is a tap target, so it needs hover effects to inform people it has an available interaction. Let's focus on one of those cards to fix it. System controls, like Button, receive hover effects automatically, so the button used as a menu here already has a hover effect. However, in this example, people click the entire card to view more detail. By adding .hoverEffect onto the VStack, the entire card becomes available for interaction update and informs people it's tappable. Many custom video players have optimized hit targets so people don't have to be quite so precise to interact with them. In this example of a custom video player on iPad, the tap targets are significantly larger than the symbols on the skip forward and skip backward buttons. The bordered boxes here show the size of the tap targets where people can interact. On Simulator now, hover effects highlight those tap targets, which shows a tappable region over the entire area. That same example in the Shared Space now shows the hidden attributes with hover effects. This change of appearance is exposing the truth but does not feel correct.\n\nIf we zoom into our example, to keep the existing tapping behavior with reduced appearance, add a custom shape to the .contentShape modifiers. By using a custom shape, apps can provide an origin and size to the .contentShape modifiers, which will be smaller than the tappable region. In this video, people looking directly at the button will see a hover effect. And with this change, tapping outside the hover effect bounds will match expectations from iPad and iPhone experiences. Back on the simulator with the full example. Now with this custom shape, the hover effect appears on just the buttons but allows tapping outside of them. Excellent! In most cases, hover effects on system controls work great; however, the ability to customize hover effects is powerful. With the new hover effect API, apps can create hover effects for custom buttons, custom shapes, or even opt out of a control if necessary. Let's inspect how to do that. .buttonStyle is a great way to consistently apply a custom style to all buttons in apps. When applying custom styling, it turns off hover effects. To reenable hover effects on a custom .buttonStyle button, add the .hoverEffect() modifier to app elements. Here is my simple button with a custom button style. Looking at the custom button style, here, we need to add the .hoverEffect modifier to add hover effects to the button with custom styling. Many apps have fun and custom interfaces. In this example of a beekeeping app, buttons are honeycombs, where each honeycomb cell is its own tap target. Apps implementing custom shape buttons will need to inform the system how to render their hover effects. Frame width here is larger than the area the shape occupies, so the default system-provided hover effect covers the entire button frame, unbounded to shape. By passing a custom shape to the .contentShape modifier, hover effects will trim to the button's bounds. Let's add that here. Now it is perfect, because when people look at individual buttons, the hover effect is trimmed to the geometry of the button's shape. System controls that are disabled due to app state automatically do not get hover effects. If apps want to de-emphasize specific interface elements, they can opt out individual items. People expect hover effects to be apparent and consistent across the system, so they should be turned off sparingly. The system accepts a maximum of two simultaneous inputs since each hand is a distinct touch. Custom gesture recognizers are also supported, but you may need to update them to run smoothly with the natural input expectations. Games, or other apps that need rapid or simultaneous input, need to support game controllers. iPad and iPhone apps have long been able to indicate support for game controllers. On this platform, it's even more critical for additional input methods. By including GCSupports ControllerUserInteraction in the Info.plist and adding Game controller capability, it adds a badge to the app's product page. This improves communication with people using App Store to find games, and makes the availability of game controllers even more evident across all platforms. For information about game controllers and games on App Store, watch the videos \"Advancements in Game Controllers\" and \"Build great games for spatial computing.\" iPad and iPhone apps running on this platform match their iPad light-mode appearance. In most cases, that looks great. If you're using system standard controls, layouts, and colors, there's no new work for you here. The system optimizes rendering, using dynamic content scaling so all images and text are always sharp at any angle, from any distance. To provide the best experience, use vector-based content. Prompts on iPad and iPhone are presented modally, so the prompt must be interacted with before continuing. On this new platform, prompts do not present modally. Prompts such as asking for location permission, Sign in with Apple, or OAuth, do not require handling before continuing. These interfaces create their own chrome and windowed experience. Apps should be aware and handle cases where they get the prompt, but may not get immediate cancelled or success call backs. People capturing, sharing, and posting content is a great way to express themselves. On this platform, there are some differences apps should be aware of. There are multiple external and internal facing cameras. However, many of these cameras are not available for app use. It is critical to use discovery sessions to detect which cameras and microphones are available for use. To ensure apps have an excellent capture experience, use AVCaptureDevice discovery session to confirm hardware availability. Additionally, similar to other platforms, requesting permission before use is required. Lastly, generalize your authorization prompt string to inform people of use, without mentioning specific hardware or software versions.\n\nWhen apps request camera and microphone availability, expect different values to be returned than iPad and iPhone. When querying microphone, apps will receive a single .front location microphone. When querying camera, apps will find two cameras. The .back camera returns a black camera frame with a no camera glyph. This is a nonfunctional camera to support apps that assume back camera availability. When querying for front camera, apps find a single composite camera. If no spatial persona is found on a device, then no camera frames will return to apps. AVRoutePickerView and Picture in Picture are unavailable on this platform, which has been reflected in system-provided players. Apps that implement custom players need to check both availabilities before showing these controls. Lastly, this platform locks once removed. Apps that utilize background audio should consider this difference, as they will no longer get this background mode when the device is locked, and will be fully suspended. Apps that import media should consider alternative sources when capture hardware isn't available. Options such as iCloud or content pickers, like document or photo picker, are excellent alternatives. Additionally, apps that use VisionKit's VNDocumentCameraViewController will automatically capture with Continuity Camera on a nearby device. These alternatives bring even more media-import options to existing iPad and iPhone apps. iPad and iPhone apps run great on this new platform. Make sure hover effects are added to all your interactive controls. For games, add controller support to ensure players continue to have a great experience. Finally, review your assumptions about camera and microphone presence by checking for availability before use. Now you know how to optimize iPad and iPhone apps for this new platform. I'm looking forward to using your apps in the shared space. â™ª",
    "segments": []
  },
  "codeExamples": [
    {
      "timestamp": "3:02",
      "title": "Tappable VStack with hover effect",
      "language": "swift",
      "code": "struct TappableCard: View {\n   // Sample card\n   var imageName = \"BearsInWater\"\n   var headline = \"Bear Fishing\"\n   var timeAgo = \"42 Minutes ago\"\n   \n   var body: some View {\n      VStack {\n         VStack(alignment: .leading) {\n            Image(imageName)\n               .resizable()\n               .clipped()\n               .aspectRatio(contentMode: .fill)\n               .frame(width: 300, height: 250, alignment: .center)\n            Text(headline)\n               .padding([.leading])\n               .font(.title2)\n               .foregroundColor(.black)\n         }\n         Divider()\n         HStack {\n            HStack {\n               Text(timeAgo)\n                  .frame(alignment: .leading)\n                  .foregroundColor(.black)\n            }\n            .padding([.leading])\n            Spacer()\n            VStack(alignment: .trailing) {\n               Button { print(\"Present menu options\") } label: {\n                  Image(systemName: \"ellipsis\")\n                     .foregroundColor(.black)\n               }\n            }\n         }\n         .padding(EdgeInsets(top: 5, leading: 5, bottom: 5, trailing: 5))\n      }\n      .frame(width: 300, height: 350, alignment: .top)\n      .hoverEffect()\n      .background(.white)\n      .overlay(\n         RoundedRectangle(cornerRadius: 10)\n            .stroke(Color(.sRGB, red: 150/255, green: 150/255, blue: 150/255, opacity: 0.1), lineWidth: 3.0)\n      )\n      .cornerRadius(10)\n      .onTapGesture {\n         print(\"Present card detail\")\n      }\n   }\n}"
    },
    {
      "timestamp": "4:08",
      "title": "Custom player with tap targets that are larger than the hover effect bounds",
      "language": "swift",
      "code": "struct ContentView: View {\n   var body: some View {\n      VStack {\n         // Video player\n         HStack {\n            Button { print(\"Going back 10 seconds\") } label: {\n               Image(systemName: \"gobackward.10\")\n                  .padding(.trailing)\n                  .contentShape(.hoverEffect, CustomizedRectShape(customRect: CGRect(x: -75, y: -40, width: 100, height: 100)))\n                  .foregroundStyle(.white)\n                  .frame(width: 500, height: 834, alignment: .trailing)\n            }\n            Button { print(\"Play\") } label: {\n               Image(systemName: \"play.fill\")\n                  .font(.title)\n                  .foregroundStyle(.white)\n                  .frame(width: 100, height: 100, alignment: .center)\n            }\n            .padding()\n            Button { print(\"Going into the future 10 seconds\") } label: {\n               Image(systemName: \"goforward.10\")\n                  .padding(.leading)\n                  .contentShape(.hoverEffect, CustomizedRectShape(customRect: CGRect(x: 0, y: -40, width: 100, height: 100)))\n                  .foregroundStyle(.white)\n                  .frame(width: 500, height: 834, alignment: .leading)\n            }\n         }\n         .frame(\n              minWidth: 0,\n              maxWidth: .infinity,\n              minHeight: 0,\n              maxHeight: .infinity,\n              alignment: .center\n         )\n      }\n      .frame(\n           minWidth: 0,\n           maxWidth: .infinity,\n           minHeight: 0,\n           maxHeight: .infinity,\n           alignment: .topLeading\n      )\n      .background(.black)\n   }\n}\n\nstruct CustomizedRectShape: Shape {\n   var customRect: CGRect\n   \n   func path(in rect: CGRect) -> Path {\n      var path = Path()\n      \n      path.move(to: CGPoint(x: customRect.minX, y: customRect.minY))\n      path.addLine(to: CGPoint(x: customRect.maxX, y: customRect.minY))\n      path.addLine(to: CGPoint(x: customRect.maxX, y: customRect.maxY))\n      path.addLine(to: CGPoint(x: customRect.minX, y: customRect.maxY))\n      path.addLine(to: CGPoint(x: customRect.minX, y: customRect.minY))\n      \n      return path\n   }\n}"
    },
    {
      "timestamp": "5:14",
      "title": "Button with custom buttonStyle, then adding a hover effect to the button",
      "language": "swift",
      "code": "struct ContentView: View {\n    var body: some View {\n        VStack {\n         Button(\"Howdy y'all\") { print(\"ðŸ¤ \") }\n            .buttonStyle(SixColorButton())\n        }\n        .padding()\n    }\n}\n\nstruct SixColorButton: ButtonStyle {\n   func makeBody(configuration: Configuration) -> some View {\n      configuration.label\n         .padding()\n         .font(.title)\n         .foregroundStyle(.white)\n         .bold()\n         .background {\n            // Background color bands\n            ZStack {\n               Color.black\n               HStack(spacing: 0) {\n                  // GREEN\n                  Rectangle()\n                     .foregroundStyle(Color(red: 125/255, green: 186/255, blue: 66/255))\n                     .frame(width: 16)\n                  // YELLOW\n                  Rectangle()\n                     .foregroundStyle(Color(red: 240/255, green: 187/255, blue: 64/255))\n                     .frame(width: 16)\n                  // ORANGE\n                  Rectangle()\n                     .foregroundStyle(Color(red: 225/255, green: 137/255, blue: 50/255))\n                     .frame(width: 16)\n                  // RED\n                  Rectangle()\n                     .foregroundStyle(Color(red: 200/255, green: 73/255, blue: 65/255))\n                     .frame(width: 16)\n                  // PURPLE\n                  Rectangle()\n                     .foregroundStyle(Color(red: 134/255, green: 64/255, blue: 151/255))\n                     .frame(width: 16)\n                  // BLUE\n                  Rectangle()\n                     .foregroundStyle(Color(red: 75/255, green: 154/255, blue: 218/255))\n                     .frame(width: 16, height: 500)\n               }\n               .opacity(0.7)\n               .rotationEffect(.degrees(35))\n            }\n         }\n         .cornerRadius(10)\n         .hoverEffect()\n   }\n}"
    },
    {
      "timestamp": "5:46",
      "title": "Honey comb app with custom shape buttons, then adding hover effects that clip to bounds of the honey comb shape",
      "language": "swift",
      "code": "struct ContentView: View {\n    var body: some View {\n      VStack {\n         Button { print(\"ðŸ\") } label: {\n            // Button label\n            HoneyComb()\n               .fill(.yellow)\n               .frame(width: 300, height: 300)\n               .contentShape(.hoverEffect, HoneyComb())\n            }\n         }\n         .frame(width: 400, height: 400, alignment: .center)\n         .background(.black)\n         .padding()\n      }\n    }\n}\n\nstruct HoneyComb: Shape {\n   func path(in rect: CGRect) -> Path {\n      var path = Path()\n      path.move(to: CGPoint(x: rect.minX + (rect.width * 0.25), y: rect.minY))\n      path.addLine(to: CGPoint(x: rect.maxX - (rect.maxX * 0.25), y: rect.minY))\n      path.addLine(to: CGPoint(x: rect.maxX, y: rect.midY))\n      path.addLine(to: CGPoint(x: rect.maxX - (rect.maxX * 0.25), y: rect.maxY))\n      path.addLine(to: CGPoint(x: rect.minX + (rect.width * 0.25), y: rect.maxY))\n      path.addLine(to: CGPoint(x: rect.minX, y: rect.midY))\n      path.addLine(to: CGPoint(x: rect.minX + (rect.width * 0.25), y: rect.minY))\n      return path\n   }\n}"
    }
  ],
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10094/4/701039CD-C751-471F-A029-A2407B622C61/downloads/wwdc2023-10094_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10094/4/701039CD-C751-471F-A029-A2407B622C61/downloads/wwdc2023-10094_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10096",
      "year": "2023",
      "title": "Build great games for spatial computing",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10096"
    },
    {
      "id": "10012",
      "year": "2023",
      "title": "Explore App Store Connect for spatial computing",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10012"
    },
    {
      "id": "10090",
      "year": "2023",
      "title": "Run your iPad and iPhone apps in the Shared Space",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10090"
    },
    {
      "id": "10614",
      "year": "2020",
      "title": "Advancements in Game Controllers",
      "url": "https://developer.apple.com/videos/play/wwdc2020/10614"
    }
  ],
  "extractedAt": "2025-07-18T09:40:54.121Z"
}