{
  "id": "111486",
  "year": "2023",
  "url": "https://developer.apple.com/videos/play/wwdc2023/111486/",
  "title": "17 big & little things at WWDC23",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Seventeen big and little things from Apple WWDC23.\n\nMeet a new friend? Swap info, like that, with NameDrop.\n\nAnd your contact poster that you'll design and redesign will show up when you call or FaceTime.\n\nThey missed it? Leave a FaceTime message.\n\nAnd when you do connect, easily switch from iPhone to Apple TV.\n\nWait, where's the Siri remote?  Now iPhone will find that too.\n\nAnd you'll find the perfect reaction with stickers from your own photos.\n\nOoh, shiny.\n\nReflect on your day with suggestions from your photos, music, locations, even workouts, or just get some stuff off your chest.\n\nThen clear your head with a long ride.\n\nGet lost for a little while, but not like lost, lost, because you can take topographic and offline maps with you.\n\nAnd Snoopy too! Check In automatically lets a friend know when you get home.\n\nAnd while you're out, Adaptive Audio keeps your attention on the important sounds around you.\n\nSpeaking of, multiple timers and widgets are now on all your devices, including the world's thinnest 15-inch laptop, the new MacBook Air.\n\nPut in some serious work with Game Mode on Mac.\n\nWhen you're charging iPhone, Standby will turn it into a simple clock, a music player, or even a live scoreboard.\n\nUgh, I might have to take this.\n\n♪ Elevator music ♪ Nope! Screen your calls with Live Voicemail.\n\nThat's so  cool! A-ha! New and improved Autocorrect.\n\nAnd you can log your moods and emotions right on iPhone, iPad, and watch.\n\nHold on.\n\nThere was something else -- something really big.\n\n♪ Piano music bridge ♪ This.\n\n♪  ♪ Yeah. It was a big day.\n\nGet all the updates on apple.com.\n\n♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/111486/1/E48AB1B2-961B-4614-91E7-45A9FAF3D835/downloads/wwdc2023-111486_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/111486/1/E48AB1B2-961B-4614-91E7-45A9FAF3D835/downloads/wwdc2023-111486_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T10:22:30.116Z"
}