{
  "id": "10271",
  "year": "2023",
  "url": "https://developer.apple.com/videos/play/wwdc2023/10271/",
  "title": "Explore immersive sound design",
  "speakers": [],
  "duration": "",
  "topics": [
    "Audio & Video",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ Mellow instrumental hip-hop ♪ ♪ Welcome to \"Explore immersive sound design.\" I'm Danielle Price, and I'm a sound designer on the Design team.\n\nThe content in this talk will include spatial audio examples, so for the best experience I recommend wearing headphones.\n\nWhile not everyone watching this talk is a sound professional, we all have some expertise in spatial audio just from being human.\n\nI'll illustrate this with an example you might be familiar with.\n\nLet's say I can't find my iPhone.\n\nI'll ping it from my Apple Watch and track it down.\n\nI hear it out of my right ear...\n\nIt's getting louder; I'm getting closer.\n\nFound it! I'm able to locate the sound because I'm aware of the direction and the volume.\n\nAs you can see, we use spatial audio constantly to navigate the world.\n\nAnd in this case, I used it to locate my iPhone in the room.\n\nLike we saw in the Find My example, in the real world, sound reverberates through and around our space, bouncing off walls and furniture before arriving at a person's ears.\n\nWell, the system can mimic this behavior because it understands the spaces around you.\n\nNow I'm going explain more about how Spatial Audio works on the headset and the different ways that we can design for it.\n\nFirst, I'll break down how Spatial Audio works within the system.\n\nThen I will talk through some examples about how to design sounds for the UI and immersive apps.\n\nSo back to this idea of recreating sounds from the real world.\n\nThe device adapts to different spaces and adds reverberation from your space to make things sound like they're really in the room.\n\nSpatial audio sources will sound like they are closer or farther away depending on where they're placed.\n\nI'm going to play the Find My sound a couple different ways so you can hear how this works.\n\nFirst, here's the original sound that I exported.\n\nNotice how it sounds clean and front and center.\n\nOK, now here's the same sound but played in a different space, like this living room.\n\nAlso notice that the sound is coming from in front of you, but also that it's directionally coming from the right side of the couch.\n\nThe system considers the size and materials in your room to allow accurate playback of audio.\n\nI know this is a simple example but this concept helps define how we hear sound on this platform.\n\nYou may already be familiar with Spatial Audio for music and media, and now you're able to extend that by playing sounds in your apps as if they are coming from where you place them.\n\nI'll be referring to these sounds as spatial audio sources.\n\nLet's look at how this applies to interaction sounds.\n\nWhen we interact with the system using our hands and eyes, we're not touching anything physical.\n\nSo by adding subtle sounds to each interaction, we help give the user a sense of familiarity and confidence.\n\nHere's an example of the virtual keyboard.\n\nListen for the sound of each key press and how it comes from its location on the keyboard in front of you.\n\nEach time you interact with the keys, the familiar sound confirms your action.\n\nA quick note on repetition: you may notice each key press sounds a little different.\n\nWhen you know a sound will be played often, it helps to slightly randomize some elements of the sound like its pitch and amplitude.\n\nIt feels more natural and less static when keys are pressed in rapid succession.\n\nConsider this to make your app feel more natural.\n\nNext, let's look at another example of how we designed the UI sounds you hear in the system.\n\nWhen we started designing the Photos app, there were certain interactions we wanted to emphasize with sound, like selecting a photo from the grid and transitioning from 2D to 3D.\n\nOr when you're browsing through your photo album.\n\nSo, where do we start our sound design exploration? Well, we could record the sound of a window opening.\n\nOr would that be a little too literal? Let's have a listen.\n\nAnd if we go that route, maybe we can use the sounds of moving through projector slides for the browsing interaction.\n\nWhile certainly interesting sound design examples, they don't really fit the visual aesthetic of the experience.\n\nWe wanted the sounds in Photos to fit in with the rest of the system sounds, and also highlight a sense of depth.\n\nWe think a good UI sound has to be subtle and give just enough feedback to be helpful.\n\nThat said, for your own app you can add some character, of course, but strive to make it fit with the overall feel of the UI.\n\nWith this in mind, let's have a look again, this time with the new sounds we designed.\n\nMuch better.\n\nThe sounds align with the rest of the OS sounds and match the timing of the transitions.\n\nWhen you begin to add interaction sounds to your own app, keep in mind people may hear them quite often, so keeping those sounds subtle is important.\n\nOK, now that we've learned about the role of UI sounds on the device, let's talk about using sound in some more immersive experiences.\n\nLet's look at one of our environments, Mount Hood.\n\nThese environments are fully immersive experiences in the system.\n\nEach place has a light and dark version.\n\nAnd both have a realistic spatial soundscape to match.\n\nThe overall goal for these soundscapes is to be peaceful representations of reality.\n\nThey could play underneath the various apps you're using, and are meant to be subtle, not distracting.\n\nLet's talk about some different ways to design, record, and mix sounds for these experiences.\n\nAs we began to think about the sound design for each place, one of the first things we asked ourselves was, how accurate should they sound? We went to the various locations to record, and the actual soundscapes often surprised us -- and not always in a good way.\n\nLet's take a look at some of my personal footage from the Mount Hood location.\n\nI just love this shot.\n\nWhen we did preproduction planning, I would look at the images, close my eyes, and imagine the peaceful soundscape of birdsongs and soft winds in the distance.\n\nOf course it was beautiful and those things do exist, but that wasn't all there was.\n\nLet's take a look at footage from just to the right of where I took this photo.\n\nWhat you're seeing and hearing is actually a large water drainage system.\n\nAnd the noise is so loud you can't really hear any other nature sounds.\n\nThat noise reminds me of something else; let's listen again.\n\nNot really what we were looking for.\n\nAs designers and developers, we have the freedom to curate the best user experience for our app.\n\nIn this case, we wanted to stay as close to reality as possible.\n\nBut if we have the chance to make something more pleasant than what actually exists, we should.\n\nSo feel free to recreate and curate the best of reality, making the sound of your application complement its visuals in the best way possible.\n\nNow let's talk more about the audio recording process.\n\nFor the ambient background audio, we used a series of different microphones that record immersive audio, like the one in this photograph.\n\nThe goal for these recordings was to capture how the air sounds all around you in a place.\n\nWe would record all through the day and night to make sure we captured the entire range of sound activity.\n\nGenerally, we set out in search of places with as little noise pollution as possible, which usually required going off the beaten path.\n\nThese natural recordings would become the base layers that play under the spatial audio sources.\n\nWe would use high-sensitivity directional microphones that could zoom in on that specific sound we were looking for.\n\nIf you work with a professional sound designer, they can record sounds for you, but there are also plenty of professional high-quality sound libraries that could be a great source of sounds for your app.\n\nNow, once we've recorded our sounds, how do we create a realistic soundscape? Remember the Find My sound playing from one point in the room? We used that same thinking for placing audio objects in environments.\n\nOnce again, we can draw from real-life experiences.\n\nWhen we go outside, there are many different types of animals that make sounds from different locations and they all layer together to make a soundscape.\n\nOur job is to recreate that with the right distance and placement.\n\nSo let's take everything we've learned and create a mix for Mount Hood.\n\nThere are two main categories of sounds we use when putting together a soundscape.\n\nSpatial audio sources, which are sound elements that occupy a point in space like birds, crickets, frogs.\n\nThese sounds were generally placed in the foreground and midground of an environment, but you can place them anywhere in your app.\n\nAnd the ambient background audio, this is the overall ambience of a place.\n\nThey are surround audio files anchored to play all around you and loop continuously without being noticeable.\n\nI'll use these emojis to represent where we placed them in environments.\n\nFirst, let's try placing the sounds of the crickets and frogs on the left and the right.\n\nNow let's adjust this.\n\nIt's way too loud and feels too close, so we need to do two things.\n\nFirst, turn down the volume of each a few decibels, And then push the location of the sound into the distance so it can sound further away.\n\nLet's listen again.\n\nIt's starting to feel more natural.\n\nNow, let's add a couple of frogs in the foreground, on the shore line.\n\nThat sounds really great, but we don't want to hear the same frog over and over again from the same spot.\n\nSo if we use randomization, we can create a more natural soundscape.\n\nWe could achieve that by alternating between a collection of different frog recordings as well as the location they are playing from.\n\nFrom there, we can randomize the timing of when they are played.\n\nOK, now let's listen to everything together.\n\nThere's still one more thing we need to add.\n\nRemember the ambient backgrounds we mentioned earlier? Let's listen with the visual.\n\nThese sounds are played in surround, softly adding ambience to the space around you.\n\nNow, let's listen to all the sounds together as it's experienced in the mix.\n\nSo let's recap our visit to Mount Hood.\n\nRandomization will be a recurring theme.\n\nLike we mentioned with the virtual keyboard typing, and with the foreground frog sources, be careful when repeating sounds over long periods of time.\n\nUse randomization to affect how things play and to mix it up.\n\nConsider placement.\n\nPutting sounds in the distance on the system is a tool to move things back in space and sound farther away.\n\nAnd in parallel with distance, sometimes you need to turn down the volume of an asset to achieve the right balance.\n\nNow let's look at the same concepts we used for Environments and apply them to an example that doesn't use a fully immersive space.\n\nAs an opening moment to the onboarding experience, we wanted to fill the space with sound but also call attention to the animation writing “hello.” Here, too, we make use of the foreground and background.\n\nHere's what it sounds like with just the foreground sound.\n\nThe animation indicates the source of the sound.\n\nIt's important to note that even if your app takes place in your physical room, you can still use an immersive soundscape to fill the space with sound.\n\nLike with the environments, we used a combination of a spatial audio source and an ambient background sound.\n\nLet's take a look at the video again with the ambience added to the mix.\n\nYou'll hear it echo in the background and fill up the space.\n\nWhether you're moving on quickly or staying in an experience longer, this layered approach keeps it interesting and interactive.\n\nIn your own app, this could work well for a menu or title screen.\n\nLet's recap.\n\nWe looked at how Spatial Audio enables us to attach sounds to the UI we see around us in the system, how sound can play a big role in making the UI feel responsive and confirm users' interactions, and how we can design an immersive spatial experience that's lively and captivating.\n\nI hope this helped inspire you to use sound to enrich the experience of your app, making it more engaging and fun to use.\n\nThanks for listening.\n\n♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10271/4/8EC963D4-5325-4F6F-8D6C-7C3DF535B0A2/downloads/wwdc2023-10271_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10271/4/8EC963D4-5325-4F6F-8D6C-7C3DF535B0A2/downloads/wwdc2023-10271_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10073",
      "year": "2023",
      "title": "Design for spatial input",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10073"
    },
    {
      "id": "10076",
      "year": "2023",
      "title": "Design for spatial user interfaces",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10076"
    },
    {
      "id": "10075",
      "year": "2023",
      "title": "Design spatial SharePlay experiences",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10075"
    },
    {
      "id": "10072",
      "year": "2023",
      "title": "Principles of spatial design",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10072"
    },
    {
      "id": "803",
      "year": "2017",
      "title": "Designing Sound",
      "url": "https://developer.apple.com/videos/play/wwdc2017/803"
    }
  ],
  "extractedAt": "2025-07-18T09:22:29.035Z"
}