{
  "id": "10117",
  "year": "2023",
  "url": "https://developer.apple.com/videos/play/wwdc2023/10117/",
  "title": "What’s new in App Store Connect",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing",
    "Developer Tools"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ Mellow instrumental hip-hop ♪ ♪ Hi, and welcome to \"What's new in App Store Connect.\" I'm Laurel McAndrews from App Store Connect Engineering.\n\nToday, I'll walk through the developer lifecycle in App Store Connect, and I'll call out some enhancements we're making this year.\n\nI'll begin with some ways to think about monetizing your app, implementing in-app purchases, and how to set prices internationally.\n\nThen, I'll review how to manage testers and some of the improvements we've made to managing builds and testers.\n\nI'll cover getting ready for going live on the App Store, and ways to build excitement for your app.\n\nLast, I'll walk through ways to use the App Store Connect API to speed up your release cycle and customize workflows.\n\nFirst, let's talk about monetizing your app.\n\nAs you're working on your app, you'll consider whether to include in-app purchases and how to set prices.\n\nWhether you're a solo developer doing everything yourself, or a large company with a dedicated pricing team, there are features this year to help you run your business on the App Store.\n\nFor example, StoreKit for SwiftUI is a new capability that allows you to quickly and easily offer in-app purchases and subscriptions in your app.\n\nAfter you set up products in App Store Connect, you can go into Xcode and add a few lines of code to generate views in your app to offer in-app purchases.\n\nThese pages are fully accessible and localize your project strings into all App Store languages.\n\nYou can choose the simplest implementation of StoreKit for SwiftUI.\n\nOr you can customize elements like backgrounds, buttons, and styles to achieve a design that is seamless with your app.\n\nIf you promote your in-app purchases on the App Store, you even have the option to use the App Store promotion image in the product view in your app.\n\nThis icon will appear alongside the in-app purchase in your app.\n\nIf you offer in-app purchases or if you choose to offer a paid app, you will need to consider how to set prices and how they will translate to international markets.\n\nThis spring, we upgraded our pricing capabilities, making it easier to manage the prices of apps, in-app purchases, and subscriptions.\n\nThis update allows you to choose from 900 price points to give you flexibility on the pricing of your app; set a base region, which is the ability to choose one region to automatically generate prices across other regions and currencies; manage international pricing, which allows the App Store to adjust your prices as currencies or taxes change or manage them manually on your own; and set the availability of in-app purchases and subscriptions by region.\n\nTo begin implementing StoreKit for SwiftUI, visit \"Meet StoreKit for SwiftUI.\" To go in-depth on this year's pricing changes as well as the new pricing endpoints in the App Store Connect API, visit \"What's new in App Store pricing.\" Next up, let's talk about ways to manage testers for your app.\n\nOnce you have an idea of how to monetize your app, you'll start thinking about who your testers will be and how you'll test changes before releasing.\n\nTestFlight makes it easy to test your prerelease builds on iOS, watchOS, tvOS, macOS, and now xrOS.\n\nThis year, we're making it easier to manage testers, builds, and test different use cases in your app.\n\nWe want to help you get the right builds to the right testers and ensure you can test scenarios that users will encounter when you release on the App Store.\n\nTestFlight provides data about your testers to help you understand how engaged they are.\n\nThis data includes a status, which tells whether a tester has been invited, if they've accepted, or if they've installed a build, the number of sessions the tester has had, the number of crashes, and amount of TestFlight feedback they have provided.\n\nWe're adding an additional column for devices which will show the most recent device and OS on which the beta app was installed.\n\nWe're also adding the ability to filter by tester data in order to view and manage segments of testers.\n\nYou will be able to bulk select groups of testers in order to resend invitations, add to a group, or remove testers altogether.\n\nAnd all of this data will be available through the App Store Connect API.\n\nOnce you're able to easily manage your testers, you may want to put release controls in place to make sure you're sending the right builds to the right people.\n\nWhen distributing a build from Xcode, you may have a build like a prototype that you never want to go outside of your internal team.\n\nFor this, we're adding a TestFlight Internal Only selection to the new distribution workflow in Xcode.\n\nWhen you make this selection, it will ensure that these builds can't be released for External TestFlight and can't be submitted for App Store review.\n\nIn App Store Connect, these builds will be clearly marked so you can easily see which builds can be distributed where.\n\nIf you have a good group of testers and the right builds going to the right places, you also need to tell testers what you want them to check out in your app.\n\nXcode Cloud will make this process even easier with the ability to upload TestFlight What to Test information alongside a build.\n\nTo do this, you have a few options.\n\nYou can add a plain text file to a TestFlight folder located in the same folder as your Xcode project or workspace.\n\nThis file will itemize the things you want testers to check out.\n\nOr you pull from commit messages with a custom build script.\n\nThis information will be passed to App Store Connect and will be distributed to your testers when you're ready to start testing your build.\n\nNow that you've optimized your build and tester management in TestFlight, let's talk about some new features in sandbox testing.\n\nFamily Sharing allows your customers to share your subscriptions and in-app purchases with their Family Group.\n\nTo enable you to test this feature before you release, we are adding the ability to combine sandbox test accounts into a Family Group.\n\nJust like Family Sharing in the App Store, you can group up to six test accounts into a family.\n\nYou will be able to configure these accounts in App Store Connect.\n\nThis year, we're adding the following sandbox on-device enhancements on iOS.\n\nView Family Group members and select to stop sharing an autorenewable subscription or nonconsumable with a family.\n\nModify the renewal rate of a subscription.\n\nTest interrupted purchases, and clear purchase history right on the test device.\n\nTo expand on these testing topics, discover the new streamlined distribution in Xcode as well as new support for notarization in Xcode Cloud in the session \"Simplify distribution in Xcode and Xcode Cloud.\" Explore how to use StoreKit testing in Xcode, sandbox testing, and TestFlight in the session \"Explore testing in-app purchases.\" After you have your app tested, you'll think about how to represent your app on the App Store.\n\nLet's cover some ways to build your store presence.\n\nYour product page is where you tell customers about the features in your app.\n\nApp Store Connect helps you configure your product page, get customers excited, and acquire customers.\n\nApp Store privacy nutrition labels summarize your data practices in a simple, easy-to-read label so that customers can make an informed decision when downloading your app.\n\nWhen answering app privacy questions in App Store Connect, you need to indicate in the data collection section the types of data you collect from customers.\n\nWith the introduction of xrOS, we are adding a few new data types.\n\nYou should select Environment Scanning if you collect data on a user's surroundings, Hands if collect hand structure or movements, or Head if you collect head movement.\n\nFor example, if your app teaches users how to play piano and collects data on the movement of their hands in order to instruct them, you should select the Hands data type for data collection.\n\nThese new data types will be especially relevant for xrOS apps, but could apply on other platforms.\n\nFor example, these would apply to you if you use ARKit on iOS and collect these types of data.\n\nThese new data types will appear on the xrOS App Store and all other platforms where your app is released.\n\nAfter you've inputted your answers to privacy questions, you can start thinking of when you'll release your app and how you'll present yourself to customers.\n\nNow let's talk about pre-orders.\n\nReleasing your app for pre-order can be a powerful way to build awareness and excitement for your upcoming app release.\n\nThis year, we're giving you the flexibility to use pre-orders on a regional basis.\n\nThis means you can start by launching your app to a limited set of regions, often referred to as a soft launch, and also offer your app for pre-order in other regions.\n\nWe're making this possible with a redesigned availability page, where you can manage your app's state across regions.\n\nYou'll be able to launch your app and tune your design and functionality before using pre-order in new markets.\n\nWhether your app is available for pre-order or download, you might want to think about which metadata is right to display on your product page.\n\nFor this you can use product page optimization.\n\nProduct page optimization gives you insight into which product pages your users like best.\n\nThis year, we're making a change so that tests will continue to run until you choose to stop them, and won't be affected by new versions.\n\nYou will be able to view and monitor a currently running test while pushing updates to your app as needed.\n\nKeep in mind that a test is meant to compare treatments against your control, so any changes to a product page with a new version could impact the results of a running test.\n\nTo continue building your store presence, here are some other sessions.\n\nTo get your app ready for xrOS outside of our new data collection options, visit \"Explore App Store Connect for spatial computing.\" To go deeper on privacy, including our new features for third party SDKs, visit \"What's new in privacy.\" To better understand pre-order by region, including our redesigned availability tab, visit \"What's new in App pre-order.\" Once you have your app in the hands of customers, you can explore how to automate with the App Store Connect API.\n\nThe App Store Connect API provides options for customizing workflows, staying in sync with your internal systems, and automating processes to save time.\n\nOur API collections allow you to automate many areas of the App Store.\n\nThis year, we launched in-app purchases and subscriptions, customer reviews and responses, and the ability to manage sandbox testers.\n\nWe have some great releases coming this year, including support for Game Center.\n\nThese APIs will make it easier and faster to set up Game Center features and build consistent experiences across all platforms of your game.\n\nLet's go into detail about what these APIs entail.\n\nYou can create, configure, and even archive leaderboards and achievements just as you would in App Store Connect.\n\nArchiving is a new feature to remove leaderboards and achievements from your game.\n\nSubmit scores and achievement unlock events via a server-to-server API.\n\nThis is great if you are a cross-platform game that manages data across many platforms.\n\nRemove scores and players from your leaderboards to automate management of fraudulent activity.\n\nLast, match players using custom rules like skill level or region, an upgrade to our matchmaking capabilities.\n\nIn addition to bringing Game Center to the API, we also have some updates to API authentication.\n\nThis year, you can generate marketing and customer service API keys if you'd like to limit keys to manage your marketing metadata or respond to App Store reviews.\n\nYou can also create a user-based key, which is an API key that has the same permissions as you do, regardless of what role you have.\n\nYou'll be able to do this from your user profile in App Store Connect.\n\nWe covered a lot in this session, and these new features are just a subset of the developer tools for the App Store.\n\nWhether you're building an app for the first time, you're an experienced developer, you're building by yourself, or you're part of a team, App Store Connect can help you put the best version of your app on the App Store.\n\nTo wrap up, I encourage you to try out some of these new capabilities and tell us what you think.\n\nIf you run into issues, you can contact us through the Apple developer website for unlimited support via phone and email.\n\nWe provide support in nine languages, 24 hours a day.\n\nI encourage you to submit feedback with the Feedback Assistant.\n\nWhether it's for App Store Connect, TestFlight, or the App Store Connect API, our team reviews every piece of feedback that comes in.\n\nThanks for watching.\n\nI'm excited to see what you build next.\n\n♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10117/5/371EF10F-F98C-4AC5-B998-FD7FD3267F98/downloads/wwdc2023-10117_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10117/5/371EF10F-F98C-4AC5-B998-FD7FD3267F98/downloads/wwdc2023-10117_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10012",
      "year": "2023",
      "title": "Explore App Store Connect for spatial computing",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10012"
    },
    {
      "id": "10142",
      "year": "2023",
      "title": "Explore testing in-app purchases",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10142"
    },
    {
      "id": "10082",
      "year": "2023",
      "title": "Meet ARKit for spatial computing",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10082"
    },
    {
      "id": "10013",
      "year": "2023",
      "title": "Meet StoreKit for SwiftUI",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10013"
    },
    {
      "id": "10224",
      "year": "2023",
      "title": "Simplify distribution in Xcode and Xcode Cloud",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10224"
    },
    {
      "id": "10015",
      "year": "2023",
      "title": "What’s new in App Store pre-orders",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10015"
    },
    {
      "id": "10014",
      "year": "2023",
      "title": "What’s new in App Store pricing",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10014"
    },
    {
      "id": "10053",
      "year": "2023",
      "title": "What’s new in privacy",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10053"
    },
    {
      "id": "10140",
      "year": "2023",
      "title": "What’s new in StoreKit 2 and StoreKit Testing in Xcode",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10140"
    }
  ],
  "extractedAt": "2025-07-18T09:19:09.260Z"
}