{
  "id": "10012",
  "year": "2023",
  "url": "https://developer.apple.com/videos/play/wwdc2023/10012/",
  "title": "Explore App Store Connect for spatial computing",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ Mellow instrumental hip-hop ♪ ♪ Justin Thomas: Hi, everyone! My name is Justin Thomas.\n\nI'm an engineer on the App Store Connect team.\n\nMaciej Kujalowicz: And I am Maciej Kujalowicz, an engineer on the TestFlight team.\n\nJustin: Together, we will show you how xrOS opens the door for you to create amazing spatial experiences.\n\nAnd with a new App Store on xrOS, users can discover and download your incredible apps.\n\nIn this session, I'll start by walking through all the different ways you can make your apps available on xrOS.\n\nThen, Maciej will show you everything you need to know about beta testing on xrOS.\n\nFinally, I'll help you make sure that your app is ready to be published on the App Store.\n\nAll right, so let's dive in with setting up your app.\n\nIn App Store Connect, you have three options to choose from when setting up your app.\n\nYou can create a new app with the xrOS platform.\n\nThis is the option to select if you're introducing a new app to the App Store for the first time, or if you want to configure your xrOS app to have a different price or availability than your other apps.\n\nYou can also add the xrOS platform to an existing app to create a universal purchase.\n\nThis allows your users to enjoy your app and in-app purchases across all platforms.\n\nYour app will have the same name and URL across all platforms, making it easier for users to find it.\n\nYour app will automatically install for users across their devices when they have automatic downloads enabled.\n\nAnd finally, you can choose to make your compatible iPad and iPhone apps available on xrOS without making any code changes or submitting a new build.\n\nThis is a great option if you're still working on your xrOS app, but you want users on xrOS devices to enjoy your app as soon as possible.\n\nOK, let's look at each of these options in App Store Connect, starting with creating a new app.\n\nLet's say I'm a developer on the Nature Lab team, and I'm excited to create a fully immersive app for my customers.\n\nI'm planning to introduce Backyard Birds to the App Store.\n\nSince Backyard Birds is a new app, I'll first need to create a new app record.\n\nI can do this by clicking the plus (+) button in the upper-left area of the Apps page, and then selecting New App from the drop-down menu.\n\nFrom the New App dialog, I'll select xrOS under Platforms, and then fill in the remaining fields like Name, Bundle ID, and SKU.\n\nThat's it! I'll just need to click Create to complete the new app record for Backyard Birds, then I can begin uploading builds.\n\nNext, let's look at adding xrOS to an existing app.\n\nI'm back on the Apps page for my Nature Lab team.\n\nMy customers love tracking their favorite mountain climbing routes with Mountain Climber on iOS, so I decided to introduce a new experience on xrOS.\n\nTo add the xrOS platform, I'll select my Mountain Climber app.\n\nAnd from here, I'll click Add Platform from the left sidebar.\n\nOn the Add Platform dialog, I'll just need to select xrOS, then click Add.\n\nOnce the platform is added, I can then begin uploading builds for Mountain Climber.\n\nAnd finally, all compatible iPad and iPhone apps are automatically made available on the App Store on xrOS.\n\nIf there's any reason why you think your app doesn't make sense on the platform, you can manage its availability on xrOS.\n\nLet's take a look.\n\nOn the Apps page, click the ellipsis (…) button in the upper-left area, then select \"iOS Apps on xrOS Availability\" from the drop-down menu.\n\nFrom here, you have full control over managing which apps are made available on xrOS.\n\nIf your compatible iPad and iPhone app is made available by using this option and you later add the xrOS platform, releasing it will replace the iOS app version on the App Store.\n\nFor the Nature Lab team, I wanted to make sure that all of our compatible apps are made available, so I'll keep the default settings here.\n\nYou can also manage an individual app's availability from the Pricing and Availability page.\n\nUnder the iPhone and iPad Apps on xrOS section, you have the option to “Make this app available”.\n\nYou can also verify if your current and upcoming app versions are compatible with xrOS.\n\nTo learn more about compatible iPad and iPhone apps and how to make sure your apps run properly, check out the sessions \"Run your iPad and iPhone apps in the Shared Space\" and \"Enhance your iPad and iPhone apps for the Shared Space\".\n\nSo we just covered all the ways for setting up an xrOS app in App Store Connect.\n\nNext, you'll want to test your xrOS and compatible iPad and iPhone apps to ensure a solid user experience.\n\nAnd with that, I'll pass it over to Maciej to talk to you about TestFlight.\n\nMaciej: Thank you, Justin! TestFlight is an essential tool to help you distribute and install beta versions of your apps.\n\nYou can create your teams of testers, define distribution rules, and incorporate feedback to create best-in-class applications for the App Store.\n\nTo manage your beta testing, go to the App Store Connect website.\n\nCheck the TestFlight tab, where you can create groups, add testers, and distribute builds.\n\nYou can also manage testers and groups using App Store Connect on iOS or the App Store Connect API.\n\nTo get a general overview about how to run your beta program, check out our Tech Talk on how to get started with TestFlight.\n\nFor more information on how to automate distributing builds in continuous integration services, watch our previous session \"Explore Xcode Cloud workflows.\" TestFlight is available for all existing operating systems and provides a consistent experience for installing beta apps.\n\nAdditionally, testers can send screenshots and crash feedback on iOS and macOS.\n\nAnd today we are introducing support for xrOS.\n\nTestFlight on xrOS will help you test your immersive apps to make sure they offer the best possible experience on the device and are ready for the App Store.\n\nIt also lets you install and run iPad and iPhone apps to verify they are fully compatible and work great on xrOS.\n\nIn this section, I will walk you through the major use cases of TestFlight to help you distribute builds, install apps, and collect feedback.\n\nLet's start with distributing builds.\n\nCreating groups and inviting testers is a feature available for all platforms.\n\nIt's no different for xrOS.\n\nYou have an option to use internal or external groups and invite testers by email or public link.\n\nIn this example, the xrOS platform has been added to an existing app record.\n\nYou can create a new group of testers and start uploading builds there.\n\nYou can also distribute xrOS builds through any existing group.\n\nIn this scenario, testers will have access to builds for multiple platforms.\n\nTestFlight gives you full control over which group can install iOS apps on xrOS.\n\nEach group has an option to enable or disable the ability to install iPhone and iPad apps by testers from this group on the headset.\n\nThis option can help you expand the team of testers while you progress with testing the compatibility of your iOS apps.\n\nNow that you know how to distribute your builds, let me walk you through the process of installing and running beta apps on xrOS as a tester.\n\nAfter launching TestFlight, I can browse all the apps developers invited me to test.\n\nMy list in the sidebar includes both xrOS and iOS apps that can be installed and tested on my device.\n\nApplications not compatible to install are listed in a separate category of iOS-only apps.\n\nWhen a developer invites me to test both the xrOS and iOS version, TestFlight allows me to switch between each type of the app.\n\nToggle at the top of the app page allows me to choose which version I would like to install and test.\n\nFrom this page, I can check the details of each app, review the description, confirm whether the app is compatible with my device.\n\nAdditionally, I can scroll down the list to App Settings and customize notifications or opt in for automatic updates, in which case all new versions of the app are downloaded and installed automatically by TestFlight on my device.\n\nOnce the beta app is installed, I can launch it directly from TestFlight or from the Home Screen.\n\nAll beta apps are distinguished by a yellow dot displayed next to the app name, like on other platforms.\n\nCompatible iPad and iPhone apps are grouped together in a dedicated folder, where the yellow dot is also presented for beta versions.\n\nWhen I launch the updated app, TestFlight displays information provided by the developer to describe changes in the latest build.\n\nThis is a good opportunity for the developer to recommend which areas I should focus on while testing the app.\n\nNow, let's talk about how you can get feedback from testers about their experience with your apps on xrOS.\n\nTesters can send feedback when they notice issues within your app or if they want to suggest some improvements.\n\nAs a tester, If I want to share feedback with the developer about my experience on xrOS, I can quickly press the Digital Crown and top buttons together to capture screenshots.\n\nNext, I open TestFlight, select the app, and touch the Send Feedback button to initiate the process.\n\nI start with describing the problem.\n\nI attach all the screenshots I have captured to support the feedback.\n\nI can crop or annotate images to focus the feedback on the relevant part of the screenshot or to hide any sensitive information.\n\nAnother situation where I can provide feedback is when the beta app crashes.\n\nIn this case, TestFlight asks me if I want to send more information to help debug the issue.\n\nI can describe what steps caused the crash, and the information will be submitted along with the crash log captured on the device.\n\nSo far, I have presented how testers can leverage TestFlight on xrOS to install, run beta apps, and share feedback.\n\nNow let's take a look how App Store Connect and Xcode can help you analyze the data and track tester engagement.\n\nYou can review all submitted feedback in App Store Connect and Xcode Organizer, with filters to view by platform or a build.\n\nYou can check the details of each feedback, review screenshots, download crash logs, or open the feedback directly in Xcode Organizer.\n\nApp Store Connect web and mobile also provide information about how many testers installed and launched a specific version of your app, or how many of them submitted crash or screenshot feedback.\n\nThis is an excellent tool to track tester engagement.\n\nYou can analyze the statistics for a specific build or look over a specific group to see the engagement of each tester.\n\nSo that's a quick look at how TestFlight can help you build high-quality apps and offer a great user experience on the xrOS device.\n\nNow I will hand back to Justin to tell you more about getting your apps ready for the App Store.\n\nJustin: Thanks, Maciej.\n\nWith beta testing wrapped up, let's jump back to App Store Connect and put the finishing touches on your app.\n\nYou're able to manage your xrOS apps using the features you've come to expect from App Store Connect, from in-app purchases, to screenshots, to app analytics.\n\nLet's take a closer look at a feature we've updated for spatial computing, Privacy Nutrition Labels.\n\nWith the release of xrOS, we added a few new data types that your app may collect.\n\nThese new data types are relevant for xrOS apps, but they can also be applied to other platforms.\n\nIn the App Privacy section, check “Environment Scanning” if your app collects data about the user's surroundings, such as mesh, planes, scene classification, or image detection of the user's surrounding.\n\nUnder the “Body” section, check “Hands” if your app collects data about the user's hand structure and hand movements, and “Head” if your app collects data about the user's head movement.\n\nOnce your app is published on the App Store, customers can learn from your app's product page about the data types that your app collects and how they are used.\n\nWe covered a lot today, from setting up, to beta testing, to updating your app's privacy details.\n\nBefore I let you go, let me give you a quick wrap-up for what you'll need to do next.\n\nFirst, decide how you want to get your app on xrOS.\n\nAre you going to create a new app, add the xrOS platform to an existing app, or choose to make your compatible iPad and iPhone apps available on xrOS? Beta test your xrOS and compatible iPad and iPhone apps with TestFlight.\n\nBe sure and look for submitted feedback and crashes from your beta testers.\n\nNext, update your app's privacy details so your customers are well informed of the types of data that your app collects.\n\nAnd finally, check out the \"What's new in App Store Connect\" session to learn more about updates across App Store Connect.\n\nAlso, see \"Get started with building apps for spatial computing\" for development tips.\n\nAnd, as always, we look forward to hearing your feedback.\n\nMaciej: Thanks for watching! ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10012/4/0E0416F8-A360-4F27-8CBA-B49CA1AEB96B/downloads/wwdc2023-10012_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10012/4/0E0416F8-A360-4F27-8CBA-B49CA1AEB96B/downloads/wwdc2023-10012_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10094",
      "year": "2023",
      "title": "Enhance your iPad and iPhone apps for the Shared Space",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10094"
    },
    {
      "id": "10090",
      "year": "2023",
      "title": "Run your iPad and iPhone apps in the Shared Space",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10090"
    },
    {
      "id": "10117",
      "year": "2023",
      "title": "What’s new in App Store Connect",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10117"
    },
    {
      "id": "10268",
      "year": "2021",
      "title": "Explore Xcode Cloud workflows",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10268"
    }
  ],
  "extractedAt": "2025-07-18T09:19:06.322Z"
}