{
  "id": "10015",
  "year": "2023",
  "url": "https://developer.apple.com/videos/play/wwdc2023/10015/",
  "title": "What’s new in App Store pre-orders",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ Will: Hi, welcome to \"What's New in App Pre-orders?\" My name's Will Lo, and I'm a software engineer on the App Store Connect team. Offering your app for pre-order can be a powerful way to generate excitement for your upcoming app release. When you make your app available for pre-order, its product page becomes published on the App Store, where your app can be purchased before it's released for download. On release day, your customers will be notified and your app will be automatically downloaded on their devices.\n\nIn this session, I want to talk about some exciting updates that we're making in App Store Connect. This year, we're giving you the ability to offer your app for pre-order on a regional basis. These updates will give you more flexibility to choosing where and how you publish your apps for pre-order. So for an unreleased app, you'll be able to choose specific regions to publish for pre-order, just as you can today.\n\nBut with this new flexibility, you'll also be able to first release your app to a few regions, as a soft launch or limited release, and then offer your app for pre-order in any other region you choose. And as you continue expanding the reach of your app, you can use pre-order to further build excitement in each additional region.\n\nSo let's walk through a few examples using App Store Connect to set up these pre-orders.\n\nIn this first example, Backyard Birds is a brand new, unreleased app that you want to publish as a pre-order to generate some excitement around its release. Let's say that you want to release Backyard Birds on September 1, and that you've got your product page details all set up on App Store Connect. To set up your first pre-order, you can head to the Pricing and Availability page and click Set Up Availability. Then, within this dialog, select Pre-Order in Specific Countries or Regions. Here's where you would enter your expected release date, September 1. The expected release date can be up to 180 days in the future.\n\nNext, you would select the United States, where your app will be made available for pre-order. And finally, you'll see this confirmation screen, showing you the expected release date and where the app will be available for pre-order. And with that, the app is now properly set up for pre-order in the United States with an expected release date of September 1. That's when your customers will be notified, and your app will be automatically downloaded to their devices. Now, let's scroll down a bit and take a look at the Availability section, which now gives you a complete detailed view of the app's release status in each country or region. So whether the app is ready for sale, published for pre-order, or otherwise unavailable, this page will help you understand that. In this example, this app is available in multiple regions. But if your app is somehow unavailable, you'll see a status label like this one that tells you exactly what's happening in each region.\n\nSo that's how you would set up publishing a brand new app for pre-order. Now, let's re-imagine the scenario for our example app. Let's say that Backyard Birds was a limited release, published in just Canada. The initial reaction has been really great, and you would like to expand its availability to the United States, with a scheduled release date of March 1 of next year. Let's walk through how we can set that up as a pre-order.\n\nFirst, from within the Pricing and Availability page, you can hit Manage under the App Availability section. Here, we can see that it's currently available in Canada. So to publish your pre-order in the United States, you can first hit Set Up Pre-order. Then, you'll enter your expected release date, March 1st, 2024. For an app that's already published on the App Store, the expected release date can be up to 365 days in the future.\n\nNext, select the United States to publish your pre-order in. Finally, you'll see this confirmation screen, showing you a summary of your changes. These changes will appear on the App Store within 24 hours. Here, you can see your app's updated pre-order availability. The Published column shows you that your pre-order has been published in the United States today, while the Scheduled Release Date column shows you that the app is currently scheduled to be released on March 1. Now, from within the App Availability page, you can update the pre-orders that you've already set up as well.\n\nWe'll walk through a final example and update the pre-order that was published. If you hit Edit, you'll first be presented with a dialog that lets you update three different settings. First, you can update your app's release date. Since this example app was already released in Canada, you can choose any date in the future, up to 365 days from when your US pre-order was originally published.\n\nNext, you can also release your pre-order immediately. Your customers will be notified and your app will be downloaded to their devices. Remember, once you release your app, it can't be made available for pre-order again in the regions that you've published in. Finally, you can choose to remove your pre-order from the App Store in that region. After publishing your app for pre-order on the App Store, you may be interested in marketing your pre-order app or in tracking the performance of your pre-orders. To market your pre-order app, you can use these localized badges on your website or in your marketing materials to directly link people to your product page. Pre-order apps are discoverable through search as well, and may be featured on the Today, Games, or Apps tabs on the App Store. The performance of your pre-orders can be tracked from within App Analytics, where you can find the number of purchased pre-orders by date and by region. And, with these new updates, you'll be able to run custom product pages and product page optimization tests for any pre-order app. The performance of your custom product pages and optimization tests can also be tracked from within App Analytics. So to wrap up, these updates will give you more flexibility overall in choosing where and how you publish your apps for pre-order. You can use App Store Connect to set up and manage these pre-orders. And finally, the functionality that I covered will be supported by the App Store Connect API as well. If you're interested in learning more, please be sure to check out \"What's new in App Store Connect\", from WWDC23, or the tech talk \"Get started with app discovery and marketing\". And as always, we welcome any feedback that you may provide on Feedback Assistant. Thanks for watching, and enjoy the rest of WWDC! ♪ ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10015/4/1BACDF1D-18D0-4971-AED9-7DBB31B3926A/downloads/wwdc2023-10015_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10015/4/1BACDF1D-18D0-4971-AED9-7DBB31B3926A/downloads/wwdc2023-10015_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10117",
      "year": "2023",
      "title": "What’s new in App Store Connect",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10117"
    }
  ],
  "extractedAt": "2025-07-18T09:19:11.903Z"
}