{
  "id": "10193",
  "year": "2023",
  "url": "https://developer.apple.com/videos/play/wwdc2023/10193/",
  "title": "Design Shortcuts for Spotlight",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ Cameron: My name is Cameron, and I’m a designer here at Apple on the Human Interface team.\n\nToday, I’m excited to tell you about how you can design Shortcuts for Spotlight in iOS 17. Built into iOS, Spotlight is a search utility that makes it easy start any search.\n\nAnd now, when people search for apps, their shortcuts appear next to them in the top hit. In iOS 17, we’ve created new shortcuts for many of our apps, and today, I’ll explain how you can design shortcuts for your apps.\n\nBut first, let’s take a look at what’s new.\n\nWhen someone launches Spotlight, if your app is suggested, your app shortcut can be suggested too.\n\nAnd when someone searches directly for an app shortcut, it will come to life in a colorful top hit. And on iPad, the wide screen shows up to five of your app’s shortcuts in the top hit. But it doesn’t stop at Search.\n\nYour app shortcuts also appear in the Shortcuts app where people can explore, remix and add shortcuts directly to their Home Screens.\n\nNow that you’ve seen some of what’s new for App Shortcuts in iOS 17.\n\nLet’s talk about how to make a great shortcut for Spotlight.\n\nWe’ll start with how to come with a good idea for a shortcut, then discuss how to create your shortcut’s visual appearance and behavior before finishing off with some quick tips about to make your shortcuts discoverable in search.\n\nNow let’s start with ideation. When designing shortcuts for Spotlight, it’s best to focus on the essential, habitual actions and content from your app.\n\nFor Clock we have two App Shortcuts, one to Set Timers and another to Add Alarms.\n\nWe could’ve included an \"Add City\" to World Clock shortcut, but we didn’t because that functionality is less habitual and more complicated.\n\nDon’t feel compelled to fill up all the spaces.\n\nIt’s fine to have just one or two shortcuts. Next, when appropriate, prefer shortcuts that take action directly. Your first idea might be to look at your app’s tab bar and reflect it directly into shortcuts, but challenge yourself to think of something better.\n\nPeople already know how to use your app’s primary navigation, and this might not be the best you can do.\n\nInstead, make shortcuts that can accomplish your app’s primary purpose.\n\nFor Phone, that’s placing calls to favorites or recents.\n\nFinally, you should design shortcuts that will be predictable and personal.\n\nFor Podcasts, we offer shortcuts to shows people are currently listening to and those that have new episodes...\n\nbut we wouldn’t promote trending podcasts someone hasn’t heard before.\n\nApp Shortcuts should be instantly recognizable and browsing new content is best done inside your app.\n\nAnother part of being predictable is personalizing your app shortcuts using the decisions people make inside your app.\n\nLet’s look at Notes as an example.\n\nIn Notes, the compose button is persistently in the bottom right toolbar, so in the App Top Hit, the new note button is predictably to the right of the app icon too.\n\nThe notes themselves are reverse-chronologically organized in the app, so the shortcuts in the app top hit are too.\n\nThe exception is pinned notes, which are always shown first in the app.\n\nBecause this is an intentional action that someone took, you should reflect it into the ordering of your app shortcuts too. You should order your shortcuts to reflect the decisions people make inside your app, and to help people build muscle memory around things being in predictable places.\n\nTo recap, when coming up with ideas, focus on essentials.\n\nElevate a handful of habitual actions.\n\nNot everything, and nothing too complicated.\n\nPrefer actionable shortcuts.\n\nGo beyond your tab bar and focus on making shortcuts that reflect the primary purpose of your app.\n\nAnd finally, be predicable.\n\nMake shortcuts for things people have previously interacted with inside your app, not stuff they haven’t seen yet.\n\nAnd design for people to build muscle memory.\n\nNow that you have some ideas for App Shortcuts, let’s dive into creating them.\n\nThe first thing you need to understand is that every App Shortcut is made of either an action or an entity.\n\nYou can think of them as a verb or a noun.\n\nOr more concretely, an action to make a New Board in Freeform or entity for My Big Idea board. In the UI, actions are always shown as SF symbols inside circles like this.\n\nAnd by default, all entities are drawn using an SF symbol too.\n\nBut it usually makes sense to provide an icon for your entity, so it’s more visual and recognizable.\n\nIf needed, your action title can wrap to a second line.\n\nBut be especially conscious of keeping your titles concise to avoid truncation and never include your app name because it’s already shown in the UI.\n\nStrive to make your titles as short as possible while still being easily understood.\n\nBecause App Shortcuts icons are small, it’s important to make them as recognizable as possible. When drawing icons for entities, pay attention to ensuring the shape of shortcuts match the corresponding shapes of those concepts in your app.\n\nBecause reminders lists are circles in the app, so are their app shortcuts.\n\nAnd because Photos albums are always square in the app, so are their app shortcuts.\n\nAnd think beyond the shape.\n\nBecause the favorites cover integrates a small heart in the corner, we carry that element over into the shortcut icon too.\n\nDetails like this serve as visual queues to maximize the familiarity of your app shortcuts.\n\nWhen people search directly for shortcuts, you have the opportunity to show even more information in a subtitle.\n\nYou can use this opportunity to design an even richer result.\n\nPhotos includes the number of favorited photos, inside the album, just like in the app.\n\nNow, let’s dive into color! By default, your app shortcuts will appear like this.\n\nThis is often the right appearance if your app icon is multicolor or neutral.\n\nHowever, if your app icon has a strong gradient or color, like Notes’ yellow, you can infuse color into your top hits in Spotlight and platters in the Shortcuts app. When deciding on your complementing color, do the mental exercise of peeling the graphics off your app icon to create a gradient, or solid color.\n\nBy default, your symbols will have a monochrome appearance, but for app that have dark complementing colors, this may no longer feel like your brand. To address this, you can provide a secondary tint color to create a two-tone appearance.\n\nNext, let's talk about the behavior of your shortcut.\n\nHere, you have three options. App Launch: open your app to a specific screen.\n\nLive Activity: start a live activity or background audio session. Or, a Snippet, which can ask a question or show a small piece of information in a compact form.\n\nThe simplest is for your App Shortcut to launch your app to the appropriate screen.\n\nThis is easy to do and often the right choice.\n\nNext, you can start a Live Activity. This is a great option for simple actions that don’t require further in-app attention, like placing a call or starting a timer.\n\nFor guidance on designing Live Activities, see Mac and Chan’s session \"Design dynamic Live Activities.\" Finally, you can choose to show a snippet to ask a simple question or show a custom response.\n\nBut, for more complex tasks, it’s often better to open your app. After showing a snippet, you can optionally start a Live Activity or open your app too.\n\nFor detailed guidance on designing with snippets, see these talks from previous years.\n\nTo recap, when creating your app shortcuts, design icons for them that are visually representative of what’s inside your app. Write clear, short titles that are pithy without being obscure.\n\nConsider including entities subtitles to enrich your top hits. And where appropriate, consider infusing your app’s colors.\n\nAnd, design the right behavior for your app's shortcuts.\n\nLast but not least, let’s review some of the key things you can do to make your App Shortcuts discoverable in Spotlight. In Spotlight, people may search for your shortcuts in different ways.\n\nFor example, someone might search “File Scanner” while looking for “Scan Document\" shortcut.\n\nYou can support this by adding synonyms of your shortcut phrase. Your phrase is a natural language description of your app shortcut that includes your app name and it’s also what people can say to Siri to run your App Shortcut.\n\nYou should provide a handful of synonyms for your App Shortcut phrase to make sure people can find your shortcut no matter how they search for it.\n\nIf your app is known by multiple names, you should consider providing App Name synonyms.\n\nFor example, the Music Recognition app built into iOS provides the synonym \"Shazam.\" This helps people find your app shortcut, even if they search for it by one of its other monikers.\n\nTo recap, make your shortcuts discoverable in Spotlight by writing phrase synonyms that cover the different ways people might search for your functionality and, if appropriate, by providing app name synonyms.\n\nNow we’ve reviewed how to ideate and Create App Shortcuts and make them discoverable in Spotlight. Thanks for watching We can’t wait to see what App Shortcuts you make with iOS 17. ♪ ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "App Shortcuts",
        "url": "https://developer.apple.com/documentation/AppIntents/app-shortcuts"
      },
      {
        "title": "Apple Design Resources",
        "url": "https://developer.apple.com/design/resources/"
      },
      {
        "title": "Human Interface Guidelines: App Shortcuts",
        "url": "https://developer.apple.com/design/human-interface-guidelines/app-shortcuts"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10193/4/A4E5EF33-9EA3-4609-AB6E-A3E7DF0923FA/downloads/wwdc2023-10193_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2023/10193/4/A4E5EF33-9EA3-4609-AB6E-A3E7DF0923FA/downloads/wwdc2023-10193_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10194",
      "year": "2023",
      "title": "Design dynamic Live Activities",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10194"
    },
    {
      "id": "10103",
      "year": "2023",
      "title": "Explore enhancements to App Intents",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10103"
    },
    {
      "id": "10102",
      "year": "2023",
      "title": "Spotlight your app with App Shortcuts",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10102"
    },
    {
      "id": "10169",
      "year": "2022",
      "title": "Design App Shortcuts",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10169"
    },
    {
      "id": "10283",
      "year": "2021",
      "title": "Design great actions for Shortcuts, Siri, and Suggestions",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10283"
    },
    {
      "id": "806",
      "year": "2019",
      "title": "Designing Great Shortcuts",
      "url": "https://developer.apple.com/videos/play/wwdc2019/806"
    }
  ],
  "extractedAt": "2025-07-18T09:36:29.925Z"
}