{
  "id": "10063",
  "year": "2024",
  "url": "https://developer.apple.com/videos/play/wwdc2024/10063/",
  "title": "What’s new in App Store Connect",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi and welcome to What’s new in App Store Connect. I’m Victor from TestFlight Engineering. And I’m Daymon from App Store Editorial Engineering. In this session, we’re going to cover new features in TestFlight and App Store Connect to help get your app discovered and grow on the App Store.\n\nThis session is going to be jam packed with new features in three distinct categories, here’s a high level overview: First, I’m going to show you new ways to help your App get discovered on the App Store. Then, I will share enhancements we’re making in TestFlight in how you test your App. And finally, I’ll go over new features that will enhance how you reach customers.\n\nLet’s start with ways to get your app discovered. Every day our Editorial team creates new stories and collections that appear throughout the App Store, showcasing your exceptional apps and games. The first new feature in App Store Connect is a way to connect you with these opportunities We call these Featuring Nominations, and they let you submit plans for your app’s upcoming content and enhancements to our Editorial team for their consideration for featuring on the App Store. Here’s a quick overview: Featuring Nominations allow you to share upcoming plans for your App. They’re created and managed within App Store Connect with the important details about the feature or content you’re introducing. And finally, Featuring Nominations are reviewed by the Editorial team and each submission is considered for featuring on the App Store. Featuring Nominations are related to releases and updates you are making for your app. Let’s suppose that you’re making an update to your app AwayFinder.\n\nAwayFinder is a travel app that is used to find hotels, flights, and car rentals. In this update, you're adding new content that you would like to be considered for featuring on the App Store, the ability to book flights around the world. You can let the Editorial team know of this feature by submitting a Featuring Nomination.\n\nCreating a featuring nomination in App Store Connect is easy.\n\nYou begin by clicking the Nominations Link in the left hand nav on the page.\n\nYou will then see the Nominations dashboard. Here is where you will see and manage all of your nominations as well as create a new ones. Let’s create a featuring nomination.\n\nWhen you click the Get Started button, you will have the option to create nominations in bulk by uploading a spreadsheet, or you can create them one at a time. Since there is one new feature to share, you can create just one nomination by clicking the Create Nomination button. When creating the Nomination, you will assign it a memorable name. This should help you recognize the feature, and give the Editorial team a high level description.\n\nYou would name this update “GlobeHop - Explore the world, one flight at a time”.\n\nNext you’ll enter the type of change that you’re making. You can tell the Editorial team about New Content, App Enhancements, and new App Launches.\n\nFor this type of change you would select App Enhancements.\n\nNext, you need to provide a description so that the Editorial team can understand what changes are coming. Here you would enter any relevant details for the new content and enhancements. This text explains what the new update will include, with the details of what the new feature hopes to accomplish.\n\nNext, you’ll be prompted to add an expected publish date for when the change will make it to the App Store, this can be a tentative date or a finalized release date. We recommend that the date be as firm as possible, but if your plans change you can update it any time.\n\nSince this update is planned to arrive in Fall, you would select September 15th.\n\nClicking save, you will have created a draft nomination. This page lets you review the draft and add any additional details that you think are relevant.\n\nMany of these fields are pre-populated with the data from the App you’re creating the nomination for, such as, the datapoints for platforms or localizations are added from the app. If there are other apps affected by this change, you can relate them in the related apps dropdown. You can also select the regions that this update is relevant for.\n\nFinally, I want to make a special callout. There’s more to your app than the software people interact with. There are the values you live by and the story of how you create your app. These could be related to promoting inclusivity or accessibility. For callouts such as these, we have the Helpful Details input. Our Editorial team will consider these details when reviewing your submission. Once you’re done and ready to submit this nomination for review by the Editorial team, you can click the Submit Nomination button at the top right of the page. You will be prompted to confirm creation.\n\nAnd after you confirm, you have finished creating a Featuring Nomination. The Editorial team will consider featuring nominations across any of our platforms or regions.\n\nFeaturing Nominations are a great way to tell the Editorial team about upcoming changes to your app but they’re only part of the picture. Victor, what do you have to share with us about testing enhancements? I’m glad you asked, Daymon! Let’s talk about testing your app. You have an exciting new update to your AwayFinder app that Daymon just talked about in Featuring Nominations. You’ll want to make sure you test your app, to get feedback on this update you’re planning to make. To do that you can use TestFlight.\n\nTestFlight is Apple’s tool that enables you to gather feedback from testers to help you improve your app. With TestFlight, you can incorporate beta testing into the AwayFinder development cycle, so you can get feedback on an ongoing basis.\n\nThis year, TestFlight has updated the invitation experience to help you showcase your app to testers. The new invitation will highlight key information to help a tester decide to test the app.\n\nWhen a tester opens your public link or email invitation in TestFlight, the new invitation will highlight your app name, and icon, in a rich background using your app’s primary colours, to make your app stand out.\n\nKey details include the developer name, the category of the app and the build expiration.\n\nApp screenshots will help testers quickly get a sense of your app experience.\n\nThis new invitation also highlights your beta app description, and Test details, so testers know more about what AwayFinder does, and about the GlobeHop feature you would like them to test.\n\nand if testers decide not to enroll in your beta, they can now let you know.\n\nNow, let’s look at how you setup TestFlight invitations in App Store Connect.\n\nWhen you go to the TestFlight tab in App Store Connect, you will find the Test Information section where you can provide the beta app information that appears on all invitations you send from TestFlight.\n\nBeta App Description is now a required field, since it is a key piece of information for testers in the updated invitation experience.\n\nWhen you select the option to show screenshots in Testflight, your invitation, and TestFlight beta app pages, will include screenshots.\n\nThese screenshots are from the most recent version of your app that’s approved for distribution.\n\nThis page will also show you a preview of the screenshots that will appear in TestFlight, so you can decide if you would like to include them. And if you set an app category for AwayFinder, it will be included in the invitation as well.\n\nThe updated invitation experience will help you find more beta testers. For AwayFinder, your new GlobeHop feature will only be available on iPhone and Apple Vision Pro devices. So enrolling testers with these devices would help improve the feedback you get on this feature.\n\nIn TestFlight, you can now set criteria for public links, to help you enroll the most relevant testers to give you feedback.\n\nYour criteria can help you enroll testers with specific device platforms and OS versions.\n\nCriteria can narrowly filter for a single device platform and OS version, or, it can filter for a broad combination across multiple device platforms and OS versions.\n\nYou can set criteria in any external group when you enable public links.\n\nWhen you set criteria, TestFlight will only allow testers who meet the criteria to accept the public link invitation.\n\nNow, let’s set up criteria for AwayFinder.\n\nUnder the TestFlight tab in App Store Connect, when you create an external group, you see two options; Add Builds, and Invite Testers.\n\nLet’s Invite Testers.\n\nHere, you can choose how you want to invite testers. You can invite via a public link, via email, or add existing testers to this group.\n\nA public link, which is a unique URL to your app in TestFlight, can be shared via social media, iMessage, or any other communications channel.\n\nLet’s select Public Link.\n\nNow you have the option of leaving the public link open to everyone, or setting some criteria.\n\nSince you’re looking for testers who’re running on iOS or VisionOS, let’s use a criteria.\n\nHere you’ll notice that it shows a default criteria testers who have an iPhone running any supported iOS version.\n\nTo select a range of OS versions, I chose \"From\" and picked OS versions starting from iOS 15 up-to and including iOS 18. The drop downs are populated with available OS versions for the device you selected.\n\nTo add Apple Vision Pro as another criteria, click on the Add Criteria link and select Apple Vision Pro.\n\nI selected the default All Supported visionOS option.\n\nNow you have a broader criteria You’re filtering for testers who have an iPhone running iOS 15, 16, 17 or 18, or testers who have an Apple Vision Pro running any supported visionOS version. Criteria, while powerful, can reduce the number of testers you find.\n\nIt’s best practice to start with the broadest criteria possible for your use case, and adjust based on the enrollment you see.\n\nWhen you’re done with setting tester criteria, the groups page will show you the public link URL as well as the tester criteria.\n\nWhen beta testers click on your public link, and they don’t have a device that is eligible for the criteria you’ve set, TestFlight will let them know and if they are eligible, TestFlight will simply allow testers to accept the invitation.\n\nTesters are now enrolling and you’re curious how the public link is trending. App Store Connect shows you insights on how your public link is doing, so you can make changes to how you enroll testers by modifying criteria, changing where you share the public link, or, by changing key information.\n\nFor every enrollment metric, a percentage change over the last 30 day period is also displayed.\n\nMetrics include how many unique testers looked at AwayFinder in TestFlight. How many accepted the invitation, how many declined the invitation to test, and, how many were not eligible for the criteria.\n\nSo, that was an overview of enhancements to the TestFlight invitation experience, criteria that’ll help you find relevant testers for your GlobeHop update, and, insights you get on enrollment that’s happening through your public links.\n\nDaymon, can you tell us about other new features in App Store Connect? I’m glad you asked Victor.\n\nLet’s talk about reaching customers for your app.\n\nThe next feature will allow you to create a more seamless experience when you reach customers through the App Store. We’re doing this by adding deep links to custom product pages. As a recap, your product page is a great place to call out what makes your app unique. However, you might want to highlight different features tailored for specific audiences. Custom product pages allow you to do this by creating variants of your default product page. Your default product page remains for people who navigate to your app through the App Store search. But you can create variants to highlight different things, for example, a variant that shows your flight search features, or if you want to highlight special deals like vacation packages in Bali. You could create another variant that uses screenshots to show these deals. Custom product pages have been great for growing apps on the App Store, and now they’re getting even better with deep links. Deep Links allow you to customize where someone lands when they open your app from a custom product page. Let’s say you created a custom product page for the AwayFinder GlobeHop feature we mentioned earlier. Now, this custom product page can link directly to the landing page for that feature. Greatly enhancing the flow of any marketing you’re doing for your App. Here’s a summary: Deep Links for Custom Product Pages improve the experience in flow from what someone sees on the App Store to when they open your App.\n\nDeep Links can be any Custom URL or Universal Link that is recognized by your App’s code. These Deep Links are assigned in App Store Connect when creating your Custom Product Pages.\n\nFinally, they work great as an enhancement to your ads on the App Store, allowing you to provide a seamless experience from the ad interaction to the place someone lands in your app.\n\nAdding a Deep Link to your Custom Product Page happens in App Store Connect. Here is one for the app AwayFinder created for marketing AwayFinder’s new GlobeHop feature. Most of this page remains unchanged, here is where you will still add promotional text and alternate screenshots.\n\nBut now you’ll find a new input field for your Deep Link. This can be Universal Link to your app or a Custom URL. Where these deep links lead depends on the custom logic you add into your app via delegates. Once you’ve finished editing you can submit your Custom Product Page for review.\n\nAfter its been been approved, you can use it for marketing your app, whether through social channels or in a Marketing Campaign. A great place to use Deep Links for Custom Product Pages is in your ads created with Apple Search Ads.\n\nApple Search Ads offers a variety of ad placement options to help you promote your app throughout the App Store, including on the Today tab, or at the top of search results. You can also use it to create ads that use Custom Product Pages with Deep Links, in order to improve your ad experience.\n\nThey will automatically appear in your Apple Search Ads account when you create your ad. Simply select the Custom Product Page with the deep link you want to use for your Search Results or Today tab ad. And you’ll see the ad preview on the right, with the deep link for reference just below.\n\nOnce the ad goes live, anyone that taps on the ad will be directed to your app using your Deep Link.\n\nThat’s Deep Links for Custom Product Pages, a way for you to market your app with continuity from the link someone clicks, to the experience they see in your App. Now I’d like to talk about a new marketing feature that we’re introducing to the App Store Connect app on iOS and iPadOS. We know that social media can be a powerful way to bring people to your app. Now we’re making it easier to take advantage of these marketing channels with the new Promote Your App feature Here’s an overview: The Promote Your App feature lets you generate a great-looking marketing asset for your app’s biggest moments like when it first launches on the App Store, or when you’ve released a new version and then you can easily share it on social media, right from your iPhone or iPad. And if your app gets featured on the App Store, we’ll send you a notification to let you know, and let you generate a special marketing asset to celebrate that moment.\n\nNow, let me walk you through how it works. In the App Store Connect app, you’ll find this new Promote Your App section. Here you’ll see a list of available moments. Let’s say you’re excited to promote the latest version of your app which includes the new GlobeHop feature, that just launched this week.\n\nStart by tapping on the card to view a variety of different asset styles. Each style features your app’s name and icon, with varying headlines and animations that accentuate your icon. When you’ve found the one you would like to share, tap the link icon to copy the link to your app’s product page on the App Store. Then, tap the share button to bring up the share sheet. Pick a social media app, and tap to share. In the social media app, you can compose your post telling the world about the new GlobeHop feature, paste the link to send people to your app’s product page, and publish. It’s that easy. Now, let’s say the Editorial team picked up on your nomination for your GlobeHop update and chose to feature AwayFinder as App of the Day You’ll now receive a push notification letting you know. You can tap on it to go directly into the App Store Connect app to generate and share a special marketing asset to celebrate this occasion. And that’s the new Promote Your App feature, a great new way to promote your app on social media with great-looking marketing assets provided for you in the App Store Connect app.\n\nWe covered new features across three categories that will help to grow and improve your app in TestFlight and on the App Store. In addition to the features we’ve just discussed, we have a few additional enhancements across the developer ecosystem, including reducing the number of required screenshots in App Store Connect on iOS and iPadOS. App Store Connect will now require just one set of screenshots for iPhone and one set for iPad.\n\nWe’re adding API support for the Apple Developer Enterprise Program. This will give enterprise program members access to provisioning and user management APIs. And finally, you can use the App Store Connect API to download App Analytics Reports, which you can use to find opportunities for improvement. 50 new reports are now available to export, including data about App Store engagement, downloads, sales, and app usage. With this data now available through the App Store Connect API, it's now easier than ever before to get App Store data into your own database. To wrap up, I encourage you to try out some of these new capabilities and tell us what you think. You can always contact us through the Apple Developer website for support via phone or email. We provide support in nine languages, 24 hours a day.\n\nFinally, I encourage you share your questions and feedback with us on the Apple Developer forums, which have been redesigned to make it easier to find answers to questions you have about App Store Connect, TestFlight, and the App Store Connect API.\n\nThanks for watching! We're excited to see what you build next.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Forum: App Store Distribution & Marketing",
        "url": "https://developer.apple.com/forums/topics/app-store-distribution-and-marketing?cid=vf-a-0010"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/10063/4/EF7DC136-639D-44B2-A7E2-6C0A41CD90DB/downloads/wwdc2024-10063_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/10063/4/EF7DC136-639D-44B2-A7E2-6C0A41CD90DB/downloads/wwdc2024-10063_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:18:59.864Z"
}