{
  "id": "10140",
  "year": "2024",
  "url": "https://developer.apple.com/videos/play/wwdc2024/10140/",
  "title": "Add personality to your app through UX writing",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi, I'm Alex. I'm a writer on the Human Interface design team here at Apple, and I'll be joined by my colleague, Liv.\n\nWe'll be sharing how UX writing can add personality to your app.\n\nWe're going to start by defining personality, voice, and tone.\n\nThen we'll do two exercises to help you find your app's voice.\n\nWe'll finish off with one exercise to help you use the right tone in different situations.\n\nFor the exercises, it'll be helpful to have a pad of sticky notes if you want to grab those now.\n\nJust like a person, every app has a personality.\n\nSometimes an app's personality is front and center.\n\nThink about apps that help you learn languages, like Duolingo. Because apps like this track your progress and congratulate you along the way, the personality is often fun and bright.\n\nHere you can see the use of color, the character Falstaff, the fun illustration and the writing. Notice how the word choice quest makes it sound like you're in a game. An exclamation point adds some extra punch.\n\nFrom color choices, typography and animations the personality of an app can come through in many ways.\n\nToday we'll look at some of the biggest ways your writing can add personality to your app: voice and tone.\n\nYou can think of voice as the expression of your brand and values through words.\n\nIt's the things about your writing that tend not to change. When I'm writing for Apple, there are a few words that I try to keep in mind to help me write in the correct voice.\n\nClarity, simplicity, friendliness, and helpfulness. Your voice will be different, but I see these pretty consistently throughout Apple's writing and thinking about these qualities helps me stay on point.\n\nHaving a good sense of the Apple voice helps make writing easier. And it ensures that throughout Apple's UI, the language feels distinctly Apple. Here's an example. This screen may look really simple and it is. There's a lot of information that could have been put on this screen, but the design team chose to keep it focused on what you need to know.\n\nIt opens with a friendly greeting. \"Good morning\", like a person saying hello to another.\n\nFrom there, the writing is clear. It says only what you need to know. and it's very easy to read. \"If you have an Apple Watch, you can pair it with your iPhone here.\" The text link below allows you to tell the system you'd like to learn more about Apple Watch.\n\nThen the button is very straightforward and it's consistent with the sentence's use of the word \"pair\". \"Start Pairing\" gets you to the next step.\n\nThe language could be highly technical or dry, but it's not.\n\nNow let's look at the ways a voice shifts based on context.\n\nThis is called tone. You can think of tone as the way your voice adapts to the situation.\n\nHere are a few situations someone might be in while using an Apple device.\n\nSomeone may have just done their 100th Fitness+ workout with their Apple Watch. They just did something great. It's worth congratulating. And there's a celebratory tone. \"Don't stop now!\" sounds just like a coach or a friend cheering you on after a big accomplishment.\n\nAnd even though we tend to use exclamation marks pretty sparingly around here, this screen gets one, because of the situation. The writing feels like it meets you where you are and makes the experience even better.\n\nAnother person might be finding out about something that could have negative implications about their health. The tone here is different. \"High heart rate\" is the main message. That's the headline. Then, the sentence is straightforward. \"Your heart rate rose above 120 BPM while you seemed to be inactive for 10 minutes starting at 9:59 AM.\" It gives you all the details and the data so you can make a fully informed decision about what to do next.\n\nBoth of these examples feel like they're within the Apple voice. Each one has elements of clarity, simplicity, friendliness and helpfulness.\n\nBut you can see how the clarity is turned up in the example on the left. That's really important information, so it's important to be direct. Notice how there are three different numeric values in the sentence, telling you exactly what happened.\n\nFriendliness is turned up in the example on the right. That's a fun moment, so it's okay to speak to the user like a friend or a coach. With \"Don't stop now!\" and the exclamation point. It's fun, but it's not too much. You can see how certain aspects of the voice are turned up or down depending on the situation. That's one helpful way to think about how to use tone.\n\nVoice represents the consistent elements that are always there. The tone represents things that can and should change depending on the moment.\n\nAlex just explained how every app has a personality.\n\nBut how do you turn that into a voice that you can use in your app? I'm going to walk through two exercises to help you find your app's voice and learn how to use it when you're writing for your app. In the first exercise, you'll imagine your app is a person and define its voice. And in the second, you'll learn how to write a welcome screen in your app's voice.\n\nBefore we jump into the first exercise, take a moment to think about what your app does and who it's for. You probably already know this really well, but have you articulated it? It can be helpful to write down a simple description to keep in front of you as we go through these exercises. For this first exercise, I'm going to use an example of an investment app.\n\nI'm going to imagine my investment app helps people early in their careers make long-term investments.\n\nWith your app in mind, grab your sticky notes and let's get started.\n\nImagine your app as if it were a person, who would they be and what personality traits make them unique. I'm going to write down the first things that come to mind on some sticky notes and you can do the same for your app as we go along.\n\nFor example, because my app is giving investment advice, if it were a person, they might be smart and serious. Now keep going, adding words that you think described your app as a person. Keep in mind that you can be imaginative with the descriptions you come up with, but do try to add as many adjectives as you can that you think most accurately represent your app. Once you have a bunch, step back and take a look at them. You'll start noticing some themes emerge and words that sound alike.\n\nSo as I look at these words like smart, articulate and sharp all sound very similar. So I'm going to start to group those sticky notes and you can do the same for your app.\n\nWhen I started moving them around, two main categories emerged. Words that describe this person as smart and words that describe them as motivating. Those will be the key attributes of my app's voice.\n\nBut some of those words didn't really fit into either category, like polite, quick-witted and formal. And you may notice the same thing. Those may not be what define your app's voice, but you can reference them as you're thinking about what words to use when you're writing for your app.\n\nFinally, pick out those words that most accurately describe your app as a person. Those key attributes will become the definition of your app's voice.\n\nOkay, so let's say that instead of an investment app, I was creating an app to help kids save money. How would the voice be different? I imagine this app more like a teacher or a coach. So I wrote down words like fun, positive and optimistic. And then I just kept adding more words with the voice of a teacher or a coach in mind.\n\nJust like the first app, I then grouped them into themes and found the three categories of kind, fun and encouraging. I can use these to describe my app's voice.\n\nNow, looking at them side by side, you can see that even though both apps have a similar purpose, to help people reach their financial goals, their voices are very different.\n\nThe exercise we've just done can be helpful in defining what you want your app to sound like. But it's not an exact science. So if you come up with a word that doesn't fit within a category, but matches what you want your app to sound like, go ahead and include it as part of your app's voice.\n\nOkay, so after that exercise, you should have a clear idea of your app's voice. From here, let's go into our next exercise.\n\nWe're going to practice writing an example sentence that could go on a welcome screen in your app. A welcome screen is a great place to showcase your app's voice, because it's one of the first opportunities you have to connect with people using your app. So let's start by taking a look at a welcome screen in the Apple voice. This welcome screen is for the Stocks app on iPhone. Earlier, Alex said that Apple's voice is clear, simple, helpful, and friendly. And this screen starts with a friendly \"Welcome\" Then, like a lot of welcome screens for Apple apps, this one has three bullet points that describe its features. So let's take a look at just the first one. The heading \"Market Data\" is clear and simple and tells you exactly what the app is about. The next line, \"View stock quotes, interactive charts, and other financial metrics.\" is helpful because it provides more detail about what Market Data you'll have access to. So let's try writing a sentence together that could appear on a welcome screen. I'm going to do this with my investment app example to show you how to write in the voice of smart and motivating that we just defined.\n\nThe idea that I want to get across is something about saving your money. So let's write that down.\n\n\"Save your money.\" Now, I mean, I could just put that on my welcome screen, but I wouldn't say that sounds very motivating or smart. Everybody knows that they need to save money, but what is it that this app is going to do to help young investors? People early in their careers want to invest their money in order to grow it. So I'll take out the word \"Save\" and just keep that idea in mind as I'm writing this sentence.\n\nThinking about the motivating part of my app's voice, I think I could choose a verb that's more active and empowering. What about the word \"Customize\"? This sounds more motivating, but now the sentence is a little bit confusing. We're not customizing money, so to make this more clear, I'll get more specific about what my app does. I want to help people build an investment strategy and grow their portfolio. So I'll add that, and I think it will also help the sentence sound smarter.\n\n\"Customize your investment strategy.\" That sounds a lot smarter, and I think this is getting close. But as I think about who I'm talking to, I really want to speak to my audience of young investors. So I could be more specific about what my app can do for them.\n\nBy adding the phrase \"long-term\", I've made this sentence more specific and appropriate for my audience.\n\nSee how I went from a generic sentence, \"Save your money\", that doesn't sound like my app, to one that is specific, \"Customize your long-term investment strategy.\" that fits my app's voice.\n\nJust like with our first exercise, let's do the same thing for our savings app for kids. Remember, the kids app has a voice that is kind and encouraging. In fact, I think I'll start with the same sentence that we used for our investment app example.\n\n\"Save your money.\" Again, this is one of the first things that people using this app will see. And the sentence doesn't sound very kind, fun or encouraging for kids. The word \"Save\" could sound like a direction instead of something the app will help them with. So let's add something more encouraging to the beginning of the sentence.\n\nBy starting with \"We'll help you\", I'm reinforcing both the kind and encouraging parts of my app's voice. \"We'll help you save your money.\" That could definitely be more fun. So let's think about why kids want to save their money. What's so fun about that? Well, maybe they're saving up to buy something they want. I think I could work on the phrase \"save your money\" and get more specific about what I'm helping kids save for and make it sound more fun.\n\nBy changing this to \"save up to buy something you want\" I've made this sentence more playful and given kids a reason why they'd want to save their money. So let's see how we went from a first draft to this version of the sentence.\n\nYou can see how we transformed a sentence that introduces the app that now sounds kind, fun, and encouraging. And even though we started with the same beginning statement of \"save your money\" for both examples, we ended up in two very different places by writing with their different voices in mind.\n\nYou now have the tools to write in your app's voice. But what if you want to adjust your voice for different situations? Alex is going to show you how to take one of the sentences we just wrote and write it with a different tone and walk you through how to do it with your app.\n\nRemember that tone is how your voice adapts to the situation. Let's look at one of those sentences one more time and play with the tone. Now that we have the voice dialed in, we can play with the tone. Because this is a welcome screen, maybe you want to bring more energy into the writing with some punchy, exciting tone.\n\nWe start by making the first three words really action-oriented.\n\nSince this app is for kids, it feels okay to add something casual like the word \"really\". And the exclamation mark adds some energy that still feels like it's within the voice.\n\nTaking out \"to buy\" also makes the sentence feel more punchy.\n\nFor this last exercise, we're going to explore one way of thinking about tone. Let's use the Apple voice and some Apple examples for this one.\n\nEarlier, we talked about a few words that are helpful for me to think about when I'm writing for Apple. These aren't the only qualities that define the Apple voice, but they help me stay on point.\n\nNotice how there's a little bit of tension here. Simplicity and friendliness are just slightly at odds with each other. If you're adding an extra word here or there to create some friendliness, you're taking away from the simplicity and vice versa. They balance each other out. That can help modulate tone.\n\nTo help you dial in your tone for a specific situation, it can be helpful to think of each of these qualities as something that can be turned up or down.\n\nLet's think about an example that's similar to when we looked at earlier, a celebratory fitness message.\n\nThat's going to need a lot of friendliness.\n\nIt's going to need to be really clear about what you did to earn the award. It doesn't need to be super, super simple. You extra words won't hurt, but keeping it pretty short will help people understand it.\n\nIt doesn't really need to be that helpful because you've already won the award.\n\nSo this is where we land. See how friendliness is dialed way up with the inclusion of \"Three cheers!\" It's also very clear from the headline and the first sentence why you're getting the award: \"You tripled your daily Move goal.\" \"Three cheers!\" doesn't actually need to be there, but we can sacrifice a little simplicity for the sake of friendliness here.\n\nIt's also not really driving an action, so helpfulness isn't the priority either. Let's try another one. How about a situation where someone isn't connected to service or Wi-Fi, but they're trying to complete a task that requires connectivity? In this situation, someone needs to know exactly what to do, so let's turn helpfulness way up.\n\nHere, clarity and helpfulness go hand in hand, since being clear helps a person get what they need.\n\nSimplicity is important, but not as important as clarity or helpfulness because they really need the details. And finally, we'd never want to be unfriendly, but we might just have to dial that back in this situation to help a person get something done.\n\nOkay. So, here's how that comes together. The headline is super clear and direct. \"Cellular Data is Turned Off.\" It doesn't really read like someone talking to a friend because it's so direct. But the sentence is very helpful and pretty simple, because it tells you exactly what you need to do and then gets out of the way. \"Turn on cellular data or use Wi-Fi to access data.\" In this case, the repetition of data is important because clarity is paramount.\n\nLet's try it with one more example. How about an introduction to a new feature? This is the first time someone is engaging with this experience, so it's a good idea to bring in some friendliness. Since they're getting started, you'll want to help them by giving them a sense of how to use it.\n\nIt should be really clear what the feature is and what it's for. Simplicity is always great, but it's not as high on the priority list here because you'll need to expand a little bit on the new feature.\n\nYou can see how that comes together. In this example that introduces a new Focus mode called Work Focus.\n\nThe headline is simply the name of the feature, \"Work Focus\" which is also the main benefit and it doesn't get much clearer than that.\n\nThe friendliness and helpfulness come through in some relatable examples. \"When you're working on a project or your to-do list, get things done by silencing notifications or customizing your screens and apps.\" Because of that friendliness, it's a little more casual and not quite as simple as it could be.\n\nNotice that none of the qualities are turned all the way down. It's just about adjusting the balance. Of course, tone is nuanced. Some qualities, like smartness from our earlier example, you'll always want to be on. It's not something you dial up or down.\n\nSo while this exercise doesn't represent everything that tone is, it can be helpful as a model for thinking about how you adjust your tone. So, let's break that into four simple steps to help you put it into practice.\n\nStart by picking four qualities that describe your voice. Then, place them on a spectrum.\n\nDecide the balance that's needed in the situation and finally, write with that tone.\n\nWe've covered a lot. Now that you've done some exercises to find the right voice, tone and personality for your app, try it out! There are some best practices to keep in mind when writing for your app.\n\nMake sure you're not giving up usefulness when trying to write with voice and tone. Just look for those special moments where your personality can shine through.\n\nRead your writing out loud. Ask yourself. Does this sound like the best version of your app? Avoid jargon. Not everyone knows it, so it can make people feel left out. On a related note, write inclusively. Try to bring everyone in with your writing rather than excluding groups of people. You can research inclusive writing to find out more.\n\nLastly, you can always refer back to the WWDC talk called \"Writing for Interfaces\" or check out the writing section of the HIG.\n\nWe can't wait to see what you write.\n\nThanks for joining us.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Forum: Design",
        "url": "https://developer.apple.com/forums/topics/design?cid=vf-a-0010"
      },
      {
        "title": "Human Interface Guidelines: Writing",
        "url": "https://developer.apple.com/design/human-interface-guidelines/writing"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/10140/4/A5E944E8-26A4-4A88-98E9-50C631A5E102/downloads/wwdc2024-10140_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/10140/4/A5E944E8-26A4-4A88-98E9-50C631A5E102/downloads/wwdc2024-10140_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10037",
      "year": "2022",
      "title": "Writing for interfaces",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10037"
    }
  ],
  "extractedAt": "2025-07-18T09:36:02.283Z"
}