{
  "id": "111976",
  "year": "2024",
  "url": "https://developer.apple.com/videos/play/wwdc2024/111976/",
  "title": "18 things from WWDC24",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Voiceover: Siri, play that one song Diego sent me.\n\n♪ \"So Happy\" (feat. Laura Mvula & Francis and the Lights) by Kassa Overall ♪ OK... Oh! How'd it do that? With Apple Intelligence.\n\nIt's AI that gets you, on your Apple products -- iPhone, iPad, Mac -- with built-in privacy.\n\nAnd you can make your own emoji.\n\nYeah.\n\nMake.\n\nYour.\n\nOwn.\n\nEmoji. Make your new profile pic with Image Playground.\n\nPull up a photo by describing it.\n\nOr clean up an otherwise very cute pic.\n\nYou can make a movie! Your life plus a description plus your camera roll equals sweet memories.\n\nWait.\n\nSiri?  When's Mom's flight landing? Oh. Where are we eating after? Ah. How do I share a password? What if I forget all this stuff? Siri: Just ask. Voiceover: Oh...\n\nApple Intelligence can TL;DR your long messages and highlights the important ones.\n\nIt can just find stuff deep in your phone like your driver's license number or that front-row concert ticket.\n\nComing to iPad...\n\nCalculator.\n\nAnd you can just handwrite a math problem.\n\nMath Note solves it for you.\n\nOr write something not even you can read, and iPad will clean it right up.\n\nSay what you really mean in Messages, with more expression, more personality, more you, now or later, from just about anywhere, even without a phone signal... ...because of satellites. Ugh! I forgot my phone.\n\nOh! I can just pull it up on Mac and use it! Digital voice: La manzana.\n\nVoiceover: Ooh! I'm going to get another coffee.\n\nHey, bud...\n\nFocus, focus.\n\nCustomize your iPhone's Home Screen and these buttons. Hide or lock the apps you want to, um, keep to yourself.\n\nSiri: Call from Dump Him.\n\nAnswer it? Voiceover: Mm-mm.\n\nJust shake or nod to reply to Siri with AirPods.\n\nSee how much effort you've put in with Apple Watch.\n\nWhew! Time to chill.\n\nTake up some space.\n\nWhoa, that's big! Revisit these cuties in Spatial.\n\nAnd immerse yourself with these guys on Vision Pro.\n\nOK, there's more than 18 things.\n\nWay more. But, whatever! You deserve it.\n\nSee you this fall.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/111976/1/FF5D2060-A995-4815-90EF-1E40B45F8C91/downloads/wwdc2024-111976_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/111976/1/FF5D2060-A995-4815-90EF-1E40B45F8C91/downloads/wwdc2024-111976_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T10:21:03.672Z"
}