{
  "id": "111977",
  "year": "2024",
  "url": "https://developer.apple.com/videos/play/wwdc2024/111977/",
  "title": "Platforms State of the Union 5-Minute Recap",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Welcome to the WWDC 24 Platforms State of the Union! WWDC is always an exciting time of year when we dig into the technical details of what we've been working on, share how it works, and help you understand what's possible in your apps and games.\n\ntoday marks the beginning of an exciting chapter with Apple Intelligence.\n\nApple Intelligence is the personal intelligence system, bringing powerful generative models to our platforms.\n\niOS, iPadOS, and macOS get powerful new capabilities and helping users take actions, all with rich awareness of users' personal context. If you're using any of the standard UI frameworks to render text fields, your app will automatically get Writing Tools! And using our new TextView delegate API, you can customize how you want your app to behave while Writing Tools is active, Genmoji opens up entirely new ways to communicate, and new Image Playground API delivers a consistent, playful, and easy-to-use experience.\n\nAs Swift continues to evolve, it's becoming a compelling choice for even the most performance-sensitive and secure code.\n\nThis year, Swift celebrates its 10th birthday! Swift's safety, speed, and approachability, combined with built-in C and C++ interoperability, mean Swift is the best choice to succeed C++. By enabling you to express what you want, not how to build it, SwiftUI lets you share more of your code across more devices. And we're continuing to make multi-year investments to the developer experience. This year, we focused on previews, customizations, and interoperability. Previews has a new dynamic linking architecture that uses the same build artifacts for previews and when you build-and-run. SwiftUI has also gained a number of customizations to fine-tune the look and feel of your apps, and this year, all our UI frameworks share more common foundations.\n\nXcode 16 begins a whole new chapter for development, as we infuse our tools with the power of Generative Models. It starts with a major leap forward in a core feature that you use every day, Code completion, with an innovative new engine that can predict the code you need.\n\nIt uses your project symbols to customize suggestions.\n\nAnd it runs locally on your Mac, keeping your code private, giving you super-fast results, and even works when you're offline. Building an app is more than just typing code.\n\nIt's about transforming entire ideas into code.\n\nAnd the easiest way to do that is with natural language.\n\nSo we created a larger and more powerful model that runs in the cloud. Introducing Swift Assist, a companion for all your coding tasks. Swift Assist can answer your coding questions and help with tasks like experimenting with new APIs. So now, tasks like exploring new frameworks and experimenting with new ideas are just one request away.\n\nXcode 16 also has many other new features to make you more productive and improve the quality of your apps, things like a single view of your backtraces, a \"flame graph\" of your profiling data in Instruments, and enhancements to localization catalogs, so you can bring your app to even more people around the world. What an exciting time to be developing for Apple platforms.\n\nControls can toggle a setting, execute an action, or deep link right to a specific experience. Using the new Controls API, Users can also assign your control to the Action button or, for the first time, to appear as one of the controls on their Lock Screen. An app icons and widgets can now appear Light, Dark, or with a Tint.\n\nThis treatment is applied to all app icons, and is crafted intelligently to preserve your design intent and maintain legibility. With the incredible pace of innovation in Metal and Apple silicon, Every Apple silicon Mac, every iPad with an M-series chip, and even iPhone 15 Pro can play the type of games that previously required dedicated gaming systems with power-hungry discrete GPUs.\n\nWith Game Porting Toolkit 2, you can now evaluate even more Windows games thanks to improved compatibility with technologies like AVX2 and advanced gaming features like ray tracing. Developers from across the world have been building incredible spatial apps for visionOS.\n\nFor example, djay started with their SwiftUI-based iPad app, easily recompiled to run on visionOS, and then extended it for spatial computing, Whether you already have a visionOS app or are new to the platform, spatial computing provides incredible opportunities for your apps.\n\nWe are grateful that you are part of the Apple developer community, and we're excited to see you bring these technologies to life in your amazing apps and games.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/111977/1/0B66B228-1D2B-42E4-9609-B42FD8A37793/downloads/wwdc2024-111977_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/111977/1/0B66B228-1D2B-42E4-9609-B42FD8A37793/downloads/wwdc2024-111977_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "102",
      "year": "2024",
      "title": "Platforms State of the Union",
      "url": "https://developer.apple.com/videos/play/wwdc2024/102"
    }
  ],
  "extractedAt": "2025-07-18T10:21:08.281Z"
}