{
  "id": "10098",
  "year": "2024",
  "url": "https://developer.apple.com/videos/play/wwdc2024/10098/",
  "title": "Design Live Activities for Apple Watch",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services",
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi, Welcome to Design Live Activities for Apple Watch. My name is Ed. And my name is Taylor, and we’re designers on the Apple Design Team. Together, we’ll go through everything you need to know to design great Live Activities for Apple Watch.\n\nWhat we’ll talk about today, builds upon many of the changes we introduced in watchOS 10 which was the most significant change to Apple Watch since its introduction.\n\nIn addition to an entirely new user interface focused on glanceability, clarity, and consistency, we introduced the Smart Stack, a new way to see timely, relevant widgets right over your Watch Face. And it’s in this Smart Stack, where Live Activities come to Apple Watch.\n\nSo in this session, we’re going to cover: the improvements we’re bringing to Smart Stack, which is the primary surface for Live Activities; all the different ways you can interact with Live Activities on Apple Watch; and finally, visual guidelines for how to craft a great Live Activity.\n\nLet’s start with Smart Stack.\n\nIn watchOS 11, we’re introducing Suggested Widgets. These are widgets that the system intelligently adds or removes based on what’s relevant in the moment. For example, this new precipitation widget shows up 15 minutes before it rains and then disappears once the skies clear up.\n\nOr, if there’s music playing around you, the Shazam widget can help you quickly identify what song is playing.\n\nAnd it too, disappears once the music stops.\n\nWidgets in watchOS 11 can also be interactive, enabling you to do things like tapping this Home widget to turn a nearby light on.\n\nBut the biggest change to the Smart Stack is the addition of Live Activities. Live Activities have changed the way we interact with notifications on iPhone.\n\nInstead of receiving multiple notifications when you’re tracking something like a ride to the airport, or your food delivery order, you see a single, dynamically updating Live Activity - right on your Lock Screen. On iPhone 15 and 15 Pro, Live Activities also appear in the Dynamic Island allowing you to keep track of Live Activities while you use your iPhone.\n\nIn watchOS 11, when a Live Activity begins on your iPhone, it automatically shows up at the top of the Smart Stack on Apple Watch. So you can track its progress just by raising your wrist. And, because the Smart Stack can now open automatically, we’ve updated the corner clock to match the design of your watch face. To tell you more about how people interact with Live Activities on Apple Watch, here’s Taylor. Thanks, Ed. We’re really excited about how Live Activities in watchOS 11 bring even more timely, relevant information to your wrist. Because of the Apple Watch’s unique form factor and lightweight interaction model, we’ve designed Live Activities to be experienced in a number of ways that are distinctive from iPhone.\n\nOn Apple Watch, when a Live Activity starts, the Smart Stack is automatically presented and displays a widget for that Live Activity. This allows you to see the status of a Live Activity just by raising your wrist, without having to first rotate the Digital Crown. New, in watchOS 11, the Smart Stack will remain visible when you put your wrist down so you can continue to glance at both the time and the Live Activity you are tracking. When you tap on the Live Activity widget, you’re taken into the app.\n\nIf you don’t have an Apple Watch app, it will expand into a system provided fullscreen view that contains a convenient button to open your app on iPhone so people can transition to a richer experience there.\n\nBut what if someone is in another app when your Live Activity starts? To ensure people never miss an update from your Live Activity we’ve created the compact view When you’re interacting with an app and a Live Activity receives an update, like the status of your food delivery changing, a smaller, more compact version of the Live Activity appears at the bottom of the display. If you pull up on this compact view, it enlarges into the full widget. And if you tap on either, you will be taken to the app or fullscreen view.\n\nLike notifications, we’ve designed Live Activities to demand the right amount of attention based on how you are interacting with Apple Watch. If your wrist is down and you are on your watch face, you can simply raise your wrist to see a full-sized representation of the Live Activity you’re tracking. If you’re actively using Apple Watch, this compact view is less interruptive and allows you to see that an update occurred without disrupting the task you are performing.\n\nTo tell you more about the visual design of Live Activities, here’s Ed.\n\nLive Activities on Apple Watch are meant to be highly glanceable, providing just the information you need, and nothing more. On iPhone, Live Activities occupy the dynamic island, which can expand when there is an alerting update, and then contract back to its default state. And it’s in this default state where only the most critical information remains visible.\n\nBut, on Apple Watch,a smaller screen demands a more focused approach, meaning: only the most critical information should be shown at any given time.\n\nIn watchOS 11, we’ve made this effortless for developers, by automatically generating Live Activities on Apple Watch by forwarding and re-compositing assets from the Dynamic Island’s Compact state. However, the best experiences for Live Activities on Apple Watch are those that adopt the Apple Watch size class. This enables developers to provide more helpful information as well as a more engaging design. As you can see, there is a significant difference in quality and experience between these two options.\n\nA common question when designing Live Activities on Watch is how much information is too much or too little? To answer that, we recommend showing only what is necessary to communicate significant states in the live activity.\n\nThese are states that help people understand progress, like how long until your flight touches down. Or states that might require action, like getting to the curb because your Uber is arriving. Or these could just be states that someone might really care about, such as a change in the score of a game.\n\nAnother common question is whether or not controls make sense for your live activity.\n\nControls are best for live activities that need to be played, paused or resumed. For example, a workout, a timer, or a voice memo.\n\nWhatever the control is, we strongly recommend sticking with just one, as multiple controls are challenged by the small space, which also need to provide enough information to communicate state.\n\nSpeaking of space constraints. To help you make the most of the space we recommend using one of our existing design layouts which can accommodate different levels of information density and graphical elements. You can learn more about these layouts in last year's session: \"Design Widgets for the Smart Stack on Apple Watch.\" If, however, you want to do something completely custom, we recommend using standard margins and text styles to ensure that your Live Activity both fits in with the visual language of the Smart Stack and remains legible at a glance.\n\nThe best way to learn about Live Activities is to build one yourself. For that, we have a wonderful session called, \"Bring your Live Activity to Apple Watch.\" In that session, our engineering colleague Anne will walk you through exactly how to customize your Live Activity for Apple Watch.\n\nIt’s also worth mentioning that Live Activities on Apple Watch is an experience that has only been made possible by building on the foundation of other key features. These include the Smart Stack, the Dynamic Island, and, of course, Live Activities on iPhone. If you’re interested in getting a fuller understanding of each of these experiences, we recommend checking out a few of these sessions from previous years.\n\nWe think Live Activities make Apple Watch even more contextually intelligent, so that a glance is all you need to get the right information, at the right time. Thanks for joining us today, we are so excited to see your Live Activities in the Smart Stack.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Forum: Design",
        "url": "https://developer.apple.com/forums/topics/design?cid=vf-a-0010"
      },
      {
        "title": "Human Interface Guidelines: Live Activities",
        "url": "https://developer.apple.com/design/human-interface-guidelines/live-activities"
      },
      {
        "title": "Human Interface Guidelines: watchOS",
        "url": "https://developer.apple.com/design/human-interface-guidelines/designing-for-watchos"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/10098/7/25EEDB0F-2C34-42C4-A647-CD4ACBF973C5/downloads/wwdc2024-10098_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/10098/7/25EEDB0F-2C34-42C4-A647-CD4ACBF973C5/downloads/wwdc2024-10098_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10068",
      "year": "2024",
      "title": "Bring your Live Activity to Apple Watch",
      "url": "https://developer.apple.com/videos/play/wwdc2024/10068"
    },
    {
      "id": "10205",
      "year": "2024",
      "title": "What’s new in watchOS 11",
      "url": "https://developer.apple.com/videos/play/wwdc2024/10205"
    },
    {
      "id": "10194",
      "year": "2023",
      "title": "Design dynamic Live Activities",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10194"
    }
  ],
  "extractedAt": "2025-07-18T09:11:54.243Z"
}