{
  "id": "10155",
  "year": "2024",
  "url": "https://developer.apple.com/videos/play/wwdc2024/10155/",
  "title": "Swift Charts: Vectorized and function plots",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Services"
  ],
  "hasTranscript": true,
  "hasCode": true,
  "transcript": {
    "fullText": "Hi, I’m Apollo. Let me tell you about what's new in Swift Charts. Swift Charts enables the creation of informative, accessible, and delightful visualizations using SwiftUI. This release brings to you new charts to present weather trends, track your mood and vitals, and graph functions in Math Notes.\n\nThat's right! Swift Charts now allows you to visualize things beyond data, by plotting mathematical functions in your apps.\n\nSwift Charts now also has vectorized plotting APIs that support visualizing larger data sets even more efficiently. I've plotted this video to teach you more about each of these exciting new capabilities of Swift Charts. Starting with function plots, which introduce two new APIs: LinePlot, for visualizing a single function, And AreaPlot, to fill in the area between two functions. Let me take you through how function plots can help me with data analysis.\n\nI’ve been researching Large-Scale Solar energy projects in the contiguous United States, using a dataset from US Geological Survey.\n\nI built a histogram to visualize the solar panels’ capacity densities with a ForEach over the data points, and a BarMark for each element. You know what? This histogram suggests that capacity density may be normally distributed. I’ll compare by plotting a normal distribution using the new function plot API.\n\nI've defined a function that calculates the points on a normal distribution curve and I can plot it using the new LinePlot API, which accepts a closure that takes a double and returns a double, so I can call my function with a precomputed mean and standard deviation. It's fundamental to Swift Charts that data visualizations are accessible to everyone. Swift Charts makes your chart accessible by default. I can use Voice Over to describe the chart. “The x axis is capacity density, The y axis is probability. There are two data series.\" Audio Graph works on a function plot, too.\n\n\"Complete.\" Great! And just like in SwiftUI, you can use modifiers to customize how your functions look.\n\nHere, because the LinePlot has the same default color as the bars, it's a good idea to customize the color of my function plot with a different foregroundStyle.\n\nMuch better now. But, to make it stand out just a little more, I would like to fill in the area below the curve. To do that, I can simply change the LinePlot to an AreaPlot. Then, to increase the contrast, I can further customize the AreaPlot with an opacity to make it more legible.\n\nSo that's how to plot a simple math function. But Swift Charts makes it just as easy to build more advanced function plots.\n\nFor example, not only can AreaPlot visualize the area under a curve, you can use it to visualize the area between two functions as well, by returning a tuple of yStart and yEnd for a given input x.\n\nUnlike visualizing data, a function can accept an unbounded range of x values. By default, Swift Charts automatically infers the domain by sampling the function. But I can customize the overall bounds of the chart by setting the X scale and the Y scale to include only parts of the function that I find interesting.\n\nI also have the ability to limit the domain of the function plot itself.\n\nBy restricting AreaPlot’s sampling domain, the chart now includes only the middle part of this function.\n\nSwift Charts also supports plotting parametric functions.\n\nHere's a parametric function, where x and y are defined in terms of a 3rd variable, T. Let's plot it.\n\nYou can graph parametric functions in Swift Charts by using the same LinePlot API, but return both x and y values given the value t. I love it! Next, let's talk about how to handle piece-wise functions.\n\nSometimes, a piece-wise function doesn't have an output for certain values in it's domain.\n\nIn those cases, you can return .nan to inform Swift Charts that there's not a number for that input value x.\n\nIn other cases, your code might trap for certain x values, such as when evaluating 1 over x when x is equal to 0.\n\nSimilarly, you should handle the special values by returning .nan.\n\nThat's function plotting with Line Plot and Area Plot, where they treat an entire math function as a single entity. But the plot APIs are useful for more than just functions. They can make it more convenient and more efficient to visualize larger datasets.\n\nSo we've added plot API variants for all the other mark types, too.\n\nThese vectorized plot APIs can handle an entire collection in parallel to draw extensive data visualizations, such as a scatter plot for a classification model, or a heatmap visualizing self attention in a transformer language model. But before I let the plot thicken, let's review how you would declare a Chart using the Mark API.\n\nMarks are super flexible, allowing you to style each individual data point differently; from choosing which modifiers to apply, to even what kind of mark to use. However, most often you don't need this level of customization. It's common for an entire collection of data points to be styled homogeneously, using the same element properties for X, Y, foregroundStyle, and other visual attributes.\n\nIn contrast, the new Vectorized Plot API, such as RectanglePlot, allows Swift Charts to process larger collections of data more efficiently. For an example of vectorized plots, let’s go back to our solar panel dataset. I want to add a visualization of ALL the solar panel installations to my app. For all the points in this chart, I'd like to customize them in the same way. The size will be determined by the capacity, and they'll be colored differently based on the panel's axis type.\n\nThe dataset has raw GPS coordinates in longitude and latitudes, but I want to apply Albers projection to display the points on a flat surface. I could add computed properties in an extension to do this conversion on the fly, but to get the most out of vectorized plots, I'll add them as stored properties instead. Stored properties allows Swift Charts to access the x and y values for all data points with a constant memory offset instead of calling the getter for every data point.\n\nThe new PointPlot API takes an entire collection of data to plot.\n\nFor the x and y values of all the points in the plot, I can use the same .value syntax with a label, And a KeyPath to the stored properties x and y of the DataPoint structure. If you've used SwiftUI before, you might have already used KeyPaths. Using KeyPaths lets Swift Charts style all the points without iterating over the dataset.\n\nModifiers for vectorized plots take keyPaths as well. With symbolSize, I make the size of each point represent its solar panel capacity. And similarly, I use a key path to the solar panel's axis type to customize the color of each point. All other modifiers that are often used for homogenous modification support a key path parameter, too. My app looks stunning in Apple Vision Pro with spatial computing. The vectorized plot on my left animates smoothly, and all the charts on my dashboard update simultaneously when I scrub through the bar chart.\n\nWith pinch and drag, I can get a closer look at the vectorized plot we just added to learn more about each solar panel installation and glance over the normal distribution plot that we created earlier.\n\nThat's vectorized plots. Now you might be wondering how Vectorized plots and Marks complement each other. Use Vectorized Plots for larger datasets where the entire plot is customized with the same modifiers and properties.\n\nUse the Mark API when you have fewer data points, but need to customize each element with individual mark types and modifiers, or if you need complex layering with zIndex.\n\nWhen using vectorized plots, you can help Swift Charts reduce the number of style alternation by grouping the collection of data by the style you'll use for them. Avoiding other computations during rendering can help too, such as by converting computed properties to stored properties.\n\nIf you already know the few distinct styles you'll use, or the over all bounds of the chart, specifying them will render your Charts more efficiently. And lastly, it's common for some style customizations to be unnoticeable with larger amount of datapoints, so you can skip those entirely to make your chart even more performant.\n\nThat's the new vectorized and function plots in Swift Charts. Try out these new features to take your visualizations to the next level. And download the Sample Project to check out more examples of function plots, including how you can add interactions to them. If you are new to Swift Charts, check out previous talks to get started. Thank you, and I look forward to what you'll plot next.",
    "segments": []
  },
  "codeExamples": [
    {
      "timestamp": "1:43",
      "title": "Histogram that shows distribution of capacity density",
      "language": "swift",
      "code": "Chart {\n  ForEach(bins) { bin in\n    BarMark(\n      x: .value(\"Capacity density\", bin.range),\n      y: .value(\"Probability\", bin.probability)\n    )\n  }\n}"
    },
    {
      "timestamp": "2:18",
      "title": "Visualize function with LinePlot​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​",
      "language": "swift",
      "code": "Chart {\n  LinePlot(\n    x: \"Capacity density\", y: \"Probability\"\n  ) { x in // (Double) -> Double\n    normalDistribution(\n      x,\n      mean: mean, \n      standardDeviation: standardDeviation\n    )\n  }\n}"
    },
    {
      "timestamp": "3:36",
      "title": "Customize function plot with modifiers",
      "language": "swift",
      "code": "Chart {\n  LinePlot(\n    x: \"Capacity density\", y: \"Probability\"\n  ) { x in\n    normalDistribution(x, ...)\n  }\n  .foregroundStyle(.gray\n}"
    },
    {
      "timestamp": "3:57",
      "title": "Visualize area under a curve with AreaPlot​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​",
      "language": "swift",
      "code": "Chart {\n  AreaPlot(\n    x: \"Capacity density\", y: \"Probability\"\n  ) { x in\n    normalDistribution(x, ...)\n  }\n  .foregroundStyle(.gray)\n  .opacity(0.2)\n}"
    },
    {
      "timestamp": "4:21",
      "title": "Visualize area between curves with AreaPlot",
      "language": "swift",
      "code": "Chart {\n  AreaPlot(\n    x: \"x\", yStart: \"cos(x)\", yEnd: \"sin(x)\"\n  ) { x in\n    (yStart: cos(x / 180 * .pi),\n     yEnd: sin(x / 180 * .pi))\n  }\n}"
    },
    {
      "timestamp": "4:59",
      "title": "Specify domain for function plots",
      "language": "swift",
      "code": "Chart {\n  AreaPlot(\n    x: \"x\", yStart: \"cos(x)\", yEnd: \"sin(x)\"\n  ) { x in\n    (yStart: cos(x / 180 * .pi),\n     yEnd: sin(x / 180 * .pi))\n  }\n}\n.chartXScale(domain: -315...225)\n.chartYScale(domain: -5...5)"
    },
    {
      "timestamp": "5:18",
      "title": "Specify sampling domain for function plots",
      "language": "swift",
      "code": "Chart {\n  AreaPlot(\n    x: \"x\", yStart: \"cos(x)\", yEnd: \"sin(x)\",\n    domain: -135...45\n  ) { x in\n    (yStart: cos(x / 180 * .pi),\n     yEnd: sin(x / 180 * .pi))\n  }\n}\n.chartXScale(domain: -315...225)\n.chartYScale(domain: -5...5)"
    },
    {
      "timestamp": "5:55",
      "title": "Visualize parametric functions",
      "language": "swift",
      "code": "Chart {\n  LinePlot(\n    x: \"x\", y: \"y\", t: \"t\", domain: -.pi ... .pi\n  ) { t in\n    let x = sqrt(2) * pow(sin(t), 3)\n    let y = cos(t) * (2 - cos(t) - pow(cos(t), 2))\n    return (x, y)\n  }\n}\n.chartXScale(domain: -3...3)\n.chartYScale(domain: -4...2)"
    },
    {
      "timestamp": "6:40",
      "title": "Use Double.nan to represent no value",
      "language": "swift",
      "code": "Chart {\n  LinePlot(x: \"x\", y: \"1 / x\") { x in\n    guard x != 0 else {\n      return .nan\n    }\n    return 1 / x\n  }\n}\n.chartXScale(domain: -10...10)\n.chartYScale(domain: -10...10)"
    },
    {
      "timestamp": "7:43",
      "title": "Highly customized Chart",
      "language": "swift",
      "code": "Chart {\n  ForEach(model.data) {\n    if $0.capacityDensity > 0.0001 {\n      RectangleMark(\n        x: .value(\"Longitude\", $0.x),\n        y: .value(\"Latitude\", $0.y)\n      )\n      .foregroundStyle(by: .value(\"Axis type\", $0.axisType))\n    } else {\n      PointMark(\n        x: .value(\"Longitude\", $0.x),\n        y: .value(\"Latitude\", $0.y)\n      )\n      .opacity(0.5)\n    }\n  }\n}"
    },
    {
      "timestamp": "8:00",
      "title": "Homogeneously styled Chart",
      "language": "swift",
      "code": "Chart {\n  ForEach(model.data) {\n    RectangleMark(\n      x: .value(\"Longitude\", $0.x),\n      y: .value(\"Latitude\", $0.y)\n    )\n    .foregroundStyle(by: .value(\"Axis type\", $0.panelAxisType))\n    .opacity($0.capacityDensity)\n  }\n}"
    },
    {
      "timestamp": "8:23",
      "title": "Vectorized plot for homogeneously styled chart",
      "language": "swift",
      "code": "Chart {\n  RectanglePlot(\n    model.data,\n    x: .value(\"Longitude\", \\.x),\n    y: .value(\"Latitude\", \\.y)\n  )\n  .foregroundStyle(by: .value(\"Axis type\", \\.panelAxisType))\n  .opacity(\\.capacityDensity)\n}"
    },
    {
      "timestamp": "9:42",
      "title": "Vectorized point plot API",
      "language": "swift",
      "code": "Chart {\n  PointPlot(\n    model.data,\n    x: .value(\"Longitude\", \\.x),\n    y: .value(\"Latitude\", \\.y)\n  )\n}"
    },
    {
      "timestamp": "10:26",
      "title": "Vectorized plot modifiers",
      "language": "swift",
      "code": "Chart {\n  PointPlot(\n    model.data,\n    x: .value(\"Longitude\", \\.x),\n    y: .value(\"Latitude\", \\.y)\n  )\n  .symbolSize(by: .value(\"Capacity\", \\.capacity))\n  .foregroundStyle(\n    by: .value(\"Axis type\", \\.panelAxisType)\n  )\n}"
    }
  ],
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Creating a data visualization dashboard with Swift Charts",
        "url": "https://developer.apple.com/documentation/Charts/creating-a-data-visualization-dashboard-with-swift-charts"
      },
      {
        "title": "Forum: UI Frameworks",
        "url": "https://developer.apple.com/forums/topics/ui-frameworks?cid=vf-a-0010"
      },
      {
        "title": "Swift Charts updates",
        "url": "https://developer.apple.com/documentation/Updates/SwiftCharts"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/10155/4/61F720F1-1AED-48CC-A380-9E1D01E87E4A/downloads/wwdc2024-10155_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2024/10155/4/61F720F1-1AED-48CC-A380-9E1D01E87E4A/downloads/wwdc2024-10155_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "10037",
      "year": "2023",
      "title": "Explore pie charts and interactivity in Swift Charts",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10037"
    },
    {
      "id": "10136",
      "year": "2022",
      "title": "Hello Swift Charts",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10136"
    },
    {
      "id": "10137",
      "year": "2022",
      "title": "Swift Charts: Raise the bar",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10137"
    }
  ],
  "extractedAt": "2025-07-18T09:11:08.863Z"
}