{
  "id": "101",
  "year": "2024",
  "url": "https://developer.apple.com/videos/play/wwdc2024/101/",
  "title": "Keynote",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "♪ ♪ Craig Federighi: Big day, everyone. Biggest day of the year. Who's fired up? Beth is fired up! Doctor? Rockwell? One more thing: just have fun out there.\n\nOkay, Phil! Phil: I'm getting too old for this stuff. ♪ ♪  ♪ ♪ Craig: Go! Go! It's showtime! ♪ ♪ ♪ ♪ Tim Cook: Wow! That was so cool. Good morning! Welcome to Apple Park! We're glad you could join us for what promises to be an action-packed and memorable WWDC! WWDC marks a moment in the year when we're able to celebrate our global developer community. Developers continue to amaze us with the apps they create for our products, apps that are used by over a billion people around the world. It's important for us to provide this community with the newest tools and technologies to do their very best work. Today, we're going to have some incredible updates to our platforms. And I'm excited that we'll introduce profound new intelligence capabilities that we hope will inspire developers, delight users, and make our platforms even smarter and more useful than ever. Before we get into our platforms, let's talk about Apple TV+, which is celebrating its fifth anniversary this year! Apple TV+ is the best in entertainment, filled with shows and movies made by the world's most creative storytellers. And I'm proud to say that Apple TV+ has been recognized for delivering the highest-rated originals in the industry for three years running! Apple TV+ features great originals that have received industry-wide recognition such as Oscars, Emmys, and BAFTAs. This past year alone, Apple TV+ has debuted critically acclaimed movies like \"Killers of the Flower Moon\" and \"Napoleon\" and hit shows like \"Masters of the Air,\" \"Palm Royale,\" \"Hijack,\" \"Dark Matter,\" and \"Monarch: Legacy of Monsters.\" And we're about to launch our most exciting lineup yet, with amazing new originals arriving on Apple TV+ each and every week. Let's take a look!  - Welcome back. Been a minute. ♪ ♪ - I can write a story that will set you free.\n\n- Our existence is all about choices. - I just need to get to the truth. - I did not kill her.\n\n- We can't lose the race for the moon. We need to shoot a backup. - You mean to fake it? - We are not finished! We will safely leave the silo! ♪ ♪ - Good work, Watson.\n\n- Rory, you are driving recklessly! - I'm in the middle of a high-speed car chase! - Maybe I should drive.\n\n- My gut is telling me this is connected. - You and I are cut from the same beautiful cloth. - You take that back. - This is not how I work. - Feeling's mutual. - Ready? - Yeah.\n\n♪ ♪ - Wait! - Admit it, he was cool. - Okay, fine, he was very cool. ♪ ♪ Tim: This lineup looks incredible. I hope you're as excited about these Apple Originals as I am! And now, let's turn to our platforms. We have so much to talk about today. We'll start with our OS announcements, and then we'll dive deeper into intelligence. Let's start with our newest operating system, visionOS. We released Apple Vision Pro in February, and we already have some great updates to share with you today. Here's Mike to tell you more. ♪ ♪ Mike Rockwell: Apple Vision Pro and visionOS unlock completely new possibilities for entertainment, productivity, collaboration, and so much more. Vision Pro has inspired developers to create amazing and unique spatial apps that aren't possible on any other platform. Apps like NBA, where you can watch multiple live games with stats, \"What If?\", where you become a superhero in the Marvel universe, and \"Unextinct,\" where you can explore endangered species. Games that take advantage of your space, immerse you completely, challenge you in new ways, or let you gather around a table to play with friends, even when you're not together. You can master meditation with Po from \"Kung Fu Panda,\" bring your data to life with SAP, and doctors can even reimagine surgical simulation and planning. New apps, including some from the world's biggest names in entertainment, productivity, and gaming are arriving on the App Store every day. There's already over 2,000 apps created specifically for Apple Vision Pro. And with over 1.5 million compatible iPhone and iPad apps, there's always something new to do. All of these amazing apps and experiences are made possible by visionOS. It's been just four months since we launched Vision Pro and visionOS, and today we're already announcing our first major update. Introducing visionOS 2. visionOS 2 propels spatial computing forward with new ways to connect with your most important memories, great enhancements to productivity, and powerful new developer APIs for immersive shared experiences. To tell you more, here's Haley.\n\nHaley Allen: visionOS 2 is a great release with some big updates. Let's start with Photos. Spatial computing has reinvented how you view your photos. There's nothing like seeing them life-sized with incredible fidelity. Spatial photos are even more powerful, bringing life and realism to your favorite moments with family and friends. It's incredibly moving to step back into a treasured memory, and the rich visual depth of spatial photos makes this possible. Now, visionOS 2 lets you do something truly amazing with the photos already in your library. With just the tap of a button, advanced machine learning derives both a left and right eye view from your beautiful 2D image, creating a spatial photo with natural depth that looks stunning on Vision Pro. It's so magical to reach into the past and bring your most cherished photos into the future. And now, you can experience all your panoramas and spatial photos and videos together with the people you love using SharePlay in the Photos app. With our new spatial Personas, it feels like they are sitting right next to you, even if they're thousands of miles away. People are amazed at how easy it is to navigate Vision Pro with just their eyes, hands, and voice. And with visionOS 2, we've made it even easier. Now you can just hold your hand up and tap to open Home View. Or flip your hand over to bring up time and battery level. And tap again to open Control Center, giving you quick access to frequently used features like Notifications and Mac Virtual Display. People love Mac Virtual Display because it lets them bring their Mac wirelessly into Vision Pro just by looking at it, giving them a large, private, and portable 4K display. Later this year, it gets even better, with higher display resolution and size. And it can be expanded even further, into an ultra-wide display that wraps around you, equivalent to two 4K monitors side by side. Your content stays sharp wherever you look thanks to dynamic foveation performed on the Mac. Another great thing about Apple Vision Pro is how incredible it is to use on a plane, letting you take a private movie theater wherever you go. With visionOS 2, we're adding train support to Travel Mode, so you can work privately on your long commute or catch up on your favorite shows on a massive screen. These updates are going to make the Vision Pro experience even better. And now, back to Mike.\n\nMike: In addition to these great features, visionOS 2 also makes it even easier for developers to create sophisticated spatial apps. There are many new frameworks and APIs for developers to explore, like advanced volumetric APIs that allow even the most complex 3D apps to run side by side for the ultimate multitasking experience. TabletopKit makes it possible for developers to quickly create apps that anchor to flat surfaces, like manufacturing workstations or board and card games, and are great for use with spatial Personas on FaceTime. And enterprise-specific APIs that will enable powerful use cases like surgical training in healthcare, equipment maintenance in manufacturing, and beyond. These new APIs and frameworks will unlock exciting opportunities for developers to create truly unique experiences. We're also making it easier for people to create new spatial content for Apple Vision Pro, like spatial video. We've made it so easy to capture spatial video anywhere with iPhone 15 Pro and iPhone 15 Pro Max.\n\nIt's one of the best ways to relive meaningful moments in your life.\n\nSpatial video can also be used by pro videographers to tell powerful brand, product, and creative stories. To make creating and sharing spatial videos with commercial audiences easier, Canon will offer a brand-new spatial lens for their popular EOS R7 digital camera. It can record gorgeous spatial video for Apple Vision Pro, even under the most challenging lighting conditions. Spatial videos can then be edited in Final Cut Pro for Mac and shared and viewed in the new Vimeo app for visionOS. This new professional workflow will be available this fall. Last year, we also introduced Apple Immersive Video, a game-changing entertainment format created just for Vision Pro. Apple Immersive Videos are 180-degree, 8K recordings with Spatial Audio that give you mind-blowing experiences with lifelike fidelity. It truly feels like you are there.\n\nTo enable creators to bring their own stories to life with Apple Immersive Video, we've partnered first with Blackmagic Design, a leading innovator in creative video technology, to build a new production workflow consisting of Blackmagic cameras, DaVinci Resolve Studio, and Apple Compressor. These will all be available to creators later this year. And there's new Apple Immersive Video content on the way, including a new extreme sports series with Red Bull, reimagined experiences from the world's biggest artists like The Weeknd, and our first scripted Apple Immersive short film, \"Submerged,\" from Oscar-winning director Edward Berger. These titles and more will be available on the TV app. So that's what's coming to Apple Vision Pro and visionOS. visionOS 2 introduces a new way to turn your favorite photos into spatial photos, new intuitive gestures, a big boost to productivity with Mac Virtual Display, powerful new developer APIs, and so much more. Now, back to Tim. Tim: As you can see, we're continuing to push visionOS forward as well as providing new content and capabilities for Apple Vision Pro. I've been hearing from people all over the world about their interest in this incredible product. So I'm happy to announce we're bringing Apple Vision Pro to these eight countries next, starting with China, Japan, and Singapore on June 28. And Australia, Canada, France, Germany, and the United Kingdom on July 12. Now, here's Craig to tell you all about what's coming in iOS. ♪ ♪ Craig: iOS 18 is a big release that delivers more ways to customize your iPhone, stay connected, and relive special moments. First, let's talk about a set of features that give you exciting new ways to personalize your iPhone further, starting with your Home Screen. You can already customize your Home Screen with your favorite wallpaper, apps, and widgets, letting your personality shine through. And now, your app icons and widgets can add even more. Let me show you. I have this photo I love as my wallpaper. And now I can continue to enjoy it when I unlock my iPhone, because I can arrange my apps and widgets to frame it perfectly. I can select them all and easily place them along the bottom, right above the Dock for easy access, or even off to the side. And check this out! We have an awesome new look for app icons when we go into Dark Mode. Let's turn it on. Isn't that cool? Now, in addition to this new dark look, there are even more new ways to adjust how they look. I can bring up a new customization sheet, and now I can tint them all with color. iOS suggests a tint color that complements my wallpaper. Or I can select any other color I want.\n\nNow they really pop. It's so easy to create just the right look. Whether you prefer the classic look, or want to go dark, or style with color, there are so many possibilities to make your Home Screen truly your own. We're also bringing new levels of customization and capability to Control Center, helping you access many of the things you do every day even faster. Let's take a look. When I swipe from the top-right corner, I can see Control Center, with all my controls organized in one place. And now Control Center isn't limited to just the controls you see here. I can swipe to multiple new groups of controls, like for Media Playback. You can see how beautiful this looks. And here are my Home Controls. It's so useful to have everything arranged for me like this. Oh, that shouldn't be open. Let me close the garage.\n\nAnd what's really great is, I can get to any one of these groups with a single, continuous swipe. I can get straight to my Home Controls, for instance, or right back up to the top. To add more controls, I can open up the new Controls Gallery, where I have so many options to choose from. We wanted to make Control Center more extensible than ever. So now, developers can include controls from their apps as well! Like this one from Ford. Let's add that in. I can adjust how my controls are laid out and resize them too. Now I can cool down the car just like that. So that's the new Control Center! To enable new controls in Control Center, we have a new Controls API for developers. And that's not all. These new controls are also available from the Lock Screen, so you can swap the camera and flashlight for different controls, like taking a note when an idea strikes, or quickly capturing the moment for your Snapchat. And you can even use the Action button on iPhone 15 Pro to invoke these new controls. Another key part of personalizing iOS is about keeping you in control of your privacy. And iOS 18 gives you even more ways to control who can see your apps, how you share your contacts, and how you connect to accessories. Let's start with apps. Sometimes we hand our device to someone so they can look at a photo or play a game, but we want peace of mind that they can't get into sensitive areas of our phone. So this year, we're giving you a new way to protect sensitive apps and the information inside them, by letting you lock an app. When you choose to lock an app, if someone else tries to tap it, they will be required to authenticate using Face ID, Touch ID, or your passcode. And information from inside the app won't appear in other places across the system, like in search and notifications, so others won't inadvertently see sensitive information. There may also be occasions when you want to hide an app that you don't want others to know is installed on your device. For example, say you use a professional grade spatial capture app to track your different hairstyles. I mean, that's just good science, right? Well, anyway, say you use this app, but you don't want anyone else to know. Well, now you can hide it and put it in a new hidden apps folder that's locked. We're also adding new ways to control how you share information with apps, starting with contacts. Today, when you give an app access to your contacts, it can learn about all the people you've added over time. In iOS 18, we're putting you in control by letting you decide which contacts an app can see. We're also putting you in control when you pair accessories. An app may ask for Bluetooth and local network access but also gain visibility to all the other devices on your network, from your computers and TVs to your door locks and blood pressure monitor. Now, developers can offer you an intuitive new way to pair your accessories that keeps your devices private and makes pairing seamless. Next up, we have big enhancements to the apps we use to stay connected, starting with Messages. To tell you more, here's Ronak.\n\nRonak Shah: Messages is central to how we communicate with the most important people in our lives, so in iOS 18, we're giving you all-new ways to express yourself and stay connected. Let's start with Tapbacks. Tapbacks are one of the most popular ways to express yourself in Messages. And people love them. This is a huge year for Tapbacks. We've not only redesigned your favorites. We're now giving you limitless ways to express yourself by letting you Tapback with any emoji or sticker. Next, we're bringing one of your most requested features to Messages. When you don't want to forget to send that friendly reminder or birthday text in the morning, you can schedule your message to Send Later. We're also giving you more ways to express your tone with text formatting. Bold, italicize, underline, or strike through any text. And when formatting is not enough, we're introducing a new way to visually amplify your messages with text effects! Whether you want to emphasize some major news, bring your emoji to life, or you're just blown away by a stunning photo, you can express yourself in all-new ways with text effects. Some words and phrases automatically surface a suggestion, so you can quickly select one and send it. And you can also add one of the many new effects to any text.\n\nLast, there's a new way to stay connected whenever you don't have Wi-Fi or cellular service. We're using the same groundbreaking technology that gave us Emergency SOS via satellite to bring you Messages via satellite. Now you can use the satellite capabilities on iPhone 14 and later to connect to satellites hundreds of miles above the Earth to text your friends and family when you're off the grid all right from the Messages app. Once you've connected, you'll be able to use key iMessage features like sending and receiving messages, emoji, and Tapbacks. Because iMessage was built to protect your privacy, iMessages sent over satellite are end-to-end encrypted. And if you need to text people not on iMessage, we're supporting SMS messaging via satellite too. Now, let's talk about another app we use to communicate, Mail. This year, we're giving you a new way to stay in control and manage incoming email with on-device categorization that organizes your messages and helps you stay up to date across all of your accounts. The Primary category enables you to focus on what matters most-- emails from people you know and time-sensitive messages. The rest of your email will be organized into new categories like Transactions, for receipts and order confirmations, Updates, for newsletters and social media notices, and Promotions, for marketing and sales messages. And these categories do more than just sort your email. We've also created an elegant new digest view that pulls together all the relevant emails you've received from a business to make interacting with these messages even easier. For instance, it can bring together all of your flight information from United, so you can get to it in one place. You can quickly scan snippets of each message to see what's new and explore what you're interested in. If you want a sender to appear in another category, you can recategorize them with just a few taps. Archiving or deleting all of the messages from a business is just as easy. And of course, you can always see all of your emails in one place. Categorization will be available later this year. And now, back to Craig. Craig: iOS 18 also includes some great updates to apps and features you use every day. Let's walk through a few of them, starting with Maps. Maps delivers new topographic maps with detailed trail networks and hiking routes, including all 63 U.S. national parks, that can be saved to your phone and accessed offline with turn-by-turn voice guidance and the ability to create your own hikes. Next, Wallet. Continuing on our journey to replace your physical wallet, we're introducing Tap to Cash, a quick and private way to exchange Apple Cash without sharing phone numbers or email addresses. With Tap to Cash, you can pay someone back for dinner just by holding your phones together. We're adding two new ways to pay with Apple Pay Online, giving customers around the world the ability to redeem rewards and access installments from their banks and card providers. And event tickets are getting a beautiful new design and new features, including an all-new event guide combining helpful information about the venue, with smart recommendations from your favorite Apple apps. We also have updates to Journal that let you log your state of mind and help you keep track of your goals with an insights view that shows your writing streaks, a calendar, and other fun stats. And you can now use Search to quickly find the past entries you're looking for. We're also excited to announce an update with great improvements for gamers. Game Mode is coming to iPhone, enabling a more immersive experience with games like \"Zenless Zone Zero.\" Just like on Mac, Game Mode minimizes background activity to sustain the highest frame rates, especially during long play sessions, and it dramatically improves responsiveness with AirPods and wireless game controllers. Finally, we have some big news for an app where we relive our most precious memories and adventures, Photos. Our photo libraries contain all of the big and small moments in our lives. But as we capture so much, and our libraries grow bigger by the day, how can we keep it all organized so we can appreciate all of those moments and easily get to the good stuff? iOS 18 brings the biggest redesign ever to the Photos app. To tell us more about the all-new design, here's Chelsea.\n\nChelsea Burnette: The new Photos app keeps your library organized and makes it super easy to find photos fast, so you can spend less time searching and more time enjoying your memories. Let me show you. This new design is gorgeous, feels familiar, and it puts everything you want right at your fingertips. The app has been unified into a single view, with the photo grid at the top, and your library organized by theme below. The photo grid is a great place to view your entire library. When you want to quickly jump back to specific dates, you can use Months and Years views at the bottom. I have a lot in my library, so it's great that this filter button lets me quickly narrow it down to specific types of content. And now I can even filter out screenshots, to enjoy my photos clutter-free. We know that it can be tough to keep our ever-growing libraries organized, so we've built on the amazing intelligence in the Photos app and created a space below the grid that makes it easy to access the photos you care about most. We call these Collections. With Collections, you can browse by topics like time, people, my favorite memories, new ones like Trips, and more. Let's go back and check out Recent Days. Recent Days organizes photos by each day with clutter, like receipts, filtered out. Here are my photos from earlier today. You'll see an autoplaying view of all the photos at the top. I can swipe between days like this to see my hike yesterday. I can view the photos as a beautiful collage, and I can share the whole Collection with just a tap right here. When I want to find a specific person in my library, I head to People & Pets. And it now includes my favorite groups of people for the first time! Here's me with my husband Don and with my best friends. The new Trips section gathers all your memorable adventures in one place. I love that they autoplay so I can remember my trips while I browse. I can quickly jump back in time and revisit a trip like this one to Patagonia in 2021. Since everyone's photo library is unique, Photos is now customizable so you can elevate the topics that are most important to you. You can reorder Collections to put them in the order you like. I've put Pinned Collections right here. It's where I can keep things I access frequently like Favorites, photos I've recently saved, the places I've been, and even an album of my favorite climbs. And we have one more new space to make the Photos app your very own and enjoy your best moments. If you swipe right from the grid, you'll find the new Carousel, which highlights your best content in a beautiful, poster-like view. Photos you've marked as Favorites are here, and so are Featured Photos surfaced by the app. And you can customize this too. Here, I've added a favorite trip to Crater Lake. Each day, the Carousel surprises you with a new set of photos to enjoy for each of these. And that's a quick peek at the new Photos app. Now, back to you, Craig! Craig: So that's iOS 18, a big release that brings deeper customization to iPhone, new ways to stay connected in Messages and Mail, enhancements to privacy, and the biggest Photos redesign ever, making it even easier to relive those special moments! And so much more, including an option for larger icons on the Home Screen, RCS messaging support, and Reminders integration in Calendar! Next, I'll hand it over to Ron to tell us the latest in Audio and Home. ♪ ♪ Ron Huang: Whether you're on the go, or at home, we have some great new features that bring more convenience to the things you do every day and elevate the entertainment experience for everything you watch. So let's start off with AirPods, which are the most loved headphones in the world with an incredible audio experience. This year, we're making it even easier to interact with Siri for a seamless hands-free experience. For those instances when you may not want to speak out loud in response to Siri, like on the bus to work or in those places that are a little too crowded, we've created the ability to simply nod your head \"yes\" or gently shake your head \"no\" to interact.\n\nSiri: Call from Gam Gam. Answer it? Okay. Ron: AirPods are also perfect for staying in touch with friends and colleagues, by taking calls anywhere, even in windy conditions or places with loud background noise. So to ensure your voice will sound crystal clear, no matter your environment, we're bringing Voice Isolation to AirPods Pro. Powered by advanced computational audio Voice Isolation removes the background noise around you, to deliver the best call quality. Siri: Call from David. Answer it? - Oh, hey. Was just about to call you. The meeting went so well. Also, sorry, it's really noisy. Can you hear me okay? - That's amazing news, and yeah. I can hear you totally fine. Ron: AirPods are also great while playing games, thanks to their exceptional audio quality. To level up this experience, we're expanding Personalized Spatial Audio to include gaming, so that you'll be in the middle of the action like never before. We've built a new API so game developers can easily deliver the most immersive listening experience. And we're excited to announce that \"Need for Speed Mobile\" by Tencent Games and EA will be one of the first titles with Personalized Spatial Audio coming this fall. Now let's turn to Home and tvOS.\n\nThis year, we're introducing some updates that make watching TV even more enjoyable. First, let's talk about those moments when we've all wondered, \"Where have I seen this actor before?\" or, \"Hey, what's that song?\" For these times, we have a new feature we're bringing to Apple TV+. It's called InSight. When you're watching an Apple Original show or movie, just swipe down on the remote and InSight will show the actors and their character names in real time. And if you're curious about the song playing, you can quickly see the track and add it to an Apple Music playlist to enjoy later. InSight will also be available when using iPhone as your remote, perfect for when you're watching with others. Next, let's turn to the audio experience on tvOS. We're bringing Enhance Dialogue to more living rooms, with support for TV speakers and receivers, along with AirPods and other Bluetooth devices. And Enhance Dialogue now uses machine learning for even greater vocal clarity, ensuring that the actors' dialogue will always cut through. - Go, go, go, go, go! - Rory, you are driving recklessly. - I'm in the middle of a high-speed car chase.\n\n- Rory, you're in crisis. - No, I'm not. The situation is a crisis. I'm fine. Ron: We're also making subtitles more convenient. With many of us turning to subtitles more often, they'll now appear at just the right times, like when you mute the volume or when you skip back.\n\nRon: Now let's talk visuals. Apple TV has always delivered a theater-like experience to the home. And this year, we're adding to the experience with support for 21 by 9 projectors! With 21 by 9, you'll be able to view widescreen movies exactly as the directors intended. And in between movies, you can enjoy amazing and visually interesting screen savers on Apple TV. We're making it even easier to choose what plays, including a brand-new Portraits category with stunning color effects and image segmentation, framing your photos like art in a gallery. Or switch to TV and Movies and enjoy moments from Apple TV+ shows you love like this one from \"Foundation.\" We're also adding one more really cool screen saver as Snoopy and Woodstock take over the screen. Whenever your Apple TV becomes idle, Snoopy springs to life with delightful animations. We're thrilled to bring everyone's favorite beagle to your living room! So that's Audio and Home, bringing you more convenient ways to interact with AirPods, new entertainment experiences with Apple TV, and there's more. Like a redesigned Apple Fitness+ experience that's perfect for the big screen. Next, here's David to tell you about watchOS. ♪ ♪ David Clark: My Apple Watch always motivates me to stay active. And this year will be no different. watchOS 11 introduces more great features to not only keep you active but also healthy and connected. To help you stay active, let's first take a look at an exciting new feature that can transform the way you work out, whether you are training for something like your first 5K or your fastest marathon. In watchOS 11, we're introducing Training Load, an insightful way to measure how the intensity and duration of your workouts are impacting your body over time. To track intensity, we designed a new way to rate your workouts. Using calorimetry data, like heart rate, pace, and elevation, plus your personal data, like age and weight, a powerful new algorithm automatically translates our sensor data into an estimate of your Effort rating. After your workout, you can review the rating on the Summary page, ranging from 1, easy, to 10, all out. And you can even adjust your Effort rating up or down to get it just right. Your Effort rating and workout duration are then used to calculate your Training Load. You'll be able to see if you're holding steady, above your average and can safely progress and improve, or when you're well above your average and should pay close attention to better avoid exhaustion or injury. We think Training Load will help enthusiasts and elite athletes get to the next level with data, insights, and motivation they need to make the best decisions about their training. And we've now made it even easier for everyone to gain more insights from the Fitness app on iPhone by giving you the ability to customize the Summary Tab to show the information you want to see, including new metrics like weekly running distance. The personalization even extends to your Activity rings where you can now adjust your goals by the day of the week. Or if you have an injury that's making it harder to close your rings, or maybe you just need a day off, you can pause them, for a rest day, week, or more and keep your award streak going! Those are some of the new ways watchOS11 will help keep you active. And now here's Sumbul to tell you about a new app that will give you a better picture of your health.\n\nDr. Sumbul Ahmad Desai: Understanding how your body responds and recovers from exercise and other aspects of your life is an important part of your overall health. Because Apple Watch can track key vitals while you sleep, like heart rate, respiratory rate, and wrist temperature, it can give you a deeper understanding of your body and help you identify when something might be off. So with watchOS 11, these metrics are the foundation of the insightful new Vitals app where you can check in on your daily health status, and explore your most important health metrics with just a glance. You can also see how your metrics relate to your typical range, which is determined from your own historical information and an algorithm developed using real-world data from the Apple Heart and Movement Study. For additional insights, your metrics will be highlighted when they are outside of your typical range with details on what's changed over the last week. And when multiple metrics are out of range, you will be notified with a tailored message to help you understand how these changes may be linked to other aspects of your life, such as alcohol, elevation changes, or even illness. And that's the Vitals app, a new way to quickly view your most important health metrics, receive alerts when it's time to pay more attention to your body, and gain better context when it comes to your health. Now let's talk about another time when context about your health matters, which is during pregnancy. Cycle Tracking can now show you gestational age to support you during this important time. The Health app will display your pregnancy across all charts and prompt you to review things like your high heart rate notification threshold, since heart rate often increases during pregnancy. Those are some of the advances in Health. And now back to David to tell you what's coming to keep you connected. David: With Apple Watch, you can have quick and meaningful interactions right on your wrist, making it so easy to stay connected to the world around you and the people you care about without always needing to take your iPhone out of your pocket. Whether it's using Apple Pay to buy your morning coffee or hop on the subway, telling Siri to add an item to your grocery list, or replying to a message from a friend, you can do it all with just the raise of a wrist. And last year, we introduced the Smart Stack. It's another way to keep you connected to important information with just a scroll of the digital crown. This year, it becomes even more intelligent by automatically adding new widgets right when you need them, like the precipitation widget to alert you before it rains, or the Translate widget for when you're traveling somewhere new. Just tap to open the new Translate app on Apple Watch, which uses machine learning models for speech recognition and translation. You can now simply dictate to see and hear it right on your wrist!  The Smart Stack also becomes more capable with Live Activities coming to Apple Watch, so you'll have all the details for your favorite events. And you can use features like Check In, which lets a friend know you made it back home safely and is now on Apple Watch with additional support for workouts. During a late-night run, your friend will know to keep an eye out, and will be updated when you end your workout so you both have peace of mind. Developers can also show Live Activities in the Smart Stack, so you can see updates in the moment like when your ride is coming for apps like Uber! And with the new Double Tap API, they can also define actions within apps, like Sprout Baby Tracker, to log your baby's time asleep without waking them! Having access to all of these powerful capabilities right on your wrist makes Apple Watch so indispensable, and being able to customize your watch face is one of the ways that makes it incredibly personal to you. With the popular Photos face, there is something special about seeing an important person or moment every time you raise your wrist. Now, watchOS 11 will help you find the perfect photos for your watch face. Machine learning intelligently identifies, scores, and curates the best photos based on facial expressions, aesthetics, and composition. Then, a custom algorithm elegantly frames the image with the time. You can select a bold color, choose monotone for a sleek look, or create something that is unique and personal to you. That's what's coming in watchOS 11: a redesigned Photos face, a more intelligent Smart Stack, Training Load, the Vitals app, new APIs for developers, and so much more, like turn-by-turn directions for walking and hiking routes you've created. We're so excited about all the new ways to help you stay connected, active, and healthy. Back to you, Craig. ♪ ♪ Craig: Next, let's talk about iPadOS, which powers our strongest lineup ever, including the incredibly thin and powerful iPad Pro and the redesigned iPad Air, now available in two sizes. Together with the latest versions of Final Cut Pro and Logic Pro and game-changing accessories like Apple Pencil Pro and Magic Keyboard, it creates an experience that's in a category of its own. Our next release, iPadOS 18, starts with features you saw in iOS, like new ways to personalize your Home Screen, customize Control Center, and relive special moments in the Photos app. iPadOS 18 also brings exciting new ways to get things done, reimagined with Apple Pencil, and a big update to apps designed for the distinct capabilities of iPad. Apps are fundamental to the iPad experience. In iPadOS 18, we're making them even better, starting with a new floating tab bar, which makes it easier to navigate to different parts of an app and keeps your content edge to edge in apps like Apple TV. When you want to explore more, the tab bar morphs into the sidebar. If you use a specific tab often, you can customize the tab bar to keep your favorites within easy reach. This redesigned experience works in apps across the system. We've also made it easier to browse your documents in apps like Pages, Keynote, Numbers, and Swift Playgrounds, giving each app a distinct new look. And throughout your experience, you'll discover refined animations. You'll notice them as you open files or preview them with Quick Look, and they smoothly zoom into view, or when the tab bar elegantly morphs into the sidebar and back. Across apps, animations will feel even more responsive. And for developers, all these new elements are available as APIs to adopt in your apps too. Now let's take a look at updates to SharePlay and Freeform. One of SharePlay's best features is screen sharing! It's a great way to help friends and family from afar, and we're making it better in two ways. Now you can tap and draw on your screen to point out what they should do on theirs. And if you need to assist more directly, you can ask for permission to remotely control their iPad or iPhone.\n\n- Hope that helps. Craig: And Freeform adds Scenes, an all-new way to select sections of a board to present them one by one. Next, I want to talk about a feat that some may have concluded must be a mathematical impossibility. That's right, we're bringing Calculator to iPad. By leveraging what makes iPad so unique, it makes solving math easier than ever. It starts with the Calculator that you know from iPhone, updated to take advantage of the larger iPad display, along with some new tricks like history and unit conversions. But the real magic of Calculator on iPad is unlocked when you use it with your Apple Pencil, an iPad superpower. Apple Pencil has changed the way you can take notes, draw, and even design with iPad. And now, it's changing the way you do math with a feature we call Math Notes. Let's see it in action with Jenny. Jenny Chen: I'm so excited to show you the new Math Notes experience. I get to it by just tapping the new calculator button right here. And with my Apple Pencil, I'll just start writing out expressions like I would on a piece of paper. As soon as I write an equals sign, Calculator immediately solves it for me! And even shows me the result in handwriting like my own! When I make a change, the results update live. And I can go beyond basic math with all of the same functions from the scientific calculator. I can save my Math Notes and come back to them later if I'm working on different things. Like here, where I'm working on a budget for my team's upcoming table tennis tournament. Since I'm in Math Notes, I can sum these costs quickly by just drawing a line underneath them. It's so natural. Math Notes are also really powerful when it comes to more complex math. Here, I have a physics problem my teammate and I are working on. We're calculating the maximum height of a table tennis ball when I hit it with different speeds and angles. Math Notes supports variables, so I've declared a few here, and there's an expression below, which uses these variables to help me calculate the height. What's powerful about variables is that if I change one, like the velocity of my shot, it will change the related results too. And if I want to see how this speed impacts the height visually, I can. I'll just put \"y equals\" in front of this equation. And now when I tap the equals sign, I have an option to create a graph. And if I'm curious how the height will be impacted by the angle of my shot, I can hover my Pencil over the angle and adjust it to see how it affects my graph in real time. It's an easy way to explore equations in math. And that's just a quick look at Math Notes in Calculator. Back to you, Craig. Craig: Math Notes are perfect for working through a problem set, or just tackling the math we run into day to day. And this all works in Notes too. When you need to crunch numbers, Notes has all of the new math capabilities from Calculator. Just as we've reimagined math on iPad, we've also reimagined handwriting in Notes with a new feature called Smart Script. Notes already has great handwriting features, like the ability to select and copy your writing, or even make it straighter. With Smart Script, we're making handwriting your notes smoother than ever. It starts with improving the appearance of your writing, as you write. We use a powerful on-device machine learning model to re-create your handwriting style from your notes, which unlocks new capabilities. Just scribble your thoughts as fast as you have them and Smart Script refines your handwriting as you go. It's still your own writing, but it looks smoother, straighter, and more legible. Smart Script further accelerates your writing flow by making handwriting just as flexible as typed text. Now you can just paste typed text into a handwritten note, and it will appear in your own style. Spell check works just as you would expect and fixes mistakes inline. When you decide you need to add to something you've already written, just tap and hold with your Apple Pencil and your text will flow out of the way to create more space. If you want to erase something you can just scratch it out. Smart Script makes your handwritten notes more effective, fluid, and easier to read. And with other enhancements to typed notes, including collapsible sections, it's never been a better time to be a notetaker! And that's iPadOS 18, taking the distinct experience of iPad further with a big update to apps that makes navigating easier and more responsive, and new ways to work that have been reimagined with Apple Pencil. Next, let's talk about macOS. ♪ ♪ The all-star combination of the power of Apple silicon and the legendary ease of use of macOS have made the Mac more capable than ever. And we're so excited to take macOS to new heights and embark on the next chapter of our journey of productivity and creativity! But what should we call it? Well, that brings us once again to the annual escapades of our legendary crack marketing team. Distracted briefly from their marathon hacky sack session, they stumbled into their minibus and wove a trail toward the Sierras, eventually rolling to a stop in a beautiful national park. Staring skyward up the towering trunks surrounding them, they felt a deep kinship with anything that could get that high. They knew they'd found their spot. Welcome to macOS Sequoia. The incredible features we talked about in iOS 18 and iPadOS 18 are going to be amazing for the ways you use Mac. You can be even more expressive in Messages, Math Notes provide a helpful typed experience, and you can easily plan a hike in Maps. These new features are terrific on the Mac, and macOS Sequoia introduces even more features to help you effortlessly get things done. Let's start with Continuity. Continuity helps you do so much more when you use Apple products together. It powers some of your favorite features, like Universal Clipboard, Universal Control, and Mac Virtual Display on Apple Vision Pro. And macOS Sequoia makes Continuity even more magical. For all those times when we want to use our iPhone, only to realize it's tucked away in a bag over in another room, there's a brand-new Continuity feature called iPhone Mirroring. With iPhone Mirroring on Mac, I can see what's on my iPhone, and can control it too, all while barely lifting a finger. Let me show you how it works. To access my phone, I just click here in my Dock. Boom! And there's my iPhone, mirrored in a window right on my Mac. I can fully interact with it, all wirelessly. I can see my custom wallpaper. My icons are right where they belong. And I can use my phone normally, like swiping through pages of my Home Screen. And I can open any of my iPhone apps, like the Philz Coffee app, for a bit of extra energy from my favorite local coffee shop. I can use my Mac trackpad to interact with the app. And I can use my Mac keyboard too, like to add special instructions.\n\nLet's make this ice-cold.\n\nTo make this even more magical, we're bringing iPhone notifications to Mac. They appear alongside my Mac notifications and I can even interact with them when I don't have my iPhone handy. Here's one from Duolingo. What's neat is, when I click on it, bam! I'm taken right into the Duolingo app on my iPhone, so I can practice my Spanish and extend my streak.\n\nAs you can hear, my iPhone's audio even comes through my Mac.\n\nSo you might be wondering what's on my iPhone screen while I'm using iPhone Mirroring.\n\nIt stays locked, so nobody else can access it. And it works seamlessly with StandBy. StandBy stays visible, so I can get information at a glance as I use my phone with iPhone Mirroring. And iPhone Mirroring makes it effortless to combine the power of my Mac and the convenience of its big screen, with the things I get done on my iPhone. I'm using a template in the Unfold app to make a post, and I've got one last video to add. On Mac, I've been using Final Cut Pro to stitch some clips together.\n\nWatch how easy it is to use my devices together. I can grab the exported video and just drop it right into the template.\n\nPerfect! So that's iPhone Mirroring! And macOS Sequoia has fantastic updates to how you arrange your windows, share while video conferencing, and organize your passwords. Now, when you drag a window to the edge of the screen, macOS automatically suggests a tiled position on your desktop. You can release your window right into place. Quickly place tiles side by side, or place them into corners to keep even more apps in your view. And new keyboard and menu shortcuts help you arrange your tiles even faster. Now, let's talk about video conferencing. When you're on a video call, say goodbye to oversharing with the new presenter preview. It lets you see what you're about to share before you share it, and works with apps like FaceTime and Zoom. And when you want to express yourself or just hide the laundry behind you, you can now replace your background with some beautiful built-in backgrounds, or your own photos! Background replacements use Apple's industry-leading segmentation so you look your best while on a call. Now let's talk about how we're building on the foundation of Keychain to help you manage your passwords. For over 25 years, we've been adding features to make logging in to your accounts easier. And now, we're introducing the Passwords app. Passwords makes it easy to access your credentials and have them securely stored, all in one place. Everything is organized for you, from your passwords to verification codes to security alerts. You can find the app on Mac, iPad, iPhone, Vision Pro, and on Windows, with the iCloud for Windows app. All the passwords securely sync across your devices, and if you use AutoFill, your passwords will automatically populate in the Passwords app. Now, here's Beth to tell you about Safari.\n\nBeth Dakin: Safari offers an experience like no other browser on Mac. In macOS Sequoia, Safari is the world's fastest browser, enabling you to fly through the web with lightning speed. And it offers up to four hours more battery life than Chrome when streaming video. Safari is also a trailblazer in privacy, with industry-leading Intelligent Tracking Prevention and private browsing that's actually private. It not only protects your history, it prevents websites from seeing what you do while you browse. And it's built on WebKit, which supports the latest exciting web technologies and standards. If you missed anything we've added to Safari in the last few years, it's time to check it out! Safari has everything you need to feel at home, like profiles, translation, and more. And in this release, we're making it even better, with easier ways to discover content and streamline your browsing. When you're on a site, Safari can now help you discover more about the page with Highlights. Safari uses machine learning to automatically detect relevant information and highlight it for you as you browse. Highlights share helpful information, like directions, summaries, and quick links to learn more about people, music, movies, and TV shows. So if you're planning a trip, you can effortlessly discover a hotel's location and phone number right there. You can listen to an artist's music or check out a new show with just a click. And even get a summary, so you can get the gist before reading on. Summaries are also integrated into a redesigned Reader. Reader instantly removes distractions from articles, and now it can provide a table of contents and includes a helpful summary, right next to the article. We're bringing a distraction-free experience to video on the web as well with Viewer. When Safari detects a video on the page, Viewer helps you put it front and center, while still giving you full access to system playback controls, like AirPlay and Picture-in-Picture, and video automatically moves into Picture-in-Picture if you click away. That's a quick look at what's new in Safari. Back to you, Craig. Craig: Let's talk about gaming. We're so excited to see more and more game developers embracing the Mac with great games like these, including the most recent game of the year, \"Baldur's Gate 3,\" all leveraging Metal 3 to deliver smooth frame rates, provide high-quality visuals, and take full advantage of Apple silicon. Every Mac in the lineup can play today's most cutting-edge games, like \"Death Stranding: Director's Cut.\" And so can iPhone 15 Pro and any iPad with an M-series chip. And for developers, this creates a unified gaming platform across iPhone, iPad, and Mac, spanning well over a hundred million devices and growing rapidly. These devices are capable of playing an entirely new class of games! And with iOS 18, iPadOS 18, and macOS Sequoia, we continue to deliver features for an even more immersive gaming experience. And since the introduction of Game Porting Toolkit, developers have been able to bring their games to Apple devices faster than ever, and gaming enthusiasts can experience more games on the Mac. And this year, Game Porting Toolkit 2 takes this to the next level, enabling developers to bring even more advanced games to Mac, with improved Windows compatibility and shader debugging tools. And it's much easier to bring Mac games to iPad and iPhone with Xcode support that lets developers unify their game code and shaders across devices. And for players, there's a lot to look forward to. And that's more games. Like \"Frostpunk 2,\" coming to Mac next month. \"Control,\" providing a mind-bending story that just looks incredible with ray tracing. And there's some exciting news from Ubisoft, the developers that released \"Assassin's Creed: Mirage\" on iPhone and iPad just a few days ago. To tell you more about what's to come from Ubisoft, here's Marc-Alexis.\n\nMarc-Alexis Côté: At Ubisoft, our mission is to enrich players' lives by creating original and memorable gaming experiences. We see a huge opportunity to share our passion for games to more players in the Apple ecosystem thanks to the unified gaming platform with tight integration of Metal and Apple silicon. Just last month, we announced that \"Prince of Persia: The Lost Crown\" is coming to Mac, and we unveiled that the next big chapter of \"Assassin's Creed\" is also coming to Mac on November 15 alongside PCs and consoles. We're so excited about this game and can't wait for you to experience it on Mac. This is \"Assassin's Creed: Shadows\"! We're venturing into feudal Japan, which you can experience from the perspectives of Naoe, a Shinobi assassin, and Yasuke, a legendary samurai of African origin. Intricately detailed scenes like this are possible thanks to our next-generation Anvil engine supporting the latest advancements in Metal, enabling us to leverage the full power of Apple silicon with a gaming experience that delivers blistering frame rates and high resolutions. Our next-generation Anvil engine scales performance and quality across the Mac lineup and delivers stunning vistas embellished with ray tracing. And speaking of Apple Silicon, we're thrilled to announce that in addition to Mac, \"Assassin's Creed: Shadows\" will also be coming to iPad! With Ubisoft's Anvil Engine now supporting the Apple ecosystem, we couldn't be more excited about bringing our biggest titles to Apple devices. Download and play \"Assassin's Creed: Mirage\" today. And \"Assassin's Creed: Shadows\" will be available later this year! Thank you! Craig: Thanks, Marc-Alexis. We're so excited about these amazing games coming to Apple devices. And this year, even more games are on the way, creating a stellar lineup of titles to look forward to! So that's gaming, which wraps up macOS Sequoia. It's a big release that up-levels your productivity and creativity. You can quickly tile windows for your ideal workspace. A massive update to Safari helps you browse the web distraction-free. An amazing host of new gaming titles are coming to the Mac. And iPhone Mirroring lets you wirelessly use your iPhone, right from your Mac. macOS joins the announcements across our platforms. And this is a huge year for developers, with brilliant new features and APIs coming so they can supercharge their apps and experiences. Developer betas will be available today. Public betas will be available next month. And all of our OS releases will be available to users this fall. Back to Tim! ♪ ♪ Tim: At Apple, it's always been our goal to design powerful personal products that enrich people's lives by enabling them to do the things that matter most, as simply and easily as possible. We've been using artificial intelligence and machine learning for years to help us further that goal. Recent developments in generative intelligence and large language models offer powerful capabilities that provide the opportunity to take the experience of using Apple products to new heights. So as we look to build in these incredible new capabilities, we want to ensure that the outcome reflects the principles at the core of our products. It has to be powerful enough to help with the things that matter most to you. It has to be intuitive and easy to use. It has to be deeply integrated into your product experiences. Most importantly, it has to understand you and be grounded in your personal context, like your routine, your relationships, your communications, and more. And, of course, it has to be built with privacy from the ground up. Together, all of this goes beyond artificial intelligence. It's personal intelligence, and it's the next big step for Apple.\n\n♪ ♪ ♪ ♪ Introducing Apple Intelligence, the new personal intelligence system that makes your most personal products even more useful and delightful. To tell you all about it, here's Craig. ♪ ♪ Craig: This is a moment we've been working towards for a long time. We are tremendously excited about the power of generative models. And there are already some really impressive chat tools out there that perform a vast array of tasks using world knowledge. But these tools know very little about you or your needs. With iOS 18, iPadOS 18, and macOS Sequoia, we are embarking on a new journey to bring you intelligence that understands you. Apple Intelligence is the personal intelligence system that puts powerful generative models right at the core of your iPhone, iPad, and Mac. It draws on your personal context to give you intelligence that's most helpful and relevant for you. It protects your privacy at every step. And it is deeply integrated into our platforms and throughout the apps you rely on to communicate, work, and express yourself. Let's take a closer look at Apple Intelligence starting with its incredible capabilities. Then, we'll tell you about its unique architecture. And after that, we'll show you how it elevates so many of your everyday experiences. Let's begin with capabilities. Apple Intelligence will enable your iPhone, iPad, and Mac to understand and create language, as well as images, and take action for you to simplify interactions across your apps. And what's truly unique is its understanding of your personal context. Language and text are fundamental to how we communicate and work. And the large language models built into Apple Intelligence deliver deep natural language understanding, making so many of your day-to-day tasks faster and easier. For example, your iPhone can prioritize your notifications to minimize unnecessary distractions, while ensuring you don't miss something important. Apple Intelligence also powers brand-new Writing Tools that you can access systemwide to feel more confident in your writing. Writing Tools can rewrite, proofread, and summarize text for you, whether you are working on an article or blog post, condensing ideas to share with your classmates, or looking over a review before you post it online. And they are available automatically across Mail, Notes, Safari, Pages, Keynote, and even your third-party apps. In addition to language, Apple Intelligence offers a host of capabilities for images. From photos, to emojis, and GIFs, it's so much fun to express ourselves visually. And now you can create totally original images to make everyday conversations even more enjoyable. And because Apple Intelligence understands the people in your photo library, you can personalize these images for your conversations. So when you wish a friend a happy birthday, you can create an image of them surrounded by cake, balloons, and flowers to make it extra festive. And the next time you tell Mom that she's your hero, you can send an image of her in a superhero cape to really land your point. You can create images in three unique styles: Sketch, Illustration, and Animation. In addition to Messages, this experience is built into apps throughout the system, like Notes, Freeform, Keynote, and Pages. Another way Apple Intelligence is deeply impactful is its ability to take action across your apps. The greatest source of tools for taking actions is already in your pocket with the apps you use every day. And we have designed Apple Intelligence so it can tap into these tools and carry out tasks on your behalf. So you can say things like, \"Pull up the files that Joz shared with me last week,\" or, \"Show me all the photos of Mom, Olivia, and me,\" or, \"Play the podcast that my wife sent the other day.\" We are designing Apple Intelligence to be able to orchestrate these and hundreds of other actions for you, so you can accomplish more while saving time. There's one more critical building block for personal intelligence, and that's an understanding of your personal context. Apple Intelligence is grounded in your personal information and context with the ability to retrieve and analyze the most relevant data from across your apps, as well as to reference the content on your screen, like an email or calendar event you are looking at. This can be incredibly useful in so many moments throughout the day. Suppose one of my meetings is being re-scheduled for late in the afternoon, and I'm wondering if it's going to prevent me from getting to my daughter's play performance on time. Apple Intelligence can process the relevant personal data to assist me. It can understand who my daughter is, the play details she sent several days ago, the time and location for my meeting, and predicted traffic between my office and the theater. Understanding this kind of personal context is essential for delivering truly helpful intelligence. But it has to be done right. You should not have to hand over all the details of your life to be warehoused and analyzed in someone's AI cloud. With Apple Intelligence, powerful intelligence goes hand in hand with powerful privacy. Let me tell you more about its architecture, and how it is built with privacy at the core. The cornerstone of the personal intelligence system is on-device processing. We have integrated it deep into your iPhone, iPad, and Mac and throughout your apps, so it's aware of your personal data, without collecting your personal data. This is only possible through our unique integration of hardware and software, and our years-long investment in building advanced silicon for on-device intelligence. Deeply-integrated generative models require immense processing power. And with our most advanced Apple silicon, the A17 Pro and M-family of chips, we have the computational foundation to power Apple Intelligence. This personal intelligence system is comprised of highly-capable large language and diffusion models that are specialized for your everyday tasks, and can adapt on the fly to your current activity. It also includes an on-device semantic index that can organize and surface information from across your apps. When you make a request, Apple Intelligence uses its semantic index to identify the relevant personal data, and feeds it to the generative models so they have the personal context to best assist you. Many of these models run entirely on-device. There are times, though, when you need models that are larger than what fits in your pocket today. Servers can help with this. But traditionally, servers can also store your data without you realizing it, and use it in ways you did not intend. And since server software is only accessible to its owners, even if a company says it's not misusing your data, you are unable to verify their claim, or if it changes over time. In contrast, when you use an Apple device like your iPhone, you are in control of your data, where it is stored, and who can access it. And because the software image for your iPhone is accessible to independent experts, they can continuously verify its privacy. We want to extend the privacy and security of your iPhone into the cloud to unlock even more intelligence for you. So we have created Private Cloud Compute. Private Cloud Compute allows Apple Intelligence to flex and scale its computational capacity, and draw on even larger, server-based models for more complex requests, while protecting your privacy. These models run on servers we have especially created using Apple silicon. These Apple silicon servers offer the privacy and security of your iPhone from the silicon on up, draw on the security properties of the Swift programming language, and run software with transparency built in. When you make a request, Apple Intelligence analyzes whether it can be processed on-device. If it needs greater computational capacity, it can draw on Private Cloud Compute, and send only the data that's relevant to your task to be processed on Apple silicon servers. Your data is never stored or made accessible to Apple. It's used exclusively to fulfill your request. And just like your iPhone, independent experts can inspect the code that runs on these servers to verify this privacy promise. In fact, Private Cloud Compute cryptographically ensures your iPhone, iPad, and Mac will refuse to talk to a server unless its software has been publicly logged for inspection. This sets a brand-new standard for privacy in AI, and unlocks intelligence you can trust. So that's a look at the powerful capabilities of Apple Intelligence and its groundbreaking privacy protections. Now we'd love to show you how it will transform your apps and experiences across iOS 18, iPadOS 18, and macOS Sequoia, from a big leap forward for Siri, to powerful tools for writing and communication, and fun visual ways to express yourself. Let's start with Siri. Here's Kelsey to tell you more.\n\nKelsey Peterson: Today, Siri helps you get everyday tasks done quickly and easily. In fact, Siri users make 1.5 billion voice requests every single day. Thirteen years ago, we introduced Siri. The original intelligent assistant. And we had an ambitious vision for it. We've been steadily building towards that vision. And now, thanks to the incredible power of Apple Intelligence, we have the foundational capabilities to take a major step forward. So we can make Siri more natural, more contextually relevant, and of course, more personal to you. Right off the bat, you'll see Siri's got a new look. Let me show you. When you talk to Siri, you'll notice it's more deeply integrated into the system experience, with this elegant glowing light that wraps around the edge of your screen. And you can speak to Siri more naturally thanks to richer language understanding capabilities. Even if I stumble over my words, Siri understands what I'm getting at. What does the weather look like for tomorrow at Muir Beach? Oh, wait, I meant Muir Woods! Siri: The forecast is calling for clear skies in the morning near Muir Woods National Monument. Kelsey: Sometimes it takes me a beat to figure out what I actually want to ask Siri, and now it follows right along. Siri also maintains conversational context, so I can follow up and say, \"Create an event for a hike there tomorrow at 9:00 a.m.\" Siri: Hike is scheduled for 9:00 a.m. to 11:00 a.m. on June 11. Kelsey: I didn't have to mention Muir Woods again. Siri understood what I meant when I said \"there.\" There are also certain times when you might not want to speak to Siri out loud. What's great is that now, at any time, you have the option to type to Siri. With just a double tap at the bottom of the screen, I can quickly and quietly ask Siri to set an alarm.\n\nAnd you can switch between text and voice, communicating in whatever way feels right for the moment. We're also laying the groundwork for some brand-new ways that Siri will be able to support you, one of which is its extensive product knowledge. Siri now holds a great deal of information about features and settings and can answer thousands of questions when you want to know how to do something on your iPhone, iPad, or Mac. Even if you don't know exactly what a feature is called, you can just describe it and Siri will find the info you're looking for. Like this: \"How can I write a message now and have it be delivered tomorrow?\" Siri understood what feature I was referring to, and now I have step-by-step guidance on how to use the new Send Later feature in Messages. Everything I've showed you so far will be available from the moment you start using Apple Intelligence. And over the course of the next year, we will be rolling out more features that make Siri even more personal and capable. For one, Apple Intelligence will provide Siri with on-screen awareness, so it'll be able to understand and take action with things on your screen. For example, say a friend texts you his new address. Right from the Messages thread, you can say, \"Add this address to his contact card,\" and Siri will take care of it. Siri will also understand more of the things you get done in your apps. And with new orchestration capabilities provided by Apple Intelligence, Siri will take actions inside apps on your behalf. Siri will have the ability to take hundreds of new actions in and across apps, including some that leverage our new writing and image generation capabilities. For example, you'll be able to say, \"Show me my photos of Stacey in New York wearing her pink coat,\" and Siri will bring those right up. Then you might say, \"Make this photo pop,\" and Siri will enhance it, just like that. And Siri will be able to take actions across apps, so you could say, \"Add this to my note with Stacey's bio,\" and it will jump from the Photos app to the Notes app to make it happen. This is going to bring us closer to realizing our vision in which Siri moves through the system in concert with you. This is made possible through significant enhancements that we are making to App Intents, a framework that lets apps define a set of actions for Siri, Shortcuts, and other system experiences. And this won't be limited to apps made by Apple. For developers, they'll be able to use the App Intents framework to define actions in their apps and tap into Apple Intelligence too. So you might ask Siri to take a light trails video in Pro Camera by Moment. Or ask Siri to share a summary of your meeting notes in an email you're drafting to a teammate in Superhuman. And this is only the beginning. Siri will be able to understand and take more actions in more apps over time. There's one more set of really cool and useful capabilities coming to Siri. Thanks to Apple Intelligence, it has awareness of your personal context. With its semantic index of things like photos, calendar events, and files, plus information that's stashed in passing messages and emails, like hotel bookings, PDFs of concert tickets, and links that your friends have shared, Siri will find and understand things it never could before. And with the powerful privacy protections of Apple Intelligence, Siri will use this information to help you get things done without compromising your privacy. You'll be able to ask Siri to find something when you can't remember if it was in an email, a text, or a shared note, like some book recommendations that a friend sent you a while back. Or for times when you're filling out a form and need to input your driver's license, Siri will be able to find a photo of your license, extract your ID number, and type it into the form for you. I want to show you one more demo that will give you a sense for how powerful Siri will be when it draws on the personal context awareness and action capabilities built into Apple Intelligence. Imagine that I am planning to pick my mom up from the airport, and I'm trying to figure out my timing. Siri is going to be able to help me do this so easily. Siri, when is my mom's flight landing? What's awesome is that Siri actually cross-references flight details that my mom shared with me by email with real-time flight tracking to give me her up-to-date arrival time. What's our lunch plan? I don't always remember to add things to my calendar, and so I love that Siri can help me keep track of plans that I've made in casual conversation, like this lunch reservation my mom mentioned in a text. How long will it take us to get there from the airport? I haven't had to jump from Mail to Messages to Maps to figure out this plan. And a set of tasks that would have taken minutes on my own and honestly probably would have resulted in a call to my Mom could be addressed in a matter of seconds. That's just a glimpse of the ways in which Siri is going to become more powerful and more personal thanks to Apple Intelligence. And all of these updates to Siri are also coming to iPad and Mac, where Siri's new design is a total game-changer. It makes Siri feel seamlessly integrated with your workflow. Thanks to the capabilities of Apple Intelligence, this year marks the start of a new era for Siri. Here's Justin to show you more places throughout the system where Apple Intelligence simplifies and accelerates your tasks.\n\nJustin Titi: Apple Intelligence unlocks incredible new ways to enhance your writing, whether you are tidying up your hastily-written class notes, ensuring your blog post reads just right on Wordpress, or making sure your email is perfectly crafted. Let's use Mail to take a closer look at how the systemwide Writing Tools can help you communicate even more effectively. Rewrite gives you different versions of what you have written, so you can choose the one you like best.\n\nThis is great for making sure your cover letter for that job you're excited for lands perfectly. And suggestions are shown inline, so you can go with the combination of flow and wording that works for you. Rewrite also helps you get the tone right. Have you ever re-read a work email that you just wrote and thought, \"Oh, this might not go over well\"? Well, now you can change the tone of that response to your colleague to make it sound more friendly, professional, or concise. You can also describe how you'd like it rewritten. For example, you can invite your friends to a get-together with a one-of-a-kind invitation written as a poem. Who could say no to that? Another way Writing Tools can help you is with Proofread. Say you're emailing your English professor. With Proofread, you can nail grammar, word choice, and sentence structure to put your best foot forward. You can review suggested edits and their explanations individually, or accept them all with a click. And if you are about to email a project status that has gotten quite long, use Summarize to bring out the key points, and then add them as a TL;DR right at the top. In addition to Mail, you can access Writing Tools systemwide, nearly everywhere you write, including third-party apps. Apple Intelligence also powers Smart Reply in Mail. For example, when you need to RSVP to an event, you will now see suggestions for your response based on the email. If you say you'll be there, Mail identifies questions you were asked in the invite, and offers intelligent selections so you can quickly choose your responses. Your drafted response incorporates your answers. So with just a few taps, you're ready to send it off with all the right details. Finally, let's talk about how Apple Intelligence helps you stay on top of a busy inbox. We all deal with sorting through a ton of email every day. And now it is easier and faster than ever to browse your inbox. Instead of previewing the first few lines of each email that don't always convey the most useful information, you can now see summaries, visible right from your email list. So without even opening the email, you'll know that your team is meeting on Thursday to discuss a new design. And if you jump into a particularly long email when you're in a hurry, you can tap to reveal a summary at the top of the email and cut right to the chase. We're also elevating Priority Messages. Apple Intelligence can understand the content of the emails you receive, determine what's most urgent, and surface it right at the top. Like a dinner invite for tonight, or a boarding pass for your trip this afternoon. And deep understanding of language extends beyond your inbox into more places, like your Notifications. First, just like in Mail, your Priority Notifications appear at the top of the stack, letting you know what to pay attention to at a glance. And to make scanning your notifications faster, they're summarized. So when the group chat is blowing up, you can quickly see that Savita booked the house and Lia is arriving early, right from your Lock Screen. Apple Intelligence also enables an all-new Focus called Reduce Interruptions. It understands the content of your notifications to selectively surface only the ones that might need immediate attention, like a text about today's daycare pickup. From catching up on Priority Notifications, to staying present and focused with Reduce Interruptions, and refining your words with Writing Tools, Apple Intelligence helps you save time in so many ways. Now, over to Cyrus to show you how it unlocks new ways to express yourself.\n\nCyrus Irani: Apple Intelligence enables you to create fun, original images whether you are sprucing up a Keynote for class or trying to land an idea while collaborating in Freeform. And third-party apps can offer this experience too, like in Craft, where you can create a delightful image to add to your document. Let's take a closer look at how Apple Intelligence helps you express yourself visually in Messages. One of the most fun ways to communicate in Messages is with emoji. But even with thousands of emoji to choose from, there are times when you can't quite find the right one for how you feel. So we're introducing Genmoji. Leveraging the power of Apple Intelligence, you can create Genmoji, on-device, right in the Keyboard, and match any moment perfectly. Just provide a description and you'll see your Genmoji appear right before your eyes, along with more options to choose from. This is great in those times when you're updating a friend about your relaxing weekend, getting the group chat excited about brunch, or complaining about the rowdy squirrel right outside your window. And because Apple Intelligence is aware of who's in your photo library, you can simply pick someone and create a Genmoji that looks just like them! These are perfect for sharing with friends as a sticker, reacting to messages with a Tapback, and you can even add Genmoji inline in your messages! Let your imagination run wild as you create just the right Genmoji! And because it's so much fun to use images to express ourselves, we went even further with a new system experience we call Image Playground. This is a new way to create playful images in just seconds. It's so easy to use, and we've built it right into apps like Messages. To get started, you can choose from a range of concepts like themes, costumes, accessories, places, and more. When you select them, they get added to your playground. No need to engineer the perfect prompt. In a few seconds, you'll see Apple Intelligence creates a preview of what your image could look like. A moment later, you'll see more previews you can swipe through. This all happens on-device! So you have the freedom to experiment and create as many images as you want. This is great for quickly responding to your friends with just the right image. When you have a really specific idea in mind, you can just type a description to add it to your playground.\n\nAnd you can easily adjust which style you want to use and choose from Animation, Sketch, or Illustration.\n\nWhichever suits the vibe of your conversation. If you change your mind along the way, no problem! Just switch back and you'll see your previous previews. It's that simple. Since Apple Intelligence understands your personal context, you'll see suggestions for concepts related to your Messages conversation, including you and people from your Messages thread. When selected, it uses appearances from Photos to add you, or one of them, to the image you're creating. ♪ ♪ With an intuitive experience to create totally original images, and so many ways to express what you want, the Image Playground is going to make everyday conversations a whole lot more fun. In addition to Messages, this experience is also available in apps like Keynote, Pages, and Freeform. To make it easy to experiment with creating images, we've also built a dedicated Image Playground app. You can use it to try out Styles, play around with different concepts, and make something to share with friends in other apps or on social media. And for Developers, they can integrate the new Image Playground experience in their app too, with a new API. With the Image Playground experience and Genmoji, you can create fun and delightful images right where you need them. Now, here's Seb to show you more experiences enabled by the powerful capabilities of Apple Intelligence.\n\nSebastien Marineau-Mes: With the ability to deeply understand and create images, Apple Intelligence unlocks some fantastic new experiences. Like a brand-new tool in the Notes app that we call Image Wand. Image Wand can transform a rough sketch into a polished image that complements your notes and makes them more visual. And it's available right in your tool palette. Suppose you want a better image for your architectural history course. With Image Wand, you can circle your rough sketch using Apple Pencil to open up an Image Playground within your note. Image Wand uses on-device intelligence to analyze your sketch and words and creates an image for you. What's really fun is that you can even circle empty space, and it will pull out context from the surrounding area to suggest the ideal image to go with your note. It has never been easier to make your notes more visual and engaging. Apple Intelligence also helps us make the most out of our ever-growing photo libraries. First, we have an update to photo editing. We've all had that time when we thought we got the perfect shot, then realized later it wasn't quite perfect. Now, the new Clean Up tool will identify distracting objects in the background, so you can make them disappear, without accidentally changing your subject. Plus, searching for photos and videos is much more convenient, because you can now use natural language phrases. So you can search for really specific things, like \"Maya skateboarding in a tie-dye shirt,\" or \"Katie with stickers on her face.\" Search in videos is also more powerful, with the ability to find a particular moment in the middle of a video clip. So you can go right to the relevant segment when you search for that video of Maria cartwheeling on the grass.\n\nApple Intelligence also makes it so much more delightful to create a Memory Movie. Today, when you want to use your photos and videos to create a movie yourself, like for your fishing trips with your kids, it can take hours of work. You have to search through tons of photos to pick out the best ones, figure out how to arrange them, and hunt for the right music. Now, thanks to Apple Intelligence, it is super easy to create a memory about the story you want to see. Just type a description, and it can interpret that \"learning to fish\" involves things like water, docks, fishing rods, and boats. Using its language and image understanding, Apple Intelligence picks out the best photos and videos. And then it crafts a storyline with unique chapters that are based on themes identified from your photos, and arranges them into a movie with its own narrative arc. So now I can watch a wonderful Memory that starts with my son practicing on the dock, transitions to fishing on the boat, and finishes with us holding the prize catch. And all of this is set to the perfect song selected from Apple Music. Like all of Apple Intelligence, these updates to Photos are built on a foundation of privacy, so your photos and videos are not shared with Apple, or anyone else. With endless possibilities, it is so much fun trying out different ideas and revisiting our most precious moments. And now, back to Craig.\n\nCraig: Apple Intelligence is truly unique in how it understands you and meets you where you are. And what you saw here is just the beginning. It enables so many more helpful features. For example, in the Notes app, you can now record and transcribe audio, to capture detailed notes while staying present in the moment. And when your recording is finished, Apple Intelligence generates a summary to help you recall the key points at a glance. Recordings, transcriptions, and Apple Intelligence-powered summaries are also coming to the Phone app. And when you start a recording in a live call, participants are automatically notified, so no one is surprised. Apple Intelligence is available for free with iOS 18, iPadOS 18, and macOS Sequoia, bringing you personal intelligence across the products you use every day. Still, there are other artificial intelligence tools available that can be useful for tasks that draw on broad world knowledge, or offer specialized domain expertise. We want you to be able to use these external models without having to jump between different tools. So we're integrating them right into your experiences. And we're starting out with the best of these, the pioneer and market leader ChatGPT from Open AI, powered by GPT-4o. First, we built support into Siri, so Siri can tap into ChatGPT's expertise when it might be helpful for you. For example, if you need menu ideas for an elaborate meal to make for friends using some freshly caught fish and ingredients from your garden, you can just ask Siri. Siri determines that ChatGPT might have good ideas for this, asks your permission to share your question, and presents the answer directly. You can also include photos with your questions. If you want some advice on decorating, you can take a picture and ask, \"What kind of plants would go well on this deck?\" Siri confirms if it's okay to share your photo with ChatGPT and brings back relevant suggestions. It's a seamless integration. In addition to photos, you can also ask questions related to your documents, presentations, or PDFs. We've also integrated ChatGPT into the systemwide Writing Tools with Compose. You can create content with ChatGPT for whatever you're writing about. Suppose you want to create a custom bedtime story for your six-year-old who loves butterflies and solving riddles. Put in your initial idea and send it to ChatGPT to get something back she'll love. Compose can also help you tap into ChatGPT's image capabilities to generate images in a wide variety of styles to illustrate your bedtime story. You'll be able to access ChatGPT for free and without creating an account. Your requests and information will not be logged. And for ChatGPT subscribers, you'll be able to connect your account and access paid features right within our experiences. Of course, you're in control over when ChatGPT is used and will be asked before any of your information is shared. ChatGPT integration will be coming to iOS 18, iPadOS 18, and macOS Sequoia later this year. We also intend to add support for other AI models in the future. Now, let's talk about developers, and how they can integrate the experiences powered by Apple Intelligence into their apps. We have updated our SDKs with new APIs and frameworks. For example, developers can add the Image Playground experience to their app with just a few lines of code. This means that an app like Craft can help users create images to make their documents much more visual. And Writing Tools are automatically available within apps that use the standard editable text view. So without any development effort, an app like Bear Notes can automatically allow users to rewrite, proofread, and summarize notes. Plus, we are building many more ways for users to take action in apps with Siri. If a developer has already adopted SiriKit, they'll see immediate enhancements from many of Siri's new capabilities without additional work. We're also investing deeply in the App Intents framework to connect the vast world of apps with Apple Intelligence. We're defining new intents across our operating systems and making them available to developers starting with these categories. These intents are pre-defined, trained, and tested, so they're easy for developers to adopt. Using new App Intents, an app like Darkroom will be able to use the Apply Filter intent to give users the ability to say, \"Apply a cinematic preset to the photo I took of Ian yesterday.\" These are just a handful of the updates coming to our platform SDKs so developers can add intelligent and useful features to their apps. We will share more details in the Platforms State of the Union later today, like how we are bringing generative intelligence to Xcode for developing apps using Swift and SwiftUI, with features like on-device code completion, and smart assistance for Swift coding questions. So that's Apple Intelligence, with tremendous benefits for developers and users. This is AI for the rest of us, personal intelligence you can rely on at work, home, and everywhere in between. Apple Intelligence harnesses the power of our most advanced silicon, and will be available on iPhone 15 Pro, and iPad and Mac with M1 and later. Apple Intelligence will be available to try out in US English this summer. We are bringing it to users in beta as part of iOS 18, iPadOS 18, and macOS Sequoia this fall, with some features and additional languages and platforms coming out over the course of the next year. This is the beginning of an exciting new chapter of personal intelligence. Intelligence built for your most personal products: your iPhone, iPad, and Mac. Intelligence grounded in the things that make you, you. And intelligence available to you systemwide, so you can get things done in the way that works for you. We are just getting started, and I hope you are as excited as I am for the road ahead. And now, back to Tim. Tim: Thank you, Craig, and thanks to all of our presenters. It's been an exciting day of announcements. We shared powerful new features and advancements to our six incredible platforms. And the introduction of powerful new Apple Intelligence features to iOS 18, iPadOS 18, and macOS Sequoia make these releases game-changers. Built in a uniquely Apple way, we think Apple Intelligence is going to be indispensable to the products that already play such an integral role in our lives. We have a big week ahead for developers. It kicks off this afternoon with the Platforms State of the Union. We also have over a hundred technical sessions, live forums, in-depth consultations, and Q&As with Apple engineers. All of this content is available online, for free, for developers. We're excited to provide developers with the amazing new OS platforms and technologies we announced today, as well as tools and resources to help them do the very best work of their lives. Thank you so much for joining us. Let's have a great WWDC! ♪ ♪",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ]
  },
  "extractedAt": "2025-07-18T10:20:58.861Z"
}