{
  "id": "220",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/220/",
  "title": "Say hello to the new look of app icons",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi, my name is Marie and I’m a designer here at Apple. And today I’m here to introduce you to a completely reimagined look of app icons. In this session, we’ll explore all of the exciting updates coming to icons. And I’ll even give you a peek behind the curtain at how we crafted this new design language. Then we’ll take a look at the underlying design system and I’ll share some tips and tricks that are really helpful for when you’re designing yourself. So that by the time we're done, you have a helpful first overview of how to master our new material effects and most importantly, create icons that are both beautiful and one of a kind. So now to start things off, let’s explore the creative vision behind the design and what makes it so special. And we will also look at what’s new in terms of appearance modes.\n\nAs part of our big redesign this year, we drew inspiration from the layered icons on visionOS and researched real glass properties to then combine that into this liquid glass material specifically for app icons.\n\nThe material layers different elements like edge highlights, frostiness, and translucency to not only add a sense of depth, but it really makes it seem as if the icons are lit from within. And adding to this physicality, the material comes alive on your iOS home screen. Based on gyro input, you can see light moving on the edge of the icon, which feels like it’s reflecting the world around you.\n\nThis new material treatment looks beautiful on light and dark mode, and we’re also introducing a range of new translucent appearance modes using our liquid glass. A monochrome glass that comes in a light or dark version, and we’ve created two different tint modes: a dark tint that adds color to the foreground, and a light tint where the color gets directly infused into the glass. This makes color picking even more fun, vibrant and expressive than before. Oh, and the new tinted glass also looks incredible when you pair it with a tinted lock screen.\n\nAll appearance modes are available on iPhone, iPad and Mac. And even on your Apple Watch, you see your light mode icons in the updated look.\n\nOf course, you will also see the updated version of your icon reflected on the App Store product page. Next, let’s dive into our underlying design system.\n\nPreviously, designs were made per device, so some icons had slightly different artworks depending on the platform. But with our new unified iconography language, we’ve now made it easier to design across our devices for both rounded rectangle and circle formats.\n\nLet’s start with our rounded rectangle shape. We’ve updated the design grid to a simpler and more evenly spaced structure. And the new grid also features a rounder corner radius, which makes the icons sit more concentric with our UI and even within our hardware.\n\nStill using our 1024 pixel canvas, circular-shaped artworks have a designated frame in our grid and more breathing room. And the new grid makes it really easy to create optically balanced artworks for all kinds of proportions.\n\nNow, you might be wondering how all these design changes will affect icons on macOS. Let's take a look. So far, some macOS icons had secondary elements that could extend the compounded shape. Like in the previous Contacts icon, where the divider tabs extend past the shape of the book. In order to avoid irregular shapes, the canvas shape now acts as a mask to designs. Here you can see how we’ve redesigned the icon to make better use of the canvas and include the divider tabs in its shape.\n\nFor existing Mac icons that are similarly shaped as our rounded rectangle, they automatically get masked or extended to fit into the template, while receiving the new material appearance without lifting a finger.\n\nHere’s another interesting one, where the icon has a very unique shape. In this case, the system removes any drop shadows and then auto-scales the artwork into our rounded rectangle canvas.\n\nHowever, even though this is a pretty smart auto adjustment, it’s better to redraw your icon to fully utilize the icon canvas, like what we did here for Photo Booth.\n\nNow that we’ve covered iOS and macOS, let’s move on to see what the new glass icons look like on Watch.\n\nWe’ve closely aligned the circular grid for watchOS with the updated rounded rectangle one.\n\nThe 1088 pixel canvas overshoots our rounded rectangle, which helps to create easier translations between platforms and to achieve visual consistency.\n\nThe circular icons now feel more in line with our other products, even at their small scale that you see them in on your Apple Watch.\n\nWe’ve also updated our templates based on our new design system, which can be super handy once you start working on your own designs. We’ve made these available for Figma, Sketch, Photoshop, and Illustrator.\n\nAll templates are available now on the Apple Design resources page on developer.apple.com. OK, now let’s talk about what you need to consider when drawing icons in order to make the most of our new materials and appearance modes. We’ll cover the importance of layering, how translucency and blur can elevate the look of your material, the difference that embracing simplicity can make, and we’ll give some guidance more specific to backgrounds. First off is layering, a key component of our new design language and an essential part that you should know about when working with materials. At its very simplest, icons have a background and one foreground layer, like in our Messages icon.\n\nAnd even with a single foreground layer like here, the material effects already give the icon a lot of extra detail. The messages bubble has a really nice translucency to it and a subtle shadow gives it some extra lift. But while obviously we can only have one background, foregrounds can be expressed through multiple layers. And stacking these layers is where it gets really interesting. Take Podcasts. Previously the design used a stencil style that already gave the icon a sense of layering. The space around the figure made it look like it might be sitting in front of the circular lines.\n\nNow, using our layering technique, we're stacking shapes on top of each other to create a truly dimensional design.\n\nSince icons are getting so much more detail and richness at the system level, we also notice that certain illustration styles and perspectives work better than others.\n\nRealistic 3D objects and perspectives like in the previous Chess icon can compete with the material qualities.\n\nThe redesigned icon uses a frontal view and a more flat appearance.\n\nInstead of using a complex illustration style, we let the material add nuance to the artwork.\n\nDimensional shapes should be used consciously and it's helpful to design them in a way that complements the glass materiality. So let’s see how this Preview icon could be improved.\n\nThis new design works much better with the material effects and the chosen perspective here has a clear purpose as it emphasizes the focus area of the magnifying glass.\n\nNext, let's talk about translucency.\n\nUsing translucency in blur with the new material is easier and more beautiful than ever. It can bring lovely nuances, lightness, and add even more depth to your design.\n\nTranslucency looks great on light and dark mode and even translates beautifully to our transparent modes. With the background being glass, you can see the wallpaper through all of the translucent layers. Now, we all know the phrase “less is more” and let me show you why this is actually very true when you're working with our materials. Photos is a great example for this. The old design was already using transparency to emphasize the overlapping petals and add some dimension to the whole shape. By reducing the amount of overlapping, we now allow for the intersections and reflective edges of our material to really shine.\n\nWe’ve also updated the colors to feel more vibrant and reminiscent of tinted glass, while still preserving the color palette that is so unique to the Photos icon.\n\nThe new design also uses our updated grid, which gives the icon more breathing room, and the chromatic shadows add even more depth to the glass material.\n\nAs many dynamic effects are available in the material recipe, we also recommend pairing back any built-in static effects in your source artwork.\n\nYou can see a range of these baked-in effects in the previous Home icon, like drop shadows or bevelled edges.\n\nSimilar to what we just saw in Photos, the new artwork for Home is a simplified version of the previous design.\n\nWe’ve reduced the amount of layers, made the shapes rounder, and removed any additional material effects. And here’s how polished this looks once we apply our glass treatment. It shows how much detail and sophistication it brings to an artwork that might seem simple at first glance.\n\nThat’s because the new design leverages our distinct material characteristics: translucency, shadows per layer for added depth, and specular highlights that help to shape the elements. Another thing to also keep in mind while drawing your icon are smaller details.\n\nIdeally, sharp edges and thin lines should be avoided. Instead, using rounder corners makes it easier for the light to seamlessly travel on the edges of an element, like in these rounder gear wheels of the Settings icon.\n\nAnd while of course not all elements have to receive the material treatment, for the ones that do, it helps to use bolder line weights as it will preserve details at a smaller scale.\n\nOkay, finally, let’s talk about backgrounds and the impact that they have on the appearance of your icon.\n\nWith actual lighting effects being so fundamental to this new look, we’ve noticed that softer light-to-dark gradients harmonize best with the direction of light.\n\nWe’ve also developed a System Light and System Dark gradient that should be used instead of pure white or black backgrounds. These gradients are designed to ensure contrast and they provide the ideal canvas for our material effects.\n\nAnd one last thing: with the success of dark mode, we actually recommend leaning more into colored backgrounds, so that there is a nicer distinction when switching between modes.\n\nSo that’s a look at our new design language for app icons. As you’ve seen, this really isn’t just about a new aesthetic, but it’s about unlocking more opportunities for your creativity. This system enables each icon to be the most bespoke and best crafted version it can be, reflecting the care and innovation that you pour into your apps. We really believe that this marks a new era for icons where they play an even more significant role in storytelling and brand identity. So I encourage you to embrace this new chapter, explore the possibilities, push the boundaries of what an icon can be, and craft experiences that delight from the very first glance. And now that you’re ready to start designing, I recommend to watch our companion talk “Make app icons with Icon Composer” by my colleague Lyam. He will show you everything you need to know about this new tool and how to use it to build your icon in glass. Thanks for joining us today!",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Human Interface Guidelines: App icons",
        "url": "https://developer.apple.com/design/human-interface-guidelines/app-icons"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/220/4/eb340303-3d49-4fcc-84c9-9dc98543ddaf/downloads/wwdc2025-220_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/220/4/eb340303-3d49-4fcc-84c9-9dc98543ddaf/downloads/wwdc2025-220_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "361",
      "year": "2025",
      "title": "Create icons with Icon Composer",
      "url": "https://developer.apple.com/videos/play/wwdc2025/361"
    },
    {
      "id": "356",
      "year": "2025",
      "title": "Get to know the new design system",
      "url": "https://developer.apple.com/videos/play/wwdc2025/356"
    },
    {
      "id": "219",
      "year": "2025",
      "title": "Meet Liquid Glass",
      "url": "https://developer.apple.com/videos/play/wwdc2025/219"
    }
  ],
  "extractedAt": "2025-07-18T09:35:05.124Z"
}