{
  "id": "252",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/252/",
  "title": "Optimize your monetization with App Analytics",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello, my name is Max Martynov. I am an engineer on the App Store and App Analytics teams. The goal of App Analytics is to provide you with the data that you need to maximize your opportunity on the App Store. Today, I am excited to announce several new App Analytics features that you can use to measure and optimize the performance of your apps. I will start by showcasing the new home for App Analytics and demonstrating the new expanded filtering capabilities.\n\nI will then walk you through the new payer metrics and benchmarks that you can use to measure the monetization performance of your app. After that, I will introduce a major update to the subscriptions analytics that are now more powerful than ever before. Then, I will demonstrate the new offer metrics, which you can use to see how well your apps convert, retain, and win back paying users.\n\nFinally, I will share an update to the Analytics Reports that you can use to export data for offline analysis. There is a lot of ground to cover, so let’s get started. This year, App Analytics is moving to a new home within the Apps tab, bringing your data closer to the app management workflow and making it easier to act on insights.\n\nClicking on the Analytics tab from your app’s page on App Store Connect will bring up the new App Analytics homepage, which has a few important updates. First, you will notice that key sections now live in a sidebar, making it easier to navigate and analyze your app’s performance. The new overview page is organized by the customer journey, with acquisition metrics at the top and downstream metrics further below.\n\nApp Store feature analytics now appear in the middle of the overview page, so you can immediately see how the top custom product pages and In-App Events impact your app’s performance. Another major update is waiting for you in the Metrics section, where you can perform deeper analysis using the new expanded filtering capabilities.\n\nApp Analytics now allows you to add up to seven different filters to any metric, more than doubling what was previously available. You can also select multiple values within each filter. For example, if you want to know which app referrer sources have the best conversion rate for a particular custom product page in the US and Canada on iPhone and iPad running iOS 18, you can now perform this analysis. This functionality is available for any of the dozens of metrics included in your dashboard. Now that you understand how to find App Analytics in its new home and use the expanded filtering capabilities, I’ll showcase the new payer metrics and benchmarks that the App Store is adding this year to help you optimize your monetization strategy.\n\nTo describe the new features introduced in this and future sections, I will use a sample app called Exercise with artificial but realistic data. With the help of this sample app, I will show how you can use the App Store’s new analytics tools to measure and optimize your app’s monetization performance. With that in mind, imagine that you are the developer of the Exercise app. The Exercise app offers one-on-one trainings for runners and bikers and sells them as consumable In-App Purchases in two ways: individual sessions and bundles of three.\n\nTo attract and measure each user group, you’ve designed two personalized custom product pages: one for runners and one for bikers.\n\nYou have then driven traffic to both pages with the hope of converting each user group to happily paying customers. Let’s go back to App Analytics in App Store Connect to see your results. The first thing you will notice is that apps with In-App Purchases have a new Monetization section in the sidebar.\n\nThis section provides convenient access to all revenue metrics.\n\nWithin the Monetization section, you can find the Sales view.\n\nAt the top of the Sales view, you will see familiar metrics such as proceeds, paying users, and the total number of In-App Purchases.\n\nBelow, you’ll see two new cohort metrics: Download-to-Paid Conversion, which shows how quickly new users buy, and Average Proceeds per Download, which tracks revenue growth per user over time.\n\nScrolling down reveals a detailed breakdown of proceeds for each of your In-App Purchases and proceeds by territory. The In-App Purchases chart shows an interesting early insight: you are making more money from the biking In-App Purchases than the running ones. To learn more about why this happens, you can click on the new “Cohorts” page in the sidebar.\n\nThis brand new section helps you analyze Download-to-Paid conversion and Average Proceeds per Download in greater depth. What makes these charts unique is that they allow you to see how long it takes for your users to become paying users after downloading the app, and how much money they spend in the days after they download. Two new benchmarks are located below each metric so that you can immediately compare your performance to your peer group.\n\nLooking at the Download-to-Paid conversion metric and its corresponding benchmark, You can see that 3% of your overall users are turning into paying users after 35 days, which is between the 25th and 50th percentile of your peer group. This means that your payer conversion rate is slightly below average. At the same time, steady growth in average proceeds per download shows that users who do spend in your app are making multiple purchases.\n\nComparing your performance to the benchmark reinforces this point, showing that users who spend in your app typically spend more than they do in similar apps.\n\nGiven that the running purchases were underperforming the biking ones, you may want to check if runners are the reason behind your low Download-to-Paid Conversion. Clicking “See all” will bring up the new  “Cohorts Analysis” page, which provides a detailed view of Cohort behavior.\n\nThis is an important view, so let’s take a moment to understand it.\n\nIf you pick a cell in the table, you can see that out of 58,000 users who downloaded the app in September, 2.9% made a purchase in 7 days after the initial download.\n\nThe top row provides a summary of the metric over time, showing the average percentage of users who made at least one purchase after a certain number of days. The colors in the chart help you visualize the build up of paying users in the days after they download.\n\nYou can select from several different Cohort metrics to analyze different stages of the customer funnel, or you can also add filters to focus on a particular subset of users.\n\nTo verify your original hypothesis, you can add a filter for your “Running” themed custom product page and see how quickly runners convert to paying users. After applying the filter, you can see that only 1.3% of runners make a purchase within the first 35 days, which is more than twice as low as your average day 35 conversion.\n\nThis means that runners are less likely to purchase anything at all compared to the rest of your user base. With this insight, you have a number of options. You can improve the “Running” custom product page and adjust your marketing efforts to focus on acquiring high-value users, you can also reengage runners with In App Events or evaluate other monetization strategies. Now that you understand the new payer metrics and benchmarks, I will move to the new subscriptions analytics features.\n\nImagine that you decided to enhance the Fitness app’s monetization strategy by offering group classes available through auto-renewable subscriptions.\n\nYou introduced two plans: one provides access to group running classes and the other provides group biking classes. Returning to App Analytics, you will see a new “Subscriptions” section in the sidebar, with a wealth of information about your app’s subscription performance.\n\nAt the top of the summary view, you will see metrics such as total number of active plans, paid plans, and monthly recurring revenue. All vital for tracking subscription success.\n\nThe Net Paid Plans graph provides an insight into how your subscription payer base has changed over time. This detailed visualization shows plan starts, which includes activations and reactivations, and churn, both voluntary and involuntary, to help you quickly grasp what is driving growth or holding it back. Scrolling down reveals how average subscription retention changes over time, giving you a sense of customer longevity.\n\nAnd the paid plans breakdown shows which plans are the most popular.\n\nIn this case, you may notice that the biking subscriptions are again more popular than the running ones. If you need to get into the details, you can click on the inline metrics page, where you will be able to choose from more than 50 new subscription metrics, grouped into two categories, states and events.\n\nState metrics allow you to see a snapshot of your subscription business at a particular point in time, including how many plans are currently in an offer period, paying full price, having a billing issue, or have churned.\n\nAnd event metrics show how plans are moving between those different states on a particular day, week, or month. You can also navigate back to the Cohorts view and select Subscription Retention in the metrics drop-down. While this chart looks similar to the payer conversion chart I showed in the previous section, the retention chart shows what percentage of users keep their subscriptions a certain number of months after originally subscribing.\n\nFor example, looking at the 6-month column in the top row, you can see that on average 73% of users are still subscribed 6 months after they initiated their subscriptions. At this point, you may want to check how long users who downloaded your app from the “Running” themed product page stay subscribed for. To do that, you can select a “Running” custom product page filter. In this case, you see something surprising. Even though runners have been less likely to purchase, once they subscribe, they tend to stay that way longer than average. This kind of insight can help you pinpoint which part of the customer funnel you need to focus on. In this case, initial payer conversion. You can then try a variety of strategies to improve it, including adjusting your pricing, enhancing user onboarding, or creating an intro offer. Now that you understand how to analyze your subscription performance and identify opportunities for improvement, let me show you how to take  advantage of the new offer metrics.\n\nOffers on the App Store allow you to attach a special price to a particular In-App Purchase so that you can better attract, retain, or win back paying users.\n\nGoing back to the Exercise app, imagine you decided to introduce a one-month free trial offer so that runners can experience the classes risk-free before converting to a paid plan. This should encourage more runners to subscribe. Once the offer is set up, you can navigate to the new Offers section in the sidebar to see how it is performing.\n\nSimilar to the other summary pages, the Offers summary provides rich metrics about your app’s performance and includes data about active offers, new offers, and conversion rate to fully paid plans.\n\nHere you can see a healthy increase in users starting the offer and converting to paid. You can also dive deeper into the offer conversion and retention chart by going back to the Cohorts section and selecting “Subscription Retention by offer start” from the metrics menu.\n\nAlong the left, you can see what percentage of users who start the offer end up converting to paid.\n\nIn this case, about 67% of users who sign up for the free trial offer convert to the fully paying subscribers, significantly increasing your payer conversion rate. Looking at the top row, you can see that on average 78% of users keep the subscription after three months and 73% keep it after six months, demonstrating strong ongoing retention.\n\nNow that you’ve seen how you can use the new offer metrics to evaluate your app’s offer performance, let’s talk about how you can use the Reports API to export App Analytics data at scale.\n\nAs you may know, the Analytics Reports API allows you to easily export any of the data available in App Analytics into your own systems. As of June 2025, you can use the API to access 8 categories of App Store reports, which empower you to make data-driven decisions offline. Looking ahead, the App Store is adding two new reports to complement the new data in the dashboard: a subscription state report and a subscription event report. These new reports provide rich data to help you analyze your subscription performance at scale.\n\nThey will replace the older Sales and Trends subscription reports you may use today and will help you tie download information to subscription performance in a privacy-friendly way. To summarize: all of these metrics have been created from the ground up to help you improve your business performance.\n\nWith a new home that scales with your business, expanded filtering capabilities, and over 100 new metrics to measure your In-App Purchases, subscriptions, and offers, App Analytics helps you better understand and serve the unique needs of your users. Let’s finish by talking about the next steps. As you think about how to apply these brand new analytics and insights to your apps, remember to compare your results to your peer group benchmarks to identify possible performance gaps.\n\nIf you want to improve your monetization performance, consider whether offers could help you acquire, retain or win back paying users.\n\nAnd don’t forget to explore how you can use custom product pages to attract different kinds of users and compare their performance across the funnel.\n\nFinally, be sure to watch “What’s new in StoreKit and in-App Purchase” to learn about how the latest store kit enhancements can help you deliver great In-App Purchase experiences to your customers. Thank you for your time, and we are looking forward to seeing what you build.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Analytics Reports",
        "url": "https://developer.apple.com/documentation/analytics-reports"
      },
      {
        "title": "Implementing introductory offers in your app",
        "url": "https://developer.apple.com/documentation/StoreKit/implementing-introductory-offers-in-your-app"
      },
      {
        "title": "StoreKit",
        "url": "https://developer.apple.com/documentation/StoreKit"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/252/5/adef7487-7011-47b3-8efb-93421930f6d2/downloads/wwdc2025-252_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/252/5/adef7487-7011-47b3-8efb-93421930f6d2/downloads/wwdc2025-252_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "328",
      "year": "2025",
      "title": "What’s new in App Store Connect",
      "url": "https://developer.apple.com/videos/play/wwdc2025/328"
    },
    {
      "id": "241",
      "year": "2025",
      "title": "What’s new in StoreKit and In-App Purchase",
      "url": "https://developer.apple.com/videos/play/wwdc2025/241"
    },
    {
      "id": "10044",
      "year": "2022",
      "title": "Discover Benchmarks in App Analytics",
      "url": "https://developer.apple.com/videos/play/wwdc2022/10044"
    },
    {
      "id": "10115",
      "year": "2021",
      "title": "What's new in App Analytics",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10115"
    }
  ],
  "extractedAt": "2025-07-18T09:18:53.028Z"
}