{
  "id": "364",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/364/",
  "title": "Welcome to WWDC25",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello developers and welcome to WWDC25.\n\nThis year we have more than 100 sessions on everything from the new design, Apple Intelligence, Xcode, Swift, SwiftUI, Metal, Gaming and more. Now I can play my RealityKit game on Apple TV at home. You can try Code-along sessions to work line by line with an Apple engineer. Let's see if the first solution would work for our case. Check out Foundation sessions to brush up on key design and technical principles.\n\nWe are so excited to get the privilege of introducing you to the new Foundation Models framework.\n\nAnd get the details on all the new developer announcements in the Platforms State of the Union.\n\nHere's a quick peek at what's in store.\n\nThis year introduces our broadest design update ever. A beautiful new design that scales across apps and platforms, all while maintaining the experiences people rely on every day.\n\nIt's built with Liquid Glass, a new material that combines the optical qualities of glass with a sense of fluidity to deliver a more expressive experience and bring more focus to your content.\n\nNice! Updates like this don't happen every day, and we're excited to see your apps come to life with this new design. Yeah, that was a lot. This year, any app can tap into the intelligence that's powerful, fast, built with privacy, and available even when the user is offline through direct access to the on-device large language model at the core of Apple Intelligence.\n\nThat was generated entirely on-device.\n\nPretty amazing.\n\nThere's so much more to explore this year, and each session now has a written summary that highlights the essentials so you can quickly get to details, docs, and sample code.\n\nDid you know that you can copy code right from a session into Xcode? Awesome sauce! Need some advice or have a question? We've got you! Request a one-on-one lab appointment to speak directly with an expert about your projects. Mad skills, man.\n\nOr join new online group labs hosted by Apple Engineers and Designers to dive deep into the biggest announcements. You can ask and upvote questions. - It's okay if I ask questions? - Absolutely! Or just hang out, listen, and learn. Rock on! This week and beyond, you can find answers in the Apple Developer Forums and stay connected with us through Meet with Apple Developer Activities Oh wow! Held online and in person all over the world.\n\nWoo! Woo woo! Happy WW and we'll see you out there. Send it!",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/364/5/10be61a4-993c-4cbd-8e29-e70070ef347c/downloads/wwdc2025-364_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/364/5/10be61a4-993c-4cbd-8e29-e70070ef347c/downloads/wwdc2025-364_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T10:20:17.434Z"
}