{
  "id": "258",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/258/",
  "title": "What’s new in Apple device management and identity",
  "speakers": [],
  "duration": "",
  "topics": [
    "Business & Education"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello, and welcome to WWDC. My name is Graham, and I’m part of the Device Management team here at Apple. If you’re responsible for deploying and securing Apple devices within an organization, or a developer building device management tools or identity solutions, this session is for you.\n\nAt Apple, we believe that great products should empower people, And that includes people in the workplace and the classroom. Our hardware, software, and services are designed to work together to protect data, enable productivity, and create intuitive experiences that just work. We want to enable you to provide amazing experiences for your users while balancing the security needs of your organization. And this year, we'd like to show you how we're taking that even further.\n\nWe’ve organized today’s session around four main topics. First, we’ll take a look at what’s new in Apple Services with updates to Apple Business Manager and Apple School Manager. Then we’ll dive into enhancements to device management, followed by new capabilities in app management. And finally, we’ll dive deeper into identity integrations.\n\nLet's start with Apple Services, the foundation for deploying and managing Apple devices at scale.\n\nApple Business Manager and Apple School Manager are free web-based services that work seamlessly with your MDM to help you configure devices, purchase apps, and manage accounts across your organization. Let’s start with some updates to Managed Apple Accounts.\n\nThese accounts are designed for work and school, giving IT full ownership of the account and the data associated with it. IT teams can set up their domain and connect their identity provider to enable federated authentication, enabling users to sign in with the credentials they’re already using.\n\nLast year, we introduced the ability for IT to lock their domain and take ownership of Apple Accounts created with that domain. Once this is started, users are guided through a process of updating their account.\n\nAnd this year, admins will be able to download a list of personal Apple Accounts on your domain, so you can communicate with users about getting their accounts updated. Once the update is complete, users will have access to all the services that organization has provisioned, including a new service, app notarization. In addition to app notarization, we’re also expanding Access Management to prevent personal Apple Accounts from being signed into organizationally owned devices.\n\nMeaning you can now ensure that only work accounts are being used on work devices. This includes all the places you’d expect including Setup Assistant and System Settings. And there’s no requirement or dependency on MDM. This new setting will apply to all devices in your organization.\n\nWith these changes, we want you want to make it easier for your organization to adopt Managed Apple Accounts. As a first step, we recommend locking your domain to block personal account creation. From there, you can move towards account capture, federation, and enabling the services that your users need.\n\nNext, let's talk about device inventory. We've been adding more information to devices in your organization, like Activation Lock status and device storage. And earlier this year, we added cellular information, including IMEI and EID. We’re also expanding the information for release devices to include who released it and when. And later this year, we’re adding Mac addresses for Bluetooth and Wi-Fi on iPhone and iPad. This will be helpful for organizations that rely on this information for managing network access.\n\nAnd last, but certainly not least, we’re adding AppleCare coverage information.\n\nThis information will help IT teams track coverage and make informed decisions about repairs and replacements. Traditionally, this information has only been viewable through a web browser. Well, today, we’re excited to announce Apple Business Manager and Apple School Manager APIs for organizations. With the initial set of APIs we’re providing, you can interact with device inventory data and MDM server assignment. Let’s take a look at the list of endpoints.\n\nYou’ll be able to query information about a list of devices, assign them to a device management service, get batch activity status, and more. To get started with this feature, you’ll begin by creating an API account, which can only be created by Administrators and Site Managers. From there, you’ll generate and download a Private API key to use with your app or service.\n\nThat brings us to the final set of updates for Apple Business Manager and Apple School Manager, deployment. Automated Device Enrollment is the cornerstone of Apple’s approach to simple and easy device management, allowing for just-in-time delivery of hardware without the need for IT to touch every machine. Last year, we extended this to Apple Vision Pro, but we know that not every device used in an organization is purchased through usual purchasing channels.\n\nSo now, in visionOS, Apple Configurator for iPhone can now add Vision Pro to your organization, and it works exactly how you'd expect. While Vision Pro is in Setup Assistant, bring an iPhone running Apple Configurator near Vision Pro, and a pairing code will appear. After entering the pairing code on iPhone, the device will be added to your organization. With this change, you can now add all MDM capable devices to your organization with Apple Configurator. And one additional note, visionOS now supports skipping panes in Setup Assistant. Check out the device management documentation for the new skip keys. Automated Device Enrollment isn’t always available in every deployment, so we offer account-driven enrollments to provide a simple, privacy-focused way for users to enroll using their Managed Apple Account.\n\nAccount-driven enrollments require a well-known endpoint that provides a redirect URL to enroll in MDM. We know that it can be a challenge for IT teams to set this up on their domain, so we now offer an alternative. You can now use your MDM server to configure the service discovery URL. Meaning if a device cannot find an endpoint on your domain, it'll check with Apple Business Manager or Apple School Manager to complete the enrollment. Once the MDM server configures the redirect URL, log into Apple Business Manager or Apple School Manager to specify the default device management service assignment for each device that should offer account-driven enrollment. With everything configured, your MDM server can now provide the complete end-to-end solution for account-driven enrollment.\n\nWith this change, we are making it easier for you to adopt account-driven enrollments in your organization for corporate-owned, personally enabled devices or personally-owned devices. To wrap up services, I’d like to tell you about an exciting new feature that’s going to make a complex process a lot easier. Organizations often need to move devices between MDM servers in cases like an acquisition, shifting from an on-prem to cloud-based MDM, or switching device management solutions. This typically requires a full device wipe or a user-driven manual process.\n\nToday we’re introducing device management migration within Apple Business Manager and Apple School Manager. You can now reassign an iPhone, iPad, or Mac to a new device management service to begin a migration. And you can also set a deadline for when the migration needs to be completed. Users will then receive a notification letting them know they need to migrate and what the deadline is. If no action is taken before the deadline the migration will be kicked off automatically and the user will be guided through the migration. Once migration is complete, the new device management service can take over Activation Lock and rotate the FileVault key using the bootstrap token. Old configurations are removed and new ones are installed, so it’s recommended to match the configurations as closely as possible to avoid disruptions. To preserve apps and app data, use await device configured and ensure that all apps are reinstalled before exiting the enrollment flow.\n\nWe think that device management migration will make the task of migrating between MDM servers so much easier.\n\nAnd that's our update on services. Be sure to check out the documentation for more details.\n\nNext, let’s dive into the latest improvements in device management.\n\nFor device management, we’ll cover important announcements for software update, updates  to Safari management, Apple Intelligence controls and enhancements to return to service.\n\nKeeping devices up to date is a critical part of managing devices in any organization. Software updates using Declarative Device Management were first introduced in iOS 17, iPadOS 17, and macOS Sonoma, and the feedback has been overwhelmingly positive. And this year, we’re bringing all those same features to Vision Pro and Apple TV.\n\nThis includes controlling update deferrals, setting update cadence, and defining deadlines for updates. With the transition to Declarative Device Management complete across all our platforms, we’re announcing the deprecation of the older software update management using MDM, meaning that it will continue to work, but it will be removed in a future release. Next, Safari management continues to evolve using a new declarative configuration to manage bookmarks and the ability to set a default homepage. This means that your employee or school portal will be the first thing your users see in a new tab or window. We also took this opportunity to consolidate the Safari settings that are currently managed in the restrictions payload, meaning that all Safari management is now available in Declarative Device Management. Next, Apple Intelligence features like writing tools, notification summaries, and image playground have enabled employees and students to be more productive. Apple Intelligence came to Vision Pro  in visionOS 2.4. To ensure organizations meet industry regulations and internal policies, we’ve brought all the applicable restrictions to visionOS as well.\n\nFinally, let’s go over some new capabilities in Return to Service. Industries like retail and healthcare often share devices between users, and Return to Service is a great way to reset them quickly. And this year, we’re making this process even better.\n\niPhone and iPad can now preserve managed apps when they are reset. User data is wiped exactly like before, but the apps remain. Eliminating the need to re-download apps, saving valuable time for the next user. This feature is enabled with a new key in the cloud configuration. In addition to the new key, you’ll also need to set await device configured. Once the device reaches the awaiting configuration state, you can install the apps you want to have preserved. When you release the device, the system takes a snapshot of the currently installed apps. After the next reset, you’ll need to send the InstallApplication command or the ManagedApp declaration to take management of the preserved apps before releasing the device from a waiting configuration. Resetting without re-downloading apps not only speeds up the turnaround time between users but also helps in network-constrained environments.\n\nReturn to Service has been great for iPhone and iPad, but we also want to bring it to a new platform where shared use cases are starting to take off.\n\nAnd that's Apple Vision Pro. visionOS brings a new way to prepare the device for the next user. Once configured for Return to Service, Vision Pro will show a new “Reset for Next User”  option in Control Center. Once selected, it will give a 10 second timer for the user to remove the device and set it aside to begin the reset process. Additionally, Vision Pro can be reset at the lock screen by just pressing the Digital Crown.\n\nIt couldn’t be easier to prepare Vision Pro for a new user, and app preservation will  keep your organization-specific apps in place so there's minimal downtime. We’ve seen some amazing Vision Pro deployment so far, and we believe this will continue to unlock  new and exciting use cases. In addition to everything we’ve gone through so far, check out the device management documentation for even more, including: Battery health information for iPad, Setting default apps for messaging and calling, and new restrictions to limit Messaging and FaceTime per SIM, Allowing the temporary use of AirPods and Beats headphones, adding support for Fully Qualified Domain Names in the network relay profile, and a new Network Extension URL Filtering API. For more details on that, check out the “Filter and tunnel network traffic with Network Extension” session.\n\nAnd that wraps up device management.\n\nLet's move on to app management. Apps enable users to be creative, productive, and stay informed on the go. Keeping apps up to date is essential for security. But for some mission critical apps, IT teams need more control, such as validating updates before they are rolled out. And this year, we're doing just that.\n\nOn iOS and iPadOS, the managed app configuration now offers options to define the update behavior on a per app basis. This gives organizations even more control over their managed apps. You'll be able to enforce or disable the automatic update of apps. Apps can also be pinned to a specific version allowing for a more controlled release process. And the status channel provides real-time visibility into app installation progress and version information. Admins can even specify if app downloads over cellular should be restricted. With all of these new features, it gives IT teams even more control over the apps on their devices.\n\nAs part of iOS 18.4 and iPadOS 18.4, we officially took managed apps out of beta and added support for required apps in visionOS 2.4.\n\nNow, let's talk about the Mac. Starting in macOS Tahoe, App Store apps, custom apps, and packages can now be deployed using Declarative Device Management. Both apps and packages will be able to be deployed as required or optional. And the status channel will update the server with the installation status. The ManagedAppDistribution framework that allows for MDM developers to create self-service apps will be available for the Mac later this year.\n\nFinally, in iOS 18.4, iPadOS 18.4, and visionOS 2.4, app developers have a new ManagedApp framework they can build into their apps.\n\nThis API enables organizations to securely deploy app configurations, including settings, passwords, certificates, and identities. We believe there are tons of interesting use cases for this API, including the ability to customize app experiences, securely retrieve API access tokens, add custom trust certs, and access to hardware bound keys to allow apps to get strong proof of device posture. Check out the “Discovering ManagedApp Framework”  session for more information.\n\nManaging apps with Declarative Device Management is the best way to manage apps. And with the new ManagedApp Framework, you can now create even better user experiences.\n\nLet’s dive into our final topic with, updates to identity integrations.\n\nIdentity is a key aspect to any deployment. By ensuring only authorized users can access data and resources, Platform SSO lets users log into their Mac with their identity provider, then automatically signs them into apps and websites using either a synced password or a Secure Enclave-backed key. Today, Platform SSO registration takes place after a Mac has been set up with a local user.\n\nThis year, we’re streamlining this registration process by bringing Platform SSO into Setup Assistant during Automated Device Enrollment. Let’s take a look at what this process looks like for the user. When a Mac begins enrollment into device management, a new Platform SSO pane appears in Setup Assistant, prompting the user to authenticate with their identity provider. Users will not be able to proceed without Platform SSO registration. After a successful sign-in, SSO can provide an authenticated enrollment into device management, and if federated to the same identity provider, can sign users into their Managed Apple Account. A local account is created, and the password is either synchronized with the identity provider or set by the user using a Secure Enclave-backed key. Additionally, the account’s profile picture can be synced from the identity provider.\n\nTo recap, simplified setup for Platform SSO will streamline Mac deployments and enable users to quickly get up and running on a new Mac with their organization’s credentials.\n\nWhile this is great for one to one deployments, we know there’s lots of shared use deployments, and we have an exciting update for that as well.\n\nIntroducing Authenticated Guest Mode, a mode optimized for shared use. When configured, users can log into a Mac using their cloud identity right from the login window. Authentication can be completed using either a Password or SmartCard and will require the Mac to be online to log in. After login, the user can take full advantage of SSO and easily sign into apps and websites. When the user is done and logs out, all the user data from the session will be wiped from the device. To optimize the setup of this feature, you can pair Platform SSO with auto advance, meaning during setup, the Mac will silently complete Platform SSO registration, enroll into device management, and land at the login window ready for a user to log in. In many shared use environments, it's important to be able to log in and access resources quickly. And users may need to do that multiple times per day on many different machines, like a doctor or nurse visiting patients in different rooms throughout the day. This year, we set out to improve that experience with Tap to Login. Over the past few years, companies and schools have started to adopt corporate badges and school IDs in Apple Wallet. These passes can unlock doors with just the tap of an iPhone or Apple Watch. No need for a physical card.\n\nWe’re bringing this same experience to the Mac. Users will be able to tap their iPhone  or Apple Watch on Macs configured for Authenticated Guest Mode to quickly log in and get to work with a single sign-on to all their apps and websites. User credentials can be provisioned as an Access Key in a Wallet pass through an app on iPhone. Access Keys are stored in the Secure Enclave, so they are hardware-backed, encrypted, and protected from tampering or extraction. And just like with transit cards, Express Mode allows for login with just a tap, no need to wake or unlock the device.\n\nIn addition to setting up the Mac with Authenticated Guest Mode, you’ll need to attach an external NFC reader. This feature is so cool, and it will be amazing for organizations who share devices like education, retail, and healthcare. Developers like SwiftConnect, who already provision employee badges and school IDs, are working to enable the provisioning of Access Keys to use with Tap to Login. We’ve covered a ton of information today, so let’s take a moment to recap.\n\nThere are lots of great new features for Managed Apple Accounts, and we hope they enable you to create better experiences for your users. The new Services API for Apple Business Manager and Apple School Manager mean you can now do many common tasks through APIs, making managing devices even easier. And migrating devices between MDM servers just got easier with device management migration. With the updates to app distribution, there has never been a better time to jump into to managing apps with Declarative Device Management. Apple Vision Pro can now be shared with Return to Service. And with the updates to Platform SSO, you can now sign into a Mac with the tap of an iPhone or Apple Watch. We have a ton of great documentation available at developer.apple.com, where you can dive deeper into learning more about many of the new features we discussed today. Thank you for joining me, and I look forward to seeing what we can all do to make managing Apple devices a pleasure for developers, admins, and users. Have a great WWDC.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Apple School and Business Manager API",
        "url": "https://developer.apple.com/documentation/apple-school-and-business-manager-api"
      },
      {
        "title": "ManagedApp",
        "url": "https://developer.apple.com/documentation/ManagedApp"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/258/4/00c0d5e4-631c-40a0-b535-65404ad0e9c1/downloads/wwdc2025-258_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/258/4/00c0d5e4-631c-40a0-b535-65404ad0e9c1/downloads/wwdc2025-258_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "234",
      "year": "2025",
      "title": "Filter and tunnel network traffic with NetworkExtension",
      "url": "https://developer.apple.com/videos/play/wwdc2025/234"
    },
    {
      "id": "203",
      "year": "2025",
      "title": "Get to know the ManagedApp Framework",
      "url": "https://developer.apple.com/videos/play/wwdc2025/203"
    }
  ],
  "extractedAt": "2025-07-18T09:26:19.518Z"
}