{
  "id": "328",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/328/",
  "title": "What’s new in App Store Connect",
  "speakers": [],
  "duration": "",
  "topics": [
    "App Store, Distribution & Marketing"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi, and welcome to What’s New in App Store Connect I'm Chinedu, from App Store Connect Engineering. In this session, I’ll show you some great new features that make it easier for people to discover your apps, and new ways to tell people that your apps meet their needs. And Hi, I’m Michael, also from App Store Connect Engineering and I’ll be taking you through some of the new features we’ve added in App Store Connect with you in mind.\n\nIn this session, we have a number of exciting improvements to share with you for App Store Connect on the web, the App Store Connect app for iPhone and iPad, and we’re bringing even more features to the App Store Connect API. First, I’ll share some improvements that we've made to the experience of managing your app and getting it ready for distribution on the App Store. And Chinedu will walk you through the features that make it easier for people to discover your app, with tags, custom product pages, and non-subscription offer codes, including an all new way for you to inform people that your app is right for them. Finally, we’ll share a few more exciting new features and where to find out more about them. So lets move over to managing your app! Everyday, developers like you manage hundreds of thousands of builds in App Store Connect for testing and publishing to the App Store. It all starts with the upload process, and it’s important to understand the status of your build as it gets delivered, so that you know when it’s finished processing or if you encounter any issues along the way that you need to address. You’ve always been able to upload builds using Xcode and additionally many of you choose to use Transporter to upload your builds to App Store Connect.\n\nStarting later this year, you’ll now also be able to use the App Store Connect API to upload your builds offering new flexibility for integrating your custom workflows.\n\nHowever you choose to upload your app to App Store Connect you get an email, letting you know when your build has completed processing, or when we’ve encountered an issue that needs your attention.\n\nAnd now to give you and your team better visibility, we’re enhancing the way build uploads are displayed in App Store Connect.\n\nBuild uploads in App Store Connect provides a complete view of your app deliveries that are in progress for a given app, visible by your team members.\n\nEven more importantly, the builds you deliver are now included and retained in App Store Connect, even if your build wasn’t accepted due to an error encountered during the process. And you and your team have access to any information on warnings or errors that your delivery may have encountered. In the TestFlight section in App Store Connect, where you typically view your builds, you’ll see an entirely new Build Uploads section for your builds that are in progress. The status will change as you progress through the build delivery process, from the moment your build delivery is created to when your build is processing.\n\nYou may notice that in the Builds Uploads section I have two builds with the same version and build number, my most recent version which is uploaded and ready for testing and the previous delivery that failed. This means that going forward you’ll be able to reuse a build number should your app delivery fail with an error.\n\nIf you or your team want to know more details about the failed delivery, you can click in for the full message and details.\n\nTo reiterate, you’ll now be able to upload your builds using the App Store Connect API. With our new Webhooks you can also receive realtime notifications for the status changes during the app delivery process.\n\nAutomate your development process with the App Store Connect API will go over both of these features in depth so be sure to check that out to learn more. When it comes to your builds, you might be looking for additional ways to keep your app as small as possible. Another great feature we’re introducing this year to help you manage your build size are Apple-Hosted Background Assets. Apple-Hosted Background Assets provides an enhanced way to distribute assets of up to 200GB for your app, they’re hosted by Apple, and they work across Mac, iPhone and iPad, Apple TV, and Apple Vision Pro. You’ll be able to update Apple-Hosted Background Assets outside of your app, allowing you to introduce new content exactly when you want. To learn more about this exciting new feature, be sure to check out Discover Apple-Hosted Background Assets for more in-depth information. And that’s some improvements for managing your builds. Let’s move on to reviewing feedback. Getting feedback from your testers before you launch is critical, and TestFlight makes it easy for testers to give feedback on your apps, games, and App Clips across Apple platforms before you publish.\n\nTesters can submit feedback on your app directly through TestFlight or the share sheet on iOS.\n\nThey include text describing the feedback and optionally, screenshots to help further illustrate their experience. You also get valuable testing data in the form of crash logs, delivered from your testers devices. You’ll typically browse this feedback in App Store Connect or take crash logs and open them directly inside Xcode for further investigation. Getting this feedback quickly is an important way to stay connected with your testing community and improve the overall quality of your apps and games.\n\nAnd now, we’re bringing feedback from TestFlight and notifications to the App Store Connect app on iPhone and iPad.\n\nWith Feedback and notifications, it allows you to get realtime feedback from your testers directly in the App Store Connect app.\n\nIf you’re worried about becoming overwhelmed with feedback, our digest feature scales your notifications, allowing you to get timely feedback without causing too many interruptions.\n\nFeedback can be reviewed at a glance and more importantly, shared with your team, right from your device, wherever you are. This allows you to take quick action and identify issues that need your attention. Let’s see how this works. When a tester has reported some feedback you’ll get a notification through the App Store Connect app. From that notification you can quickly review the included details including screenshots and description the tester provided with their feedback. If you scroll down you’ll find more information about the testers specific configuration when the feedback was submitted.\n\nAnd while you’re in the app you can share this feedback with anyone on your developer team where they can also open the feedback using App Store Connect on the web or the app.\n\nYou have access to more than just the feedback you’ve been notified about. You can browse and filter on all the screenshot feedback submitted by any testers.\n\nCrash feedback and logs work much the same way. You’ll be able to glance at details about the crash encountered, which is handy when you want to reference this information in combination with debugging in Xcode.\n\nFinally, you can customize to receive notifications for the App Store Connect app to only provide notifications for Screenshots or Crash feedback.\n\nAlong with these new features for the App Store Connect app, we’re adding support for Webhooks for use with the App Store Connect API for both screenshot and crash feedback from TestFlight providing more opportunities for automation.\n\nWe’re also introducing TestFlight feedback APIs for you to access all the same information.\n\nAgain, to learn about all these exciting new features, be sure to check out Automate your development process with the App Store Connect API. The new improvements that we’ve made to managing builds and reviewing feedback will make it even easier to manage your app in App Store Connect. Now I am going to hand it over to Chinedu to tell you more about the changes to make it easier to get your app discovered. Thanks Michael. People discover your apps on the App Store in a range of ways. Either by searching your app’s keywords, through editorial pieces, or even through app categories.\n\nThis year, we’re introducing a number of big changes to make your apps even more discoverable, one of which is App Store Tags.\n\nYour app’s metadata, its description, category, even screenshots hold very useful information about your app that’s often buried. To help uncover some of that information we’re building on app categories and generating tags that better highlight specific features and functionalities which help people really zoom-in on what they are looking for. These App Store Tags are generated by our large language models using a range of data sources, including your app’s metadata.\n\nThe tags are all human reviewed so you can be confident of the quality of the tags that can be applied to your apps.\n\nTapping on a tag, takes people to a dedicated view with a personalised and curated collection of apps or games that share similar features or functionalities.\n\nWe also surface these tags at key areas in the app store to drive discoverability across our catalogue. For example, tags appear along-side app categories on the search page and with your app in search results. Now, whilst we are generating and assigning these tags to your apps, you still have control over which ones are associated with your app. You can view your tags on the App information page in App Store Connect.\n\nAnd you can tailor the tags associated with your app by clicking edit and changing the selected tags. Deselecting a tag removes it’s association with your app across the app store so those tags won’t show up on your app’s product page, and your app won’t show up in the tag rooms for the those tags. In addition to tags, we’ve made improvements to another way people discover your apps; custom product pages. As a refresher, custom product pages are a handy way of showcasing distinct use-cases in your app. This year, we are introducing keywords for custom product pages allowing them to now be surfaced in search results This enables you to really tailor how your app appears in search results to better match a person’s query.\n\nWhenever your app shows up in search results for the keywords you’ve assigned, your custom product page shows in place of your default product page.\n\nTo set this up, simply assign any keyword, or set of keywords from your latest app store version to your custom product page; here’s how.\n\nNavigate to custom product pages, say you want to make the “workouttracking” custom product page discoverable in search, simply click into it and select the keyword, or words, you want to assign.\n\nYou can also customise your selection for each language.\n\nOnce you’re done, and as long as you’re just assigning keywords, you can make this live without needing to submit for review. Assigning keywords to your custom product pages lets you show the most relevant representation of your app in search results. So it’s recommended that you make your keyword selections unique for each of your custom product pages, so that the right custom product page is shown. You can also view search traffic per custom product page in app analytics. A great way to engage with your customers and drive discoverability outside of the app store, is with offer codes.\n\nOffer codes have been very popular with subscriptions, and now, we’re expanding them to consumables, non-consumables and non-renewing subscriptions. You can now generate free and discount offer codes for all types of In-App Purchases and subscriptions.\n\nYou can have up to 10 active offers per In-App Purchase at a time, and you can create codes in batches, up to a maximum of 1 million offer codes per app per quarter, across both subscriptions and In-App Purchases. You can also define the types of customers that can redeem your In-App Purchase offers. You can set redemption eligibility based on whether: the customer has never spent in your app, if they’ve spent, but not in the last 30 days, or if they’ve spent in the last 30 days. To enable you to fine tune your user-experience and validate your app and server logic you can now generate offer codes in the sandbox testing environment for both In-App Purchases and subscriptions! You can generate up to ten thousand codes per app per quarter and these codes can be redeemed in-app or in Sandbox Account Settings on iPhone and iPad. There’s also no limit on how many codes a single Sandbox Apple Account can redeem. Now to set up some offer codes! You’ll start by creating an offer campaign.\n\nWe’ve added a new creation process within the In-App Purchases details page. When setting up your campaign, you’ll specify the eligibility criteria. So you can restrict this offer to people that have never purchased in your app, those that have purchased in the last 30 days and/or those that have purchased, but not in the last 30 days. Once you have your campaign, you can generate your codes.\n\nThe same one-time and custom code types, that are available for subscription offers, are also available for In-App Purchases.\n\nIf you need a refresher on offer code types take a look at Xiaolan and Ricky’s Implement App Store Offers session from last year. And for testing, you have the sandbox codes.\n\nOnce you have your codes, you can distribute them through a deep-link, QR code, or by having customers enter them in your app.\n\nAll of these options are fully supported by the App Store’s redemption flow, and you can support in-app redemption with StoreKit.\n\nSo once a person redeems a code, there’s nothing else for you to do; we’ll take it from there.\n\nOnce the App Store redemption flow is complete, the person doesn’t already have your app installed, it’ll be installed automatically; just make sure you recognise the transaction with StoreKit and grant access right away. And, to help you understand the sales and trends of each of your offer code campaigns, you can view reports in App Store Connect.\n\nOnce people have discovered your app, you’ll want to show them that others are having a great experience with your app, and that you support features and capabilities that make your app safe, and easy to use. To make it easier for people to get an idea of the general sentiments behind the customer reviews your app has received, we are generating Review Summaries.\n\nThese summaries are generated using our large language models, and combine key information and highlights from individual user reviews into a short paragraph. They are generated for apps and games, with enough customer reviews to provide a summary. And they’re refreshed regularly. If your app has a review summary, in App Store Connect: you can view the summary that’s shown in your app’s product page and when it was last generated. And if the summary is not quite right, you can let us know by reporting a concern.\n\nAnother very important thing people check before downloading an app, is the app’s Age rating. We are making changes to help parents better understand your app’s suitability for their young children, pre-teens, and teenagers.\n\nWe’re also giving you more ways to communicate your app’s suitability for different age groups. We now have 5 age rating thresholds, three of which are new.\n\nThis offers more granularity to better cater a wide range of people’s needs and maturity. In certain regions, the ratings are different to better reflect that region’s requirements. We use existing age ratings responses to automatically calculate new age ratings.\n\nIf your app has controls which can limit content in your app, for example through parental controls or age assurance, you can declare them.\n\nYou can also indicate if your app has capabilities or features that could bring age-inappropriate content to your app. And this year, there are new capabilities to indicate, like messaging and chat, user-generated content, and advertising.\n\nYou may need to assign a higher age rating than the one that’s calculated, for example this could be to align with your app’s policy. You can assign a higher age rating with a simple override. On your app’s product page, we’ll show the age rating based on the person’s country or region. And, people can tap the age rating to view your declared in-app controls and capabilities along with responses to the other age rating questions. Now, to configure age ratings! We’ve redesigned the developer experience. You can now learn about each category in a new learn more section. Clicking on the cards opens a modal with descriptions and guidance on each category.\n\nOnce you’ve reviewed the guidelines and ready to get started, click “Set Up Age Ratings”.\n\nWe’ve included descriptions and helpful examples with each question making it easier to respond correctly.\n\nWe’ve added new questions which you’ll use to declare your in-app controls and indicate your app’s capabilities.\n\nYou’ll go through the questionnaire, and when you’re done, we’ll calculate your app’s age ratings for all regions, including those with more specific guidelines.\n\nWe’ll present the calculated rating and say your app’s policy requires users to be 16 or older you can override the calculated age rating and assign a higher one. If you have a dedicated page with more information on your app’s age suitability, you can add the url.\n\nOnce you’re done, click save and you’ll get a summary view of your app’s age rating across all countries and regions it’s distributed in.\n\nYou can click into any of the cards to view the countries and regions that are assigned that rating.\n\nThe new age ratings are also available to view in the App Store Connect app on iPhone and iPad.\n\nThese changes impact all apps. And age ratings for your apps will be automatically calculated using your existing responses. So review your new age ratings and answer the new questions to ensure everything is accurate. Another thing people want to know before downloading an app, is that they can use the app in the ways that work best, for them. This often means checking that the app supports the accessibility features that they need. To make it easier for you to tell people your app supports accessibility features, like Larger Text and VoiceOver, we are introducing, Accessibility Nutrition Labels.\n\nThese Accessibility Nutrition Labels are displayed in a new section on your app’s product page and give people confidence that your app supports their needs. You declare accessibility support by device independently, allowing you to tailor your accessibility nutrition labels to match the levels of support in each of the devices your app is available on.\n\nTo help you accurately determine which features you support, for example understanding the difference between voice over and voice control, we’ve created a set of detailed guidance on determining support.\n\nWe also have the Evaluating your app for Accessibility Nutrition Labels session to help you assess your apps. To set up an accessibility nutrition label, click get started and select the device you want to declare accessibility support for.\n\nYou can select one or more devices on the platforms your app has versions for. If you select multiple devices, we’ll create drafts for each device for you to fill in one at a time. Select one device, and you continue on and indicate the specific supported features.\n\nWe’ve included brief descriptions under each feature to help you make sure your selection is accurate.\n\nOn the last step, we show you the accessibility nutrition label as it’ll be displayed on your app’s product page.\n\nAll labels are initially saved as drafts so you can make as many edits as you need to get your declaration as accurate as possible.\n\nWhen you're ready, you can publish your accessibility nutrition labels. If you have multiple device declarations, you can publish them together or individually.\n\nAccessibility support is an ongoing activity and with future app versions, you may support even more features. So, you can always edit your accessibility nutrition labels, even after it's been published.\n\nYou may also have a website with information about your app’s accessibility support, you can add the url and it’ll be shown on your app’s product page.\n\nThese are just some of the amazing features and improvements we’ve made this year. We have even more updates and enhancements we’d like to share, so back to Michael to tell you all about them. Thanks Chinedu! Those are some really incredible features coming to App Store Connect this year and we can’t wait for you to try out some of this new functionality yourself. We showed you some new ways to manage your apps in App Store Connect and some incredible new features to help more people discover your app on the App Store. We also showed you some features to help inform your users if your app is right for them, including the introduction of our all new Accessibility Nutrition Labels. In addition to the features we just discussed we have a number of additional updates and enhancements across the developer and App Store ecosystem, including: App Analytics. We’re adding over 100 new metrics in App Analytics in App Store Connect including brand new subscriptions and monetization data to help you grow your business on the App Store. You’ll be able to explore all of this new data in a redesigned experience, making it easier to navigate, filter data, and analyze your app’s performance. You can learn about all these new exciting changes in Optimize your monetization with App Analytics, and we’ve made some incredible new improvements to Game Center starting off with an all new games app to boost discoverability, engagement, and excitement of your games. Game Center is also introducing new activities and challenges unlocking powerful new multiplayer and social experiences. While not exclusive to Game Center, we’ve also made some improvements to installing and testing large content on Mac with your games in mind. You’ll find out about many of these new features and more in the Engage players with the Apple Games app session. Finally we’re making some refinements to the App Review submission process, including new review submission items, like the all new Apple-Hosted Background Assets and Game Center types that can be submitted independently of an app version submission. You’ll be able to group items into draft submissions allowing you to have them reviewed together. This is incredibly useful for creating submissions that benefit from multiple item types, like In App Events and Custom Product Pages. The updated user interface and submission flow will also make it easier to perform these actions and get your content submitted, reviewed, and onto the App Store. Should you have trouble using any of the features in App Store Connect or TestFlight, please know that we’re here to help! You can reach out to Apple Developer Support through the Apple Developer Website day or night, including holidays. We’re available by phone or email, whichever is most convenient for you. We can answer questions, listen to your feedback, and most importantly assist you if you’re encountering an error using these tools. If you are encountering any unexpected behavior, remember its helpful to provide as much information as possible. Things like screenshots, HAR logs and detailed steps can help expedite our investigation and resolution to your issue. As we wrap up I encourage you to try out all these new capabilities in App Store Connect, TestFlight, and the App Store Connect API. If you want to learn even more, be sure to check out our App Store Connect Help guide which has detailed information on using these features. More importantly, let us know what you think by submitting your feedback. Our team reviews all the feedback you send us. Thanks for watching. We can’t wait to see what you build next!",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/328/6/e2b4ccaa-ad5a-421e-898e-2f1825e6c7ab/downloads/wwdc2025-328_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/328/6/e2b4ccaa-ad5a-421e-898e-2f1825e6c7ab/downloads/wwdc2025-328_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "324",
      "year": "2025",
      "title": "Automate your development process with the App Store Connect API",
      "url": "https://developer.apple.com/videos/play/wwdc2025/324"
    },
    {
      "id": "325",
      "year": "2025",
      "title": "Discover Apple-Hosted Background Assets",
      "url": "https://developer.apple.com/videos/play/wwdc2025/325"
    },
    {
      "id": "215",
      "year": "2025",
      "title": "Engage players with the Apple Games app",
      "url": "https://developer.apple.com/videos/play/wwdc2025/215"
    },
    {
      "id": "224",
      "year": "2025",
      "title": "Evaluate your app for Accessibility Nutrition Labels",
      "url": "https://developer.apple.com/videos/play/wwdc2025/224"
    },
    {
      "id": "252",
      "year": "2025",
      "title": "Optimize your monetization with App Analytics",
      "url": "https://developer.apple.com/videos/play/wwdc2025/252"
    },
    {
      "id": "241",
      "year": "2025",
      "title": "What’s new in StoreKit and In-App Purchase",
      "url": "https://developer.apple.com/videos/play/wwdc2025/241"
    },
    {
      "id": "10110",
      "year": "2024",
      "title": "Implement App Store Offers",
      "url": "https://developer.apple.com/videos/play/wwdc2024/10110"
    }
  ],
  "extractedAt": "2025-07-18T09:18:50.231Z"
}