{
  "id": "316",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/316/",
  "title": "Principles of inclusive app design",
  "speakers": [],
  "duration": "",
  "topics": [
    "Accessibility & Inclusion",
    "Design",
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hey there, I'm Chris. Hi, I'm Lisa. We’re both designers working on accessibility. We're so excited to talk with you about how to make your app more inclusive of people with disabilities. And we really can’t wait to show you how much potential for innovation there is in this space. Designing your app to work for people with disabilities is so important in a day and age when your app could really be used by anyone. There are so many people around the world that live with some form of a disability, many more than you might think.\n\nAbout one in seven people has a disability. So chances are, even if you don’t have a disability, someone close to you probably does. And when you think about how different people with different disabilities experience the world, it opens up design opportunities.\n\nWhen you include disability into your design, you'll make your app work for more people and also spark more creativity.\n\nSo during our time together, we’ll give you some tools and ways of thinking to help you feel confident to include disability as you design your app.\n\nThere are a lot of aspects of inclusion.\n\nAnd making a truly inclusive app means considering a variety of things. Things like making your app work in other languages, being thoughtful of the impact your app may have on people of a race or ethnicity different from your own, and being inclusive of cultures from around the world. But today we’re just going to talk about disability, which is actually unique because it’s a universal part of being human.\n\nAnd the principles you learn today can easily be applied to other areas of inclusion too. If you haven’t already experienced disability, chances are, you or someone close to you will at some point in your life.\n\nThat might be temporary hearing loss after being at a really loud concert, or something more permanent like being deaf or hard of hearing. And you’ll definitely be in situations where a world built with disability in mind would have been good for you. Like being in a place that you aren’t supposed to talk out loud or a place where everyone is speaking a different language. So thinking about disability as you design your app, will end up benefiting you and the people you care about now and in the future. When Lisa and I think about disability as we design, we find it helpful to think about the following five categories: Vision, Hearing, Motor, Speech, and Cognitive.\n\nAnd it’s really important to think of all of these senses as a spectrum, because everyone is different.\n\nYes, everyone is so different. Think about vision.\n\nPeople often assume that being blind or not being blind means that people either have total vision or can't see anything at all. But really, there’s different aspects and levels to blindness that can affect each person differently. Like for me, I’m legally blind due to a rare form of Macular Degeneration. This impacts my central vision and my ability to see detail. My vision is very blurry and I need to get really close in order to read or to recognize faces. But even though I’m legally blind, I still can see colors, light, and big objects.\n\nSo in my case, it's not all or nothing. I have “some” vision that lives somewhere on the vision spectrum. By just adding that one extra word, “some”, you remind yourself of the spectrum within disability, and that will help you make more inclusive design decisions. So let’s dive in. A lot of people think of disability simply as a characteristic of the body or mind. But you know what? It actually depends a lot on the environment, and many limitations only exist when there’s a gap between what a body can do and what society expects.\n\nSociety generally assumes that everyone, when they’re born, can’t do much, that they’ll gain the ability to see, and learn how to walk and talk as they grow up, and then, that they’ll start losing many of those abilities as they get older.\n\nSociety expects this, often without even realizing it. That means a lot of physical and digital things are built with the assumption that this is just how people are. But that assumption just isn't true.\n\nIn reality, everyone's arc is different. They all have ups and downs. And nobody really follows the exact arc that society expects.\n\nWhen there’s a difference between what a person can actually do and what society expects, that is where disability is really born.\n\nThis gap is called the inclusion gap.\n\nSo here’s an example to illustrate how disability emerges from the gap. Imagine a two-story building.\n\nIf there wasn’t an elevator, someone that uses a wheelchair would have a hard time getting to the second floor.\n\nBut if there was an elevator, there wouldn’t be a problem at all.\n\nAnd think about this. If there wasn’t an elevator, and if the stairs were under construction, or there weren’t stairs in the first place, even a person that could walk on two legs would have a hard time getting to the second floor.\n\nSo what a person can and cannot do depends so much on how the environment is designed and built. There’s a great opportunity here, for you, to create things that enable people.\n\nThe gap between what a body could do and what society expected has inspired many innovations.\n\nMicrophones came to be because people’s voices really aren’t that loud, but still, people are expected, or want to, speak to large audiences.\n\nGlasses were created because many people have blurry vision, but society kind of expects people to read small text and to see things from a distance.\n\nAnd lastly, curb cuts. The ramps down from the sidewalks to the crosswalk were invented to close the gap between wheelchair wheels and the step down to the crosswalk. I love this example, because such a simple invention makes life so much easier for cyclists, parents pushing strollers, delivery people pushing dollies, in addition to people who use wheelchairs.\n\nIt shows how inclusive design has the power to make things better for everyone.\n\nThe inclusion gap really is a source of innovation. I mean, all of these came from the gap between what bodies could do and what society expected bodies could do. When you innovate and create a more inclusive society by how you design your apps, and as you make it easier for people to live in a world that isn’t yet designed for them, the inclusion gap gets smaller and smaller, and society becomes more inclusive, flexible, and convenient for everyone. So try looking for the inclusion gap in your app, and as you do, think about how you can work with people who have disabilities, so that you can avoid making assumptions that might lead to unintended results. As a person with a disability, I have that unique lived experience that is so much more valuable and accurate than making assumptions.\n\nIn the disability community, we believe “Nothing about us without us”. This slogan was coined by disability rights activists who fought to have no policies created without the full participation of those who it affects. It is so important to not make decisions that impact people with disabilities without them being a part of it.\n\nAnd as a developer, when you involve members of the disability community, you will gain new insights that will help you design your app to be more inclusive. It’s also unlikely that you’ll always have someone with every disability working with you all the time. So here are four practical things you can do to make your app more inclusive, while you look for people with disabilities to collaborate with.\n\nFirst, support multiple senses.\n\nSecond, provide customization.\n\nThird, adopt Accessibility API.\n\nAnd finally, track inclusion debt.\n\nWe’ll illustrate these points through first-party examples and apps from developers like you.\n\nOkay, so one of the best ways to include people with disabilities is to support multiple senses through building in a variety of ways for people to interact with your app. Think of captions for videos. A lot of videos have sounds and speech, but not everyone can hear. So providing an additional way to access that information, makes it more inclusive. It also has this wonderful side effect of making content accessible to people that can hear, but are in a place where they need to be quiet. Making it possible to get information and input information in a variety of ways is the first step to closing the inclusion gap within your app.\n\nSo imagine if a person is deaf, hard of hearing, or they’re in a quiet place like a library. Will they be able to experience what your app has to offer? Is there a visual way of getting the information? Or imagine a person who is blind or someone goes into a situation where they can't look at their device. Is there an audible way to experience your app? Considering the many ways that people will need to interact with your app will help you come up with new ways of using your app.\n\nExactly. Here's an example from a new feature called Accessibility Reader.\n\nAccessibility Reader makes it possible to customize the reading experience of any content on screen. It supports a variety of reading styles that make it so you can always read in the way that works best for you.\n\nOf course, it has visual text, which is how society typically expects people to read.\n\nAnd this is great for people that prefer reading with their eyes.\n\nAt the same time, not everyone can or wants to read visually. But you can just press play and listen to the content without looking at the phone at all.\n\nOr, you could take advantage of both sight and hearing. You might notice that the words are being highlighted as they are read aloud. This is great for people who have a cognitive disability, for example, and do better reading when they can visually follow along with what's being spoken. So as you design your app, consider if people can experience your design using their different senses, their sight, their hearing, their touch, their voice, and their cognitive skills.\n\nIt’s important to explore design options like visuals, audio, and haptics.\n\nHere’s a few really good examples from the third-party app Crouton.\n\nCrouton is a really cool recipe app that provides a fun and easy way for people to store all of their favorite recipes. Let’s focus on the different ways someone can import a recipe.\n\nTap the plus button at the top to see the options. For someone who might not be able to type, the “From Image” and “From Camera” options are great alternatives as it pulls the recipe directly from an image. And the “From Text” option is great for someone who might not be able to see but can still type. And there’s also a Hands Free mode. Check this out. If you tap on a recipe, then tap play, you can then tap on the eye button at the top to turn on Hands Free mode.\n\nThis allows you to go through the steps of your recipe without having to touch your device at all. This is great for someone who might have difficulty using their hands, or their hands are all sticky from preparing food.\n\nCrouton is a great example of how an app allows people to use a variety of ways to interact, whether it’s their hands, eyes, or mouth. Designing for multiple senses within your app will make it so much more inclusive. But it won’t cover everyone’s unique situations. so it’s really important to provide customization.\n\nIn particular, it’s important to make sure that people can personalize the UI and interactions that go with each of the senses, tailoring the experience to their unique way of being.\n\nMaking it possible to customize the experience like this, will close the inclusion gap even more.\n\nTake Accessibility Reader, for example. It has options for personalizing the visuals, the audio, and the read-along experience. When it comes to the visuals, for example, you can adjust the text size, change the colors, choose “high-legibility” characters in the San Francisco font, or choose a different font all together.\n\nSo what options do you think you could add to your app that will help people tailor the experience to their individual needs? I've got a great example of this.\n\nCarrot Weather is a third-party weather app that makes it so easy to view weather information in the way you want.\n\nYou can customize all the different visuals and charts. This is great for people who want to see every detail in a dense interface, as well as people who have a cognitive disability and need minimal information on the screen. Check this out. You can go from this very data-rich layout to this super simple interface that only shows what a person wants on the screen. And every layout makes it really easy to change the customization options. By providing customization in their app, this allows people to really make it their own.\n\nThis is how an app adapts to people rather than expecting people to adapt to an app. It’s really great. Now that you have built in support for multiple senses and provided customization, the next step is to adopt Accessibility API to make sure your app works well with assistive technologies. Assistive technologies are used by people every day. They’re things like wheelchairs that support moving freely and independently, white canes for navigating surroundings without relying on vision, and more.\n\nIn Apple products, these are accessibility features that help you connect, create, and do what you love in the ways that work best for you. You can adopt many of these accessibility features directly into your app through APIs. VoiceOver makes it so you can use a screen-based product without having to see the screen at all. And you can support it by adding things like accessibility labels and actions through the Accessibility API.\n\nThe same API that makes VoiceOver possible also enables other features like Switch Control and Voice Control, both of which make it possible to use touchscreen products without having to touch the screen at all.\n\nAnd Larger Text is another one that is so important to include in your app. It makes text up to three times larger, and with some layout adjustments, you can make your app look beautiful and highly legible. These Accessibility APIs are great because a lot of the work is already done for you, making it even easier to support disability inclusion in your apps.\n\nYou can check out developer.apple.com/accessibility to learn more about adopting the Accessibility APIs.\n\nEarlier, I talked about curb cuts. In the same way that sidewalks are built with curb cuts for people who use wheelchairs, it’s important to adopt the Accessibility APIs so that people who use accessibility features can also use your app. Adopting Accessibility APIs will help you close the rest of the inclusion gap. Since Accessibility Reader integrates Accessibility API, it also works with Switch Control. That means you can also use it without ever touching the screen. With Switch Control, you can assign actions to a variety of buttons that you can pair with iPhone. These physical buttons are called switches, and they can be configured in a variety of ways.\n\nOne common configuration is to have one button go to the next item and another one to select. And on screen, a square outline moves from item to item.\n\nSo, since Accessibility Reader works with Switch Control, a person can easily navigate to the play button, select it, and enjoy the audio reading experience.\n\nAs you design your app, consider if it works well for people who use assistive technology like Switch Control. If it doesn’t, or if you don’t know, try working with people that use assistive technologies to come up with solutions. And remember that adopting Accessibility APIs and testing VoiceOver and Switch Control will go a long way. Let's check out another example. Let me tell you about Blackbox.\n\nBlackbox is a really unique puzzle game where you solve challenges using the different sensors on your iPhone. For example, this challenge uses your iPhone’s gyroscope. With very few hints, you solve this puzzle by rotating your iPhone a full 360 degrees while it’s completely flat. What’s great about Blackbox is that the game supports the VoiceOver API so that players who are blind or have low vision can still navigate and solve challenges. Every puzzle has audio labels just like this: “Clue. 360 dashes in a circle” In addition to rich audio and haptic design, the VoiceOver labels provide players with just enough hints to solve the puzzles even if they can’t see the screen.\n\nSo remember to adopt the Accessibility APIs so that people who rely on accessibility features can also enjoy your app. All right. So last, but definitely not least, is to track inclusion debt. Even as you strive to make your app inclusive, you will most likely continue to notice the inclusion gap.\n\nThink of this as inclusion tech debt, or just inclusion debt for short.\n\nThis is normal. Inclusion is a journey, it's not a one-time thing. The most important thing is to be aware of the gap that exists in your app so that you can make plans for closing it and make conscious decisions as you design.\n\nFor example, there’s still room for Accessibility Reader to grow in formatting for enhanced readability and options for different reading styles. And since those things are known, it’s so much easier to plan and design what comes next.\n\nRemember, the inclusion gap is an opportunity! And discovering the inclusion gap leads to creativity and innovation. So don’t be afraid to go look for it in your app.\n\nTake some time now. What kind of gap do you think exists in your app today? Work on understanding it better.\n\nThere will probably be parts of the gap you don’t know about yet, so think about how you can discover more of it.\n\nAnd then, think about how you’re going to work with people who have disabilities to collaborate on closing the gap.\n\nAs you do this, you'll be creating a more flexible and inclusive world for everyone.\n\nAnd that's it! Remember, disability is just as much about the environment as it is about the body.\n\nYou can learn more about the Accessibility APIs by watching the WWDC24 video, “Catch up on accessibility in SwiftUI”. And this year, you can highlight your app’s accessibility on the App Store. This helps people to know if your app supports the key features they rely on. To learn more, watch the WWDC25 video, “Evaluate your app for Accessibility Nutrition Labels\" We hope this inspires you to design your apps more inclusively and supports you in creating a more beautiful world. Thank you so much for watching.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Human Interface Guidelines: Accessibility",
        "url": "https://developer.apple.com/design/human-interface-guidelines/accessibility"
      },
      {
        "title": "Human Interface Guidelines: Inclusion",
        "url": "https://developer.apple.com/design/human-interface-guidelines/inclusion/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/316/6/59b25911-3ac3-41d5-a2db-2175a37a118f/downloads/wwdc2025-316_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/316/6/59b25911-3ac3-41d5-a2db-2175a37a118f/downloads/wwdc2025-316_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "224",
      "year": "2025",
      "title": "Evaluate your app for Accessibility Nutrition Labels",
      "url": "https://developer.apple.com/videos/play/wwdc2025/224"
    },
    {
      "id": "10275",
      "year": "2021",
      "title": "The practice of inclusive design",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10275"
    },
    {
      "id": "10304",
      "year": "2021",
      "title": "The process of inclusive design",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10304"
    }
  ],
  "extractedAt": "2025-07-18T09:07:30.505Z"
}