{
  "id": "215",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/215/",
  "title": "Engage players with the Apple Games app",
  "speakers": [],
  "duration": "",
  "topics": [
    "Graphics & Games"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi, I’m Logan Pratt, and I'm an engineer on the App Store Connect team.\n\nIn this video, I’ll guide you through the new Apple Games app, and all the great features you can use to bring players into your game, and get them excited to keep playing it. Today, players can go on the App Store to find new games and discover what features they offer.\n\nAnd now, the Games app gives players a brand-new, all-in-one destination for their games. They can launch their games, discover new ones, and have even more fun playing with their friends.\n\nThe Games app comes pre-installed on iPhone, iPad, and Mac. Its features are integrated throughout the operating system, and can appear in widgets, notifications, and the App Store. Let’s take a look.\n\nWhen a player first opens the app, they’re taken to the Home tab.\n\nThis will highlight events happening in their games, what their friends have been playing, updates on their friends’ game center activity, curated game collections, and more. Players can also tap on a recently played game to instantly start the game back up, right where they left off. Your games will each have a dedicated page in the app. New players can see all the details and get excited about your game, And existing players can check their progress on your game’s achievements, leaderboards, challenges, and multiplayer activities, as well as download updates. Tapping Invite to play makes it super easy to jump right into playing with friends.\n\nIn the Play Together tab, players can find out what their friends are playing, compare high scores, and invite friends to compete or join multiplayer experiences.\n\nThe Library is where players can find the games they've already installed in one place, or redownload a game they've already purchased. Then they can launch their games by tapping Play.\n\nAnd the Search tab is a great starting point for players to discover their new favorite games. For many players, the Games app will be a daily hub whenever they're ready to have some fun.\n\nTo tap in to all of the benefits this app will provide your games, I’ll show you how to set up your game information to display in the app.\n\nI’ll also show you how to leverage Game Center features, to maximize the places your game will appear.\n\nAnd, I'll show you some other techniques that can help you keep players engaged in your game more than ever before.\n\nLet’s get started! Setting your Primary or Secondary Category to Games is what makes your game eligible to display in the Games app, with its own customized game page.\n\nFor example, here's the game page for the new Arcade game, What the Clash, and it looks great! It shows the game's icon, name, and subtitle. These show up in lots of places throughout the Games app. They're your first opportunity to spark a player's imagination.\n\nThe Games app will automatically customize the background to complement the colors in your game's icon.\n\nSince What the Clash has integrated with Game Center, I can see Memoji for my friends who most recently played the game. These appear around the icon. The game page also displays the age rating and category.\n\nThe subcategory you've selected for your game will also appear here. What the Clash is set as an Action game.\n\nSubcategories help players find games in their favorite genres. Each one has a unique icon that appears right next to it on the game page.\n\nI’m developing my own game with some friends. It's called The Coast, and I want it to look amazing in the Games app too! In App Store Connect, I've already set the game's Name, Subtitle, Category, and Age Rating in the App Information tab.\n\nI want The Coast to appear in the Games app, so I set its Primary Category to Games and its Subcategory to Action.\n\nBack in the Games app, I’m interested to see how players will learn more about What the Clash. Next to the category, I see a Game Controller icon, which tells me this game has support for them.\n\nI love playing games with a controller! If I want to find a few more, I can go to the Library and Filter my installed games by controller support.\n\nIf your game supports controllers, make sure you add the Game Controller Capability to your game in Xcode. That way, your game will also have the game controller badge in the Games app and the App Store. To learn more, check out “Tap into virtual and physical game controllers”.\n\nAlright, my friends play this game and it supports controllers?! Now I gotta check out its previews to see what I’m missing out on! This game looks fun! Underneath the previews, I can read the game's description and see a more prominent view of the game details.\n\nYour game's Name, Category, and Previews also appear in search results, and are a great way to attract new players.\n\nTo set these up for The Coast, I'll go back to App Store Connect, and click on my new iOS version. I uploaded a high-quality video preview and some screenshots, then set the Description, and accurate Keywords for search.\n\nAnyone viewing The Coast in the Games app will now get a great preview into what it’s all about.\n\nLet's rewind a bit. Even before your game is launched, you can generate excitement and anticipation with a pre-order.\n\nThe developer, Triband, set up a pre-order before What the Clash was released. When you set up a pre-order, your game appears in the Games app, listed as an Upcoming Release. Players can opt in to have it automatically downloaded to their device on release day. And they can even share it with friends! To learn more about configuring a pre-order, check out “What’s new in App Store pre-orders.” Those are the basics for making your game really shine on the Games app. But there's so much more you can do with the help of Game Center. Game Center is a suite of features that helps players engage deeper in their games, and discover new games through their friends.\n\nGame Center also makes it easier for players to connect and compete with their existing contacts, in keeping with Apple’s commitment to privacy.\n\nYour game can add many features from Game Center, including Achievements, Leaderboards, Challenges, and Activities. These features let players keep track of their progress, compete for high scores, and invite their friends to play along.\n\nNow that I’ve started playing What The Clash, its game center features are prioritized to display at the top of the game page. I can see the Multiplayer activities I can join, which of my friends are also playing this game, Active challenges I have with those friends, and all of the game's Leaderboards and Achievements.\n\nI can tap ”Play” to jump right back in where I left off, or ”Invite To Play” if I want to start a new challenge or activity with my friends.\n\nAnd that's just part of the story. Once you implement Game Center features, your game will show up in many other places in the Games app, like Home tab highlights, and the Play Together tab. You can configure your Game Center features using App Store Connect or the App Store Connect API. And new this year, directly in Xcode.\n\nMy friends, Josh and Varokas, have also been working on The Coast with me and created some new game center features for it using Xcode. I'm leaving most of the setup to them, but I’ll highlight some important pieces in App Store Connect too.\n\nYou can find out more about each feature, and how they're set up, in ”Get started with Game Center.” To add game center features to The Coast, I first had to click the Game Center checkbox for my iOS version to enable it.\n\nThe more Game Center features you add to your game, the more chances your game has to appear across the Games app.\n\nLet’s talk about Achievements! They track gameplay progress, encourage exploration to complete them all, reward players for reaching special milestones, and allow them to share that progress with friends.\n\nI’ve already completed a few achievements in What the Clash, but I wanna see what other goals to aim for. I’ll tap on Achievements to see them all.\n\nNow, I can see all the achievements I've completed, progress on ones I'm still working on, and which ones my friends have earned.\n\nWhen players have completed an achievement, they’ll see its localized image, display name, and earned description. From here, they can tap the Play button to keep earning more.\n\nAnother feature that lets players track their progress in your game is Leaderboards.\n\nThey’re a great way to let players measure their skill, compare their talents with friends, and encourage competition and continued attempts at a high score.\n\nIn the Games app, Home and Play Together highlight score updates on leaderboards that friends are playing on, which will encourage players to attempt to beat the high score.\n\nLeaderboards display their localized Display name and Description, at the top of the screen.\n\nDescription is a new field, so be sure you set it for all of your new and existing leaderboards.\n\nFor a recurring leaderboard, players will also see how much time is left until it resets.\n\nThis leaderboard has points set as the suffix for the score, in the English localization. I’m 280 points behind first place. I gotta keep playing to catch up! To see all the other leaderboards in What the Clash, I can tap the Leaderboards section on its Game page.\n\nHere, I can see which leaderboards I’ve ranked on, which ones I haven’t played yet, and which ones my friends are playing on. Josh and Varokas told me they've set up a new leaderboard for the Cape Cod level in The Coast. Since leaderboard descriptions are a new field, and the images show up in the Games app, I want to make sure they’re added. So I’ll check it out in App Store Connect. I can go to the Game Center tab on the left side, to see all of The Coast’s leaderboards. Nice! I see one for Cape Cod, that level is super fun.\n\nEverything they've set up looks good so far. But I want to check its description and image. To do this, I’ll click into a localization. Perfect! They set up a detailed description, and uploaded a high quality image. Our players better avoid the sneaky lobsters! Now that I’ve made sure our leaderboards are set up properly, I want to see what else What The Clash uses leaderboards for. Tapping ”Play” will bring me directly into the level associated with the leaderboard, using a deep link. But for now, let’s see what happens when I tap Challenge.\n\nChallenges are a great new way to help players bring friends into your game. They’re built on top of leaderboards and turn single-player games into social experiences with friends. Challenges give players a way to compete in score-based rounds with any of their friends, see scores in real time, crown a winner, and have a rematch.\n\nAnd they’re time-limited, to motivate players to jump in before the time runs out.\n\nThe Home tab of the Games app highlights the results of Challenges, and tracks progress and invitations. This gives extra visibility to your leaderboards and your game.\n\nNikki won this challenge, so I can tap ”Rematch” to restart it.\n\nBut, I know she’s too good at this level, so instead, I’ll go to the Play Together tab to start a different Challenge.\n\nIn Play Together, players can see ongoing activity from their game center friends such as invites, multiplayer progress, and score updates.\n\nI want to start a new Challenge, so I’ll tap ”Pick a game”, This shows all installed games that support challenges and multiplayer activities along with recommendations on which ones to start playing.\n\nI selected What the Clash, and want to start the Elefriends Rally challenge.\n\nIts localized Image, Display name, and Description, give a preview into what kind of challenge this will be.\n\nI can choose how many tries we’ll each get to submit our best score and decide how long the challenge will last.\n\nI want this one to last one day. So we’ll all have three tries in the next day to compete for the win.\n\nThen, I can invite friends to join me in the challenge, and tap start to send them a notification to join. You can also show this invite flow inside your game, so players can invite each other to challenges without leaving it.\n\nLooks like my friends accepted my challenge and started playing! Nikki is in the lead and used 2 of her 3 tries so far.\n\nI’ve only used one and there’s 23 hours left, so I’m not worried, there’s plenty of time for a comeback! Tapping ”Play” will take me directly to the Elefriends Rally in the game, where I can start the challenge using the same deep link as its leaderboard. Challenges can be a great way to boost player engagement! We definitely need to set some up for The Coast! Varokas created one for our Cape Cod leaderboard, so I’ll check it out in App Store Connect. I’ll head back to the Game Center page, scroll down to the Challenges section, and click on the Cape Cod challenge. Awesome! He already uploaded a high-quality default image to show the experience of the challenge and get our players excited to play it. It’s attached to the Cape Cod leaderboard so players will be taken straight to the Cape Cod level when they start the challenge.\n\nHe also set its Display Name and Description for each localization, thanks Varokas! We haven’t had a chance to create images for different localizations yet, but we can upload them here or in Xcode, to override the default image when we do.\n\nWhen setting up challenges in your game, you can specify the minimum platform versions required for participation. Only live versions with Game Center enabled can be selected here.\n\nNow that we’ve set up our Cape Cod Challenge and Leaderboard, we need to deep link players directly to the Cape Cod level in our game.\n\nOur other new feature, Activities, can do this. I’ll show you how.\n\nActivities allow you to define a destination in your game, and use a deep link to bring players directly to it. They can be associated with Game Center features to deep link players directly into scoring on a leaderboard, starting a challenge, or completing an achievement. And they’re especially powerful for helping players discover and join multiplayer experiences. The Games app promotes your Multiplayer Activities to players on the Home tab and in the Play Together tab, same as with Challenges. On the Game Page, Multiplayer Activities are displayed right at the top. And tapping “Invite to Play” brings me to the Play Together popup to view Challenges and Multiplayer Activities. This activity looks cool, I’m gonna check it out.\n\nWhen tapping into an activity, players will see its localized image, display name and description.\n\nThe activity’s participant range will let players know how many friends can join them. And the generated party code will give players the option to share it with friends. They can share this invitation as a link outside of the Games app, even to friends playing across platforms.\n\nOr they can invite friends in the Games app. I want to play this activity with Nikki, so I’ll select her name.\n\nInviting a friend to an activity within the Games app will send them a push notification to join.\n\nThen I can tap “Invite and Join” to start it.\n\nAnd look at that! I’m in The What the Clash activity lobby where Nikki can join by tapping the notification or entering the party code in the game. To promote and give more visibility for our multiplayer mode where players can race around our levels in the Coast, Josh and Varokas created a Multiplayer Activity called Race at Sea.\n\nI want to check out what they’ve set up in App Store Connect. They uploaded a high-quality default image, set the participants range, and selected “Yes” for supports party code.\n\nThis will display 2 to 32 players on the activity card in the Games app, so players will know how many people they can play with, and give them a party code to share with friends.\n\nThe activity deep link is what brings players directly to this activity in the game, and has customizable properties to influence how it affects your gameplay.\n\nAttaching the Cape Cod leaderboard to this activity will use the configured deep link to bring players straight to the Cape Cod level in the Coast, when tapping play on its Leaderboard or Challenge.\n\nAnd just like Challenges, its display name, description, and image can be localized.\n\nSo far, I’ve covered setting up your game in App Store Connect, and all the Game Center features that can boost your game's visibility across the Games app, and make it easier for players to invite their friends into your game. Now, let’s talk about something super important for a long-term success: using time-limited content to keep players engaged after they’ve downloaded your game. In the Games app, In-app events highlight timely events within Games, such as limited or new content, seasonal activities, or special promotions. This creates a sense of urgency and excitement! Using events will expand your reach by promoting them all over the Games app, keeping your current players informed, and reconnecting with players who haven’t played in a while. The Home tab highlights your ongoing events with their Event card artwork or video, and Event badge to inform players what type of event it is, and the Event's localized name and short description, giving players a quick peek into the event. There’s also a dedicated Events & Updates section within the Library, which will show all current and upcoming events.\n\nAnd when existing players search for your game, they’ll see its ongoing event as the search result card, in place of the regular app preview card.\n\nThe Game Page will also highlight your game’s events, with high priority events taking precedence. I wanna see what other events What The Clash has. Tapping into the events section will show all current and upcoming events. Current events show as “Happening Now”, and Upcoming events show their configured start date and time.\n\nThis event looks cool, so I’ll definitely come back to play when it starts. Tapping on an event brings up the full-screen event details page with its high-quality artwork or video, badge, name, and long description, giving an even more detailed preview into the event. I can share it with friends and tap play to go straight to the event in the game.\n\nExisting players can tap “Play” from any of the places events show in the Games app, making it super easy to jump in. This uses your configured event deep link to bring them directly to the event in your game.\n\nAnd for players who don't have your game installed, the View button will take them to the Game Page so they can download it and learn more.\n\nTo promote our new Race at Sea activity to our player base, I created two in-app events for it. Let’s check them out! In App Store Connect, I’ll go to the In-App Events tab to view them. I created an In-App Event to promote the launch of our Race at Sea Activity, so players see it front and center in the Games app. I also created an event for National Lobster Day, called Lobster Bash, to bring players back to the game, and straight into the Race at Sea activity. We have all sorts of exciting surprises, special content and even more sneaky lobsters in store for this event! I uploaded a short looping video for the event card, and high-quality artwork for the event details page. This gives players a preview of the event and grabs their attention when it pops up in the Games app. To make Lobster Bash even more visible, I set the Publish Start Date to be two weeks before the actual start date. This way, it’ll appear as an “Upcoming Event” in the Games app. Players can then sign up to get a notification when it goes live and share it with friends. I set the Event deep link to point to our Race at Sea activity. This will bring players directly to the activity in The Coast when they tap “Play” on the event in the Games app. I also added the event=lobsterbash parameter to the Event deep link, so our in-game handler will know which event linked the player to this activity. I want this to be the first event players see on The Coast’s game page, so I set this to be a high-priority event. I can’t wait for our players to see this! To learn more about in-app events and how to set them up in App Store Connect, go check out our previous videos, ”Meet in-app events on the App Store”, and ”Get started with in-app events”.\n\nI've covered a lot of ground, from setting up your game’s information, game center features, in-app events, and more. You should now be all set to bring your game to the Games app! If you have an existing game, take a look at your game page in the Games app, and see if you need to update any information. Make sure you have Game Center enabled, and integrate any features you haven't added yet, to appear in more places across the new app. And consider adding some excitement by planning a new in-app event.\n\nThanks for watching, I can’t wait to play all of your fun games soon!",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Creating activities for your game",
        "url": "https://developer.apple.com/documentation/GameKit/creating-activities-for-your-game"
      },
      {
        "title": "Creating engaging challenges from leaderboards",
        "url": "https://developer.apple.com/documentation/GameKit/creating-engaging-challenges-from-leaderboards"
      },
      {
        "title": "Human Interface Guidelines: Game Center",
        "url": "https://developer.apple.com/design/human-interface-guidelines/game-center"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/215/4/e02f5046-a82b-4e61-8d1d-7baaf1c5a28b/downloads/wwdc2025-215_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/215/4/e02f5046-a82b-4e61-8d1d-7baaf1c5a28b/downloads/wwdc2025-215_sd.mp4?dl=1"
  },
  "relatedVideos": [
    {
      "id": "214",
      "year": "2025",
      "title": "Get started with Game Center",
      "url": "https://developer.apple.com/videos/play/wwdc2025/214"
    },
    {
      "id": "209",
      "year": "2025",
      "title": "Level up your games",
      "url": "https://developer.apple.com/videos/play/wwdc2025/209"
    },
    {
      "id": "328",
      "year": "2025",
      "title": "What’s new in App Store Connect",
      "url": "https://developer.apple.com/videos/play/wwdc2025/328"
    },
    {
      "id": "10015",
      "year": "2023",
      "title": "What’s new in App Store pre-orders",
      "url": "https://developer.apple.com/videos/play/wwdc2023/10015"
    },
    {
      "id": "10171",
      "year": "2021",
      "title": "Meet in-app events on the App Store",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10171"
    },
    {
      "id": "10081",
      "year": "2021",
      "title": "Tap into virtual and physical game controllers",
      "url": "https://developer.apple.com/videos/play/wwdc2021/10081"
    }
  ],
  "extractedAt": "2025-07-18T10:28:48.940Z"
}