{
  "id": "367",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/367/",
  "title": "WWDC25 Platforms State of the Union Recap",
  "speakers": [],
  "duration": "",
  "topics": [
    "Essentials"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hello developers and welcome to the platform's State of the Union recap.\n\nWe've got a lot to cover so let's dive in and start with the beautiful new design that offers you the perfect opportunity to refresh and modernize elements of your app. It's built with liquid glass, a dynamic material that enables an entirely new level of depth and vitality by combining optical qualities of glass with a sense of fluidity. It brings greater focus to your content and a greater harmony to your apps across Apple platforms.\n\nAnd there's a new tool for creating those stunning layered icons for your app, Icon Composer, which gives you the ability to blur, adjust translucency, test specular highlights and preview icons in various tints.\n\nOkay, let's talk Apple Intelligence. You already know about writing tools, Genmoji and Image Playground. There's me.\n\nNow it's time to meet the Foundation Models framework. Tell us all about it, Josh. The Foundation Models framework allows you to tap into our highly optimized on-device Foundation model, which is specialized for everyday tasks. With this API, you can use the framework to power intelligent features in your app, using model capabilities such as text extraction, summarization and more. And since the model is on-device, your user's data stays private. It doesn't need to go to a server-side model or to anyone else. And it's all at no cost to you or your users for any requests. Thanks, Josh. Next up, we're excited to introduce Xcode 26 with integrated support for generative coding models. You can now use the model of your choice to help you write code, documentation, tests and more.\n\nXcode has built-in support for chat GPT. And in your source editor, we have coding tools. They're just like writing tools, but for code. You can use them anywhere to get suggested actions, like generating a preview or a playground or fixing an issue with your code. And if you're looking for something more specific, just ask for it. Let's talk about Swift. This year is all about performance, concurrency and interoperability. And Swift 6.2 simplifies writing single-threaded code.\n\nYou can now configure modules or individual files to run on the main actor by default, eliminating the need for additional annotations. For what's new with SwiftUI, Summer, take it away. We're always working on making SwiftUI better for the developer community. And this year, we're adding new web APIs, support for 3D charts and big improvements to performance.\n\nWe've also added new rich text editing capabilities. To enable rich text editing, simply change the binding of your text editor's text from a string to an attributed string. Now, you have a rich text editor with styling you can fully customize. Thanks, Summer. Hey there, game, graphics and ML developers. Check out Metal 4, designed for Apple Silicon with tons of new features like these. Metal FX frame interpolation and denoising APIs can take your game's graphics and performance to the next level. Game Porting Toolkit 3 has more new tools to make it even easier to optimize your game with support for Windows upscaling technologies. Apple devices come with first-class game controller support. And this year, support for PlayStation VR2 Sense controllers enable exciting new ways to play games on Apple Vision Pro.\n\nAlright, time's getting tight. Let's go into the lightning round. Terminal gets 24-bit color, new themes and powerline fonts.\n\nOn Vision Pro, you can integrate stunning 180-degree, 360-degree wide field-of-view media and Apple immersive video into your apps with the Apple projected media profile. CarPlay has live activities so you can deliver timely updates to people on the road. And check out the new declared age range API, accessibility nutrition labels and updates to family sharing and assistive access.\n\nNow, it's up to you.\n\nWe can't wait to see what you create with the new design. Apple Intelligence, Xcode, Swift, SwiftUI, Metal and everything else covered in more than 100 video sessions.\n\nHappy Dub Dub.\n\nWe'll see you out there.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/367/2/56654673-9cbe-4dc1-bdbe-7960bd7d92c2/downloads/wwdc2025-367_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/367/2/56654673-9cbe-4dc1-bdbe-7960bd7d92c2/downloads/wwdc2025-367_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T10:20:26.963Z"
}