{
  "id": "404",
  "year": "2025",
  "url": "https://developer.apple.com/videos/play/wwdc2025/404/",
  "title": "Make a big impact with small writing changes",
  "speakers": [],
  "duration": "",
  "topics": [
    "Design"
  ],
  "hasTranscript": true,
  "hasCode": false,
  "transcript": {
    "fullText": "Hi, I'm Liv Huntley.\n\nAnd I’m Jennifer Bush. We’re UX Writers here at Apple. And when we’re asked about how to improve the writing in apps, the advice we give most often is to simplify.\n\nWhile you’re thinking about how Apple’s new design system will affect the look and feel of your app, it’s a perfect time to also consider the writing.\n\nIn this session, we’ll help you get started with four small writing changes you can make that will have a big impact on your app. Liv will get us started.\n\nFirst I’ll cover one of the most common pitfalls I see in apps: adding too many filler words, and how to tighten up your writing by removing those unnecessary adverbs, adjectives, interjections, and pleasantries.\n\nThen I’ll talk about avoiding repetition, and how to cut redundant phrases and ideas to help you clearly deliver your message.\n\nLater, Jen will show you how to lead with the why by doing some hands-on editing to give your sentences more impact.\n\nAnd she’ll conclude by talking about how a word list makes it easy to keep consistency in your app.\n\nI'll start by talking about filler words. A common misconception in UX writing is that we need to fill all the empty space. Think about it this way. Remember when you were a kid in school and you had to write a thousand word essay? You’d make sure that essay was very, extra, overly descriptive. Fortunately, your app doesn’t have a minimum word count. In fact, usually the opposite is true and it's best to remove words. I’ll show you some of the most common types of fillers, starting with adverbs and adjectives.\n\nAdverbs are words that describe actions like “easily” and “quickly”. And adjectives describe nouns. Those include words like “fast” and “simple”. Of course, there are many more, and when you notice words like these, it’s worth a pause to see if they’re needed. I'll give you an example.\n\nI was recently on vacation and parked my rental car in a garage that required an app to pay. I didn’t have the app, so I had to walk toward the exit where I’d have enough cellular signal to download it. Once I did, I saw this message inside the app.\n\n“Simply enter your license plate number to quickly pay for parking.” But I was in a rental car and I didn’t know the license plate number, so I had to walk back to the car to get the number. And because I didn’t have any signal, I had to walk back up to the exit before I could pay. It wasn't that simple or quick after all.\n\nIf I remove the words “simply” and “quickly” from this message, It now says, “Enter your license plate number to pay for parking.” I haven't lost any clarity, and I don’t make assumptions about the context of the person using it.\n\nThe final message is very similar to the one I started with, but the small change of removing those unnecessary descriptive words makes the message more impactful.\n\nOf course there are times when using some descriptive text can be useful. Consider an example of an app that connects to a pet food dispenser. You can use the app to feed your pets automatically.\n\nWhen describing this app, I might write a sentence like this: “Feed your pets when you’re away.” But that leaves out a key feature that sets this app apart: the convenience of being able to automatically feed them every day according to a schedule.\n\nBy adding the word “automatically” to the sentence, I can clarify the behavior so people understand how the app works.\n\nWhen you're writing for your app, resist the urge to fill space by saying too much. If you see descriptive language in your app, pause and ask yourself: Does each word add value? I find that more often than not, those adverbs and adjectives are used as fillers and can be removed.\n\nTwo more types of fillers are interjections and pleasantries. Interjections are abrupt words or phrases like “oops,” “oh no,” and “hooray.” These are remarks used in polite conversation like \"sorry,\" \"thank you,\" and \"please.\" While it might seem like these words make your app feel more personal, it’s best to remove them when they don’t add any meaning to the message. Let’s look at an example using these types of fillers.\n\nIn this example, someone is waiting for a delivery and they get a notification. The headline says, “Uh oh. We’re running late,” and the rest of the message says, “We’re sorry, your delivery driver won’t make it on time. They’ll be there in 10 short minutes! Check the app for your driver’s location.” To improve this message, I’ll look at the fillers.\n\nFirst, I see the word “uh oh” in the headline. Words like “uh oh, “oops” or “oh no!” in error messages can make it sound like you’re not taking the problem seriously.\n\nIn the main body of the message, the words “We’re sorry” aren’t necessary. When something doesn’t go smoothly, of course we’re inclined to apologize, but in an alert like this, it sounds insincere and takes away from the primary purpose of the message. The body also mentions “10 short minutes!” While 10 minutes may not seem like a very long time, for the person waiting for the delivery, it might be critical, and the exclamation point further makes light of the situation. Try to avoid unnecessary punctuation disguised as a kind of filler.\n\nHere I’ve taken out those filler words and already the message is much improved. “We’re running late. Your delivery driver won’t make it on time. They’ll be there in 10 minutes. Check the app for your driver’s location.” I see a few more things I might edit on this message, but before I do that, I want to tell you about another small writing change.\n\nAvoid repetition. Repetitive language in your app is also a form of filler. Resist the urge to fill empty space by saying the same thing in different ways. I’ll go back to the previous example of an alert about a delivery driver running late. The headline “We’re running late” says basically the same thing as “Your delivery driver won’t make it on time” and the new time of arrival “in 10 minutes.” I can combine those thoughts by changing the headline to “Delivery delayed 10 minutes.” In one sentence, I explain both that there was a delay and by how much.\n\nI can keep the rest of the message as  “Check the app for your driver’s location.” The final alert is not all that different from the one we started with. But by removing repetition, I was able to simplify quite a bit, and it only took a minute or so to do. UX writing is all about economy of language. Resist the urge to fill all available space with repeated information.\n\nAnother small change you can make I like to call “lead with the why”. Messaging is most effective when you tell the people using your app why taking that next step will be fun, or interesting, or beneficial to them. I'll give you an example. I love crossword puzzles. I do them every day and can be a little competitive. So when I got a notification from Apple News+ Puzzles that said, “Keep your streak going by solving today’s crossword,” I went straight there. One reason this is an effective notification is because it leads with the why.\n\nYou can think about this as, “To do or get one thing, first do another thing.” This shortcut applies in a lot of places, but I see it often in error messages, push notifications, or instructional copy, like tips.\n\nGoing back to that crossword notification, the “why” in this case is “Keep your streak going.” And you do that by “solving today’s crossword.” I'll show you another example, this time for a fictional restaurant app that lets people get updates about their upcoming reservations. To get those updates, people have to enter their phone number. The first draft of this instructional copy might say something like what I’ve written here: “Enter your phone number to get reservation updates.” That's pretty good. There are clear instructions, and I even included the benefit: to get reservation updates.\n\nBut it could be better. All I need to do is take the second part of the sentence, “to get reservation updates”, and move it to the front.\n\n“To get reservation updates, enter your phone number.” Now, the benefit of getting those updates is right at the front of this sentence, where it’s easiest to see and has the most impact. Take a look at the messaging in your app, and if you’re leaving the benefit for the end of the sentence, try moving it to the front. It only takes a moment to do, but really improves the impact of your message.\n\nThe last small change is a little different because it’s something you do because it’s something you do outside of your app, making a word list. Once you have one, you use it to give the language in your app more consistency. Think of the words you would use in your app, and the ones you wouldn’t, and write them down. This is a great exercise to do at the start of development, but you can really do this at any stage. Your word list can take any format that works for you, but I find a table works well.\n\nIn your first column, you’ll put any words you do plan to use in your app. For example, if I'm working on a game, the first thing players might have to do in that game is choose their in-game name. This game calls that an alias.\n\nI’ll add that to the first column.\n\nThen, in the second column, I’ll put in the words I don’t plan to use to refer to the same thing.\n\nIn this case, words like Handle, User Name, and Title.\n\nAnd if it’s helpful, you can also add a simple definition.\n\nI’ll add one that says “The player’s in-game name, shown to other players, Not used to sign in.” Now, when I need to give an instruction or refer to this name in the app, I know to always call it an “alias” and not something different.\n\nThat consistency helps provide clarity for the people using the app.\n\nSimilarly, I might add the word “health” and avoid the words “lives”, “hearts”, “energy”, and “stamina” with a definition of “Measure of player longevity.” I’ll keep going in a similar way. Whenever I add a new term or think of one already in the app, I'll add it to the list. As this word list grows, it becomes a resource that anyone working on this app can use to know how it should sound. Don’t let the idea of creating a comprehensive word list overwhelm you. This session is about small changes, so just think about adding a word at a time.\n\nOnce you have even a partial word list, you can start to use it for the UX writing in your app.\n\nFor example, when someone first sets up the game, the app might tell them: “Choose your alias.” For the description, I was even able to refer to the definition I wrote, that this is the name that is shown to other players.\n\nSimilarly, to find someone to play with, I might give the instruction to “Find an alias.” This helps people know they aren’t meant to search for, say, an email address or user name.\n\nNotice also I chose the word \"find.\" That’s another word I could add to my word list.\n\nSo I'll do that now.\n\nFinally, a player might receive a notification letting them know about a requested “Match-Up”. The message says, “A player with the alias, “ExampleAlias”, wants to play.” Looking at these three examples together, you can see that I was consistent about using the term “alias”. I never called it a “user name” or “player name” or anything else, so people using the app would always know what I was referring to.\n\nIf you’re not sure what to use for some of the terms in your app, the Apple Style Guide, available to anyone, is a good place to start.\n\nWe’ve talked about four small changes you can make that will have big impact on the writing in your app. Remove fillers, avoid repetition, lead with the why, and make a word list to help with consistency. I'll put it all together.\n\nI recently got some AirPods Pro. And as part of the setup flow, you can take a hearing test.\n\nThis intro screen is longer than some of the other types of screens I've talked about today, but the same principles apply.\n\nNotice the headline of this intro screen is “Test Your Hearing.” It doesn’t say “Take a quick and simple hearing test” or \"Easily test your hearing.\" There are no filler words.\n\nThe two paragraphs give you reasons to take this test.\n\nFirst, that “Hearing loss is common and can get worse over time.” And second, that “If you have mild or moderate hearing loss, AirPods Pro can provide hearing assistance.” Both of these paragraphs lead with the why.\n\nThe test then proceeds through a series of screens, a couple of which are shown here.\n\nNotice the Next button at the bottom. Using the same button name for the same action, in this case, moving to the next screen, helps build trust through consistency. Button labels are a great thing to add to your word list.\n\nAnd taking a closer look at just one of these screens, there's also no repetition. The headline gives a clear instruction to “Find a quiet place where you can focus and take the test.” And the description gives new information explaining why that’s important. “Too much background noise can cause inaccurate results in your test.” By applying all four small changes, these screens deliver clear and consistent instructions that make it easier and more enjoyable to move through the experience, keeping you informed and engaged throughout. We hope you find the ideas we’ve given you useful. These small changes have immediate impact on the clarity in your app. With practice, it becomes easier to spot the places in your app’s language that you can simplify. Set aside an hour or two and see how much progress you make.\n\nIn previous writing sessions, we have concluded with a piece of advice that I think is worth repeating.\n\nRead your writing out loud. It makes it easier to hear those filler and repetitive words and know where to tighten up your writing.\n\nAnd if you’re looking for other ways to improve the writing in your app, refer to our previous talks about UX writing. And for more information on how Apple’s new design system might affect the writing in your app, check the Apple Style Guide and our Human Interface Guidelines.\n\nThanks so much for joining us. Now it’s your turn to put these tools to work. A few small changes can make a big impact in your app, and we can’t wait to see how it all comes together.",
    "segments": []
  },
  "resources": {
    "resourceLinks": [
      {
        "title": "Design",
        "url": "https://developer.apple.com/design/"
      },
      {
        "title": "Human Interface Guidelines: Writing",
        "url": "https://developer.apple.com/design/human-interface-guidelines/writing"
      },
      {
        "title": "Documentation",
        "url": "https://developer.apple.com/documentation/"
      },
      {
        "title": "Forums",
        "url": "https://developer.apple.com/forums/"
      },
      {
        "title": "Apple Design Awards",
        "url": "https://developer.apple.com/design/awards/"
      }
    ],
    "hdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/404/4/59f0f7aa-24a1-477b-b61b-2baeebe52df0/downloads/wwdc2025-404_hd.mp4?dl=1",
    "sdVideo": "https://devstreaming-cdn.apple.com/videos/wwdc/2025/404/4/59f0f7aa-24a1-477b-b61b-2baeebe52df0/downloads/wwdc2025-404_sd.mp4?dl=1"
  },
  "extractedAt": "2025-07-18T09:35:24.580Z"
}